
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
#include "BasicType.h"
#include "AIModule.h"
#include "AnimGraphRuntime.h"
#include "CoreUObject.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"
#include "GameplayCameras.h"
#include "InputCore.h"
#include "OnlineSubsystemUtils.h"
#include "Slate.h"
#include "SlateCore.h"
#include "SteamCore.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"

#pragma pack(push, 0x1)

class ABP_AEK971_Weapon_C;
class ABP_AI_Character_A_C;
class ABP_AI_Character_B_C;
class ABP_AI_PlayerController_C;
class ABP_ActorIcon_Component_C;
class ABP_AssaultClass_A_C;
class ABP_AssaultClass_B_C;
class ABP_BaseCharacter_C;
class ABP_BaseFlag_C;
class ABP_BaseLethalEquipment_C;
class ABP_BasePlayerController_C;
class ABP_BaseWeapon_C;
class ABP_Base_AI_Character_C;
class ABP_Base_GM_C;
class ABP_Base_GS_C;
class ABP_Base_Objective_C;
class ABP_Bullet_C;
class ABP_CaptureTheFlag_GM_C;
class ABP_CaptureTheFlag_GS_C;
class ABP_ClaymoreLethal_C;
class ABP_Claymore_C;
class ABP_ConquestCapturePoint_C;
class ABP_Conquest_GM_C;
class ABP_Conquest_GS_C;
class ABP_Five_Seven_Weapon_C;
class ABP_FragGrenadeLethal_C;
class ABP_FragGrenade_C;
class ABP_Glock_17_Weapon_C;
class ABP_ImpactGrenadeLethal_C;
class ABP_ImpactGrenade_C;
class ABP_M24_Weapon_C;
class ABP_MG36_Weapon_C;
class ABP_MP7_Weapon_C;
class ABP_MedicClass_A_C;
class ABP_MedicClass_B_C;
class ABP_Medkit_C;
class ABP_Origin12_Weapon_C;
class ABP_PickupAmmo_C;
class ABP_PickupWeapon_C;
class ABP_PlayerCharacter_C;
class ABP_PlayerSpawn_C;
class ABP_PlayerState_C;
class ABP_Revolver_Weapon_C;
class ABP_Scar_Weapon_C;
class ABP_SmallAmmoBox_C;
class ABP_SmallExplosiveAmmoBox_C;
class ABP_SpectatorBase_C;
class ABP_SupportClass_A_C;
class ABP_SupportClass_B_C;
class ABP_ThrowingKnifeLethal_C;
class ABP_ThrowingKnife_C;
class ABP_UMP_Weapon_C;
class ABP_WeaponKnife_C;
class AMainMenu_C;
class UABP_Base_TPP_C;
class UABP_FPP_Base_C;
class UBPS_FindObjetiveFlag_C;
class UBPS_NextLocationFlag_C;
class UBPS_UpdateEnemy_C;
class UBPT_Fire_C;
class UBPT_MoveToReachableRandomPoint_C;
class UBPT_ResetFocus_C;
class UBPT_ReturnAlwaysTrue_C;
class UBPT_SetFocus_C;
class UBPT_UseMelee_C;
class UBP_CheatManager_C;
class UBP_FunctionLibrary_C;
class UBP_GameInstance_C;
class UBP_HealthComponent_C;
class UCS_Explosion_C;
class UCS_FireWeapon_C;
class UCS_Impact_C;
class UCS_Melee_C;
class UCS_Run_C;
class UCS_SniperShot_C;
class UDT_AEK971_C;
class UDT_BaseDamage_C;
class UDT_Claymore_C;
class UDT_FallDamage_C;
class UDT_Glock_C;
class UDT_Grenade_C;
class UDT_ImpactGrenade_C;
class UDT_Knife_C;
class UDT_M24_C;
class UDT_M9_C;
class UDT_MG36_C;
class UDT_MP7_C;
class UDT_Melee_C;
class UDT_Origin_12_C;
class UDT_Revolver_C;
class UDT_Scar_C;
class UDT_ThrowingKnife_C;
class UDT_UM45_C;
class UFPS_SaveGame_C;
class UWB_Ammo_Icon_C;
class UWB_BaseButton_C;
class UWB_CapturePointIcon1_C;
class UWB_CaptureTheFlag_C;
class UWB_CaptureTheFlag_UI_Icon_C;
class UWB_CaptureTheFlag_World_Widget_C;
class UWB_CharacterSelection_C;
class UWB_ChatText_C;
class UWB_ChatWindow_C;
class UWB_Chat_C;
class UWB_ClaymoreFailmessage_C;
class UWB_ConquestObjectiveProgressBar_C;
class UWB_ConquestObjective_C;
class UWB_Conquest_C;
class UWB_Controls_C;
class UWB_CookingGrenade_C;
class UWB_CreateMatchMenuAS_C;
class UWB_CreateMatchMenu_C;
class UWB_DirectionalDamageIndicator_C;
class UWB_Dynamic_Crosshair_C;
class UWB_EndGameScores_C;
class UWB_ExplosiveAmmoBox_C;
class UWB_Explosive_Icon_C;
class UWB_HUD_C;
class UWB_HoldingThrowingKnife_C;
class UWB_InGameMenu_C;
class UWB_JoinServerMenuAS_C;
class UWB_JoinServerMenu_C;
class UWB_KeyRemap_C;
class UWB_KillFeedText_C;
class UWB_KillFeedWindow_C;
class UWB_KilledBy_C;
class UWB_KillingSpreeMessage_C;
class UWB_MainMenu_C;
class UWB_Medkit_Icon_C;
class UWB_PatchNotesParent_C;
class UWB_PlayerScore_C;
class UWB_PlayerScores_C;
class UWB_PlayerTag_C;
class UWB_PriorityNextUpdate_C;
class UWB_ServerSlotAS_C;
class UWB_ServerSlot_C;
class UWB_SettingsMenu_C;
class UWB_SniperScope_C;
class UiInteractive_C;
class UiPawnActions_C;
class UiPlayerState_C;
class UiUI_C;

/// Enum /Game/FPS/AI/E_AI_Difficulty.E_AI_Difficulty
/// Size: 0x01 (1 bytes)
enum class E_AI_Difficulty : uint8_t
{
	E_AI_Difficulty__NewEnumerator0                                                  = 0,
	E_AI_Difficulty__NewEnumerator1                                                  = 1,
	E_AI_Difficulty__NewEnumerator2                                                  = 2
};

/// Enum /Game/FPS/Blueprints/CharacterAndClasses/ECharacterMovementType.ECharacterMovementType
/// Size: 0x01 (1 bytes)
enum class ECharacterMovementType : uint8_t
{
	ECharacterMovementType__NewEnumerator0                                           = 0,
	ECharacterMovementType__NewEnumerator1                                           = 1,
	ECharacterMovementType__NewEnumerator2                                           = 2
};

/// Enum /Game/FPS/Blueprints/Enums/EPlayerClass.EPlayerClass
/// Size: 0x01 (1 bytes)
enum class EPlayerClass : uint8_t
{
	EPlayerClass__NewEnumerator0                                                     = 0,
	EPlayerClass__NewEnumerator1                                                     = 1,
	EPlayerClass__NewEnumerator2                                                     = 2
};

/// Enum /Game/FPS/Blueprints/Enums/EAmmoType.EAmmoType
/// Size: 0x01 (1 bytes)
enum class EAmmoType : uint8_t
{
	EAmmoType__NewEnumerator0                                                        = 0,
	EAmmoType__NewEnumerator1                                                        = 1,
	EAmmoType__NewEnumerator2                                                        = 2,
	EAmmoType__NewEnumerator3                                                        = 3,
	EAmmoType__NewEnumerator4                                                        = 4,
	EAmmoType__NewEnumerator6                                                        = 5,
	EAmmoType__NewEnumerator7                                                        = 6,
	EAmmoType__NewEnumerator8                                                        = 7,
	EAmmoType__NewEnumerator9                                                        = 8,
	EAmmoType__NewEnumerator10                                                       = 9
};

/// Enum /Game/FPS/Blueprints/Enums/EGameModeNames.EGameModeNames
/// Size: 0x01 (1 bytes)
enum class EGameModeNames : uint8_t
{
	EGameModeNames__NewEnumerator4                                                   = 0,
	EGameModeNames__NewEnumerator1                                                   = 1,
	EGameModeNames__NewEnumerator3                                                   = 2,
	EGameModeNames__NewEnumerator5                                                   = 3,
	EGameModeNames__NewEnumerator6                                                   = 4,
	EGameModeNames__NewEnumerator8                                                   = 5
};

/// Enum /Game/FPS/UI/Enums/ESettingsLevels.ESettingsLevels
/// Size: 0x01 (1 bytes)
enum class ESettingsLevels : uint8_t
{
	ESettingsLevels__NewEnumerator0                                                  = 0,
	ESettingsLevels__NewEnumerator1                                                  = 1,
	ESettingsLevels__NewEnumerator2                                                  = 2,
	ESettingsLevels__NewEnumerator3                                                  = 3
};

/// Enum /Game/FPS/Blueprints/Enums/EEquipedWeapon.EEquipedWeapon
/// Size: 0x01 (1 bytes)
enum class EEquipedWeapon : uint8_t
{
	EEquipedWeapon__NewEnumerator0                                                   = 0,
	EEquipedWeapon__NewEnumerator3                                                   = 1,
	EEquipedWeapon__NewEnumerator4                                                   = 2,
	EEquipedWeapon__NewEnumerator5                                                   = 3,
	EEquipedWeapon__NewEnumerator6                                                   = 4,
	EEquipedWeapon__NewEnumerator7                                                   = 5,
	EEquipedWeapon__NewEnumerator1                                                   = 6
};

/// Enum /Game/FPS/Blueprints/Enums/EFiringMode.EFiringMode
/// Size: 0x01 (1 bytes)
enum class EFiringMode : uint8_t
{
	EFiringMode__NewEnumerator0                                                      = 0,
	EFiringMode__NewEnumerator1                                                      = 1,
	EFiringMode__NewEnumerator2                                                      = 2
};

/// Enum /Game/FPS/Blueprints/Enums/EWeaponNames.EWeaponNames
/// Size: 0x01 (1 bytes)
enum class EWeaponNames : uint8_t
{
	EWeaponNames__NewEnumerator0                                                     = 0,
	EWeaponNames__NewEnumerator1                                                     = 1,
	EWeaponNames__NewEnumerator2                                                     = 2,
	EWeaponNames__NewEnumerator3                                                     = 3,
	EWeaponNames__NewEnumerator4                                                     = 4,
	EWeaponNames__NewEnumerator5                                                     = 5,
	EWeaponNames__NewEnumerator9                                                     = 6,
	EWeaponNames__NewEnumerator6                                                     = 7,
	EWeaponNames__NewEnumerator7                                                     = 8,
	EWeaponNames__NewEnumerator8                                                     = 9,
	EWeaponNames__NewEnumerator10                                                    = 10,
	EWeaponNames__NewEnumerator11                                                    = 11,
	EWeaponNames__NewEnumerator12                                                    = 12,
	EWeaponNames__NewEnumerator13                                                    = 13,
	EWeaponNames__NewEnumerator14                                                    = 14
};

/// Enum /Game/FPS/Blueprints/Enums/ELethalEquipment.ELethalEquipment
/// Size: 0x01 (1 bytes)
enum class ELethalEquipment : uint8_t
{
	ELethalEquipment__NewEnumerator6                                                 = 0,
	ELethalEquipment__NewEnumerator7                                                 = 1,
	ELethalEquipment__NewEnumerator8                                                 = 2,
	ELethalEquipment__NewEnumerator9                                                 = 3
};

/// Enum /Game/FPS/Blueprints/Enums/ERewardReasons.ERewardReasons
/// Size: 0x01 (1 bytes)
enum class ERewardReasons : uint8_t
{
	ERewardReasons__NewEnumerator5                                                   = 0,
	ERewardReasons__NewEnumerator2                                                   = 1,
	ERewardReasons__NewEnumerator0                                                   = 2,
	ERewardReasons__NewEnumerator9                                                   = 3,
	ERewardReasons__NewEnumerator10                                                  = 4,
	ERewardReasons__NewEnumerator11                                                  = 5,
	ERewardReasons__NewEnumerator6                                                   = 6,
	ERewardReasons__NewEnumerator12                                                  = 7,
	ERewardReasons__NewEnumerator7                                                   = 8,
	ERewardReasons__NewEnumerator8                                                   = 9,
	ERewardReasons__NewEnumerator14                                                  = 10,
	ERewardReasons__NewEnumerator15                                                  = 11,
	ERewardReasons__NewEnumerator16                                                  = 12,
	ERewardReasons__NewEnumerator17                                                  = 13,
	ERewardReasons__NewEnumerator18                                                  = 14,
	ERewardReasons__NewEnumerator19                                                  = 15
};

/// Enum /Game/FPS/Blueprints/Enums/EPerks.EPerks
/// Size: 0x01 (1 bytes)
enum class EPerks : uint8_t
{
	EPerks__NewEnumerator0                                                           = 0,
	EPerks__NewEnumerator1                                                           = 1,
	EPerks__NewEnumerator2                                                           = 2,
	EPerks__NewEnumerator3                                                           = 3,
	EPerks__NewEnumerator4                                                           = 4,
	EPerks__NewEnumerator5                                                           = 5
};

/// Enum /Game/FPS/Blueprints/Enums/ECapturePoints.ECapturePoints
/// Size: 0x01 (1 bytes)
enum class ECapturePoints : uint8_t
{
	ECapturePoints__NewEnumerator0                                                   = 0,
	ECapturePoints__NewEnumerator1                                                   = 1,
	ECapturePoints__NewEnumerator2                                                   = 2,
	ECapturePoints__NewEnumerator3                                                   = 3,
	ECapturePoints__NewEnumerator4                                                   = 4
};

/// Enum /Game/FPS/Blueprints/Enums/ECapturePointState.ECapturePointState
/// Size: 0x01 (1 bytes)
enum class ECapturePointState : uint8_t
{
	ECapturePointState__NewEnumerator2                                               = 0,
	ECapturePointState__NewEnumerator0                                               = 1,
	ECapturePointState__NewEnumerator1                                               = 2,
	ECapturePointState__NewEnumerator3                                               = 3,
	ECapturePointState__NewEnumerator4                                               = 4
};

/// Struct /Game/FPS/UI/MapInfo.MapInfo
/// Size: 0x0060 (96 bytes) (0x000000 - 0x000060) align 8 MaxSize: 0x0060
struct FMapInfo
{ 
	TEnumAsByte<EGameModeNames>                        GameMode_2_7FAF55444172ACA138D276AA6F4B731F;                // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FText                                              Description_22_972A350C42DDD9AC600FD7B6A00117C0;            // 0x0008   (0x0018)  
	class UTexture2D*                                  Image_11_862BAB6C49A1C3977008EDAC05DE1B62;                  // 0x0020   (0x0008)  
	FName                                              LevelName_26_EB564F52431AB5AFB685EC86F76FFCA8;              // 0x0028   (0x0008)  
	FText                                              GameModeName_19_704508384395E1249C91C39BEB64D710;           // 0x0030   (0x0018)  
	FText                                              Tip_24_54E3A81D4C3E473ED8B0DCB2250FF93C;                    // 0x0048   (0x0018)  
};

/// Struct /Game/FPS/Blueprints/CharacterAndClasses/AmmoMagazines.AmmoMagazines
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 MaxSize: 0x000C
struct FAmmoMagazines
{ 
	TEnumAsByte<EAmmoType>                             AmmoType_5_1CD642D04C3BF1F857D9EBBF2F2EF4F5;                // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            Quantity_4_50296D3443367E8FA683FAA68E169687;                // 0x0004   (0x0004)  
	int32_t                                            MaxQuantity_8_546EA24A4AE28730EF32C0869D82333D;             // 0x0008   (0x0004)  
};

/// Struct /Game/FPS/Blueprints/GameModes/Conquest/CapturePointInfo.CapturePointInfo
/// Size: 0x0009 (9 bytes) (0x000000 - 0x000009) align 4 MaxSize: 0x0009
struct FCapturePointInfo
{ 
	TEnumAsByte<ECapturePointState>                    State_2_81FA77CC4AE111F84F0149B1B1443871;                   // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            Progress_5_5BA01F4449811550DA999B9902BB9CB3;                // 0x0004   (0x0004)  
	bool                                               Team_8_E6593DA3446E94917AE03DA63906DEE5;                    // 0x0008   (0x0001)  
};

/// Struct /Game/FPS/Blueprints/SaveGame/SaveGameStructure.SaveGameStructure
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 4 MaxSize: 0x0030
struct FSaveGameStructure
{ 
	float                                              MasterVolume_12_7CCC9C434AC47DC516360A8336DA7E14;           // 0x0000   (0x0004)  
	float                                              MusicVolume_17_6E7461164AC3601F0524BD873654626E;            // 0x0004   (0x0004)  
	float                                              CharactersVolume_23_C06AB5A24F3F27A181323ABCD7887113;       // 0x0008   (0x0004)  
	float                                              AmbientVolume_24_F9EAD18848C8B5281356C49E7CCD50CC;          // 0x000C   (0x0004)  
	float                                              WeaponVolume_22_8152372444C4796C5C8C7D88A017809D;           // 0x0010   (0x0004)  
	float                                              UIVolume_37_FFC6C47D422110C2588C99A4A3A0993C;               // 0x0014   (0x0004)  
	float                                              MouseSensitivity_31_6BD1C14043F8D648E7340488079762A6;       // 0x0018   (0x0004)  
	float                                              ZoomSensitivity_34_9EF6AB80425D0CFFFC6369B59C9D1902;        // 0x001C   (0x0004)  
	bool                                               bShowFps_11_3B4BEAE848A1BADD54AEBBB38153BDD2;               // 0x0020   (0x0001)  
	bool                                               bVerticalAxisInverted_27_1BE5A19D4482DE49153A3FBF026005E4;  // 0x0021   (0x0001)  
	bool                                               bHorizontalAxisInverted_28_98EA246A473FF2295B5058A258123405; // 0x0022   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x0023   (0x0001)  MISSED
	float                                              FOVValue_42_FDBA745A401D28355A85C8993FDD2DEA;               // 0x0024   (0x0004)  
	float                                              MotionBlur_43_E8FC96DF42007F545FD7DF9151FE6F74;             // 0x0028   (0x0004)  
	bool                                               ToggleSprint_48_028F40E84DF1B83F2030FDA70660CD89;           // 0x002C   (0x0001)  
	bool                                               ToggleCrouch_50_872348DC4D7165DE474501BC80B7F2DA;           // 0x002D   (0x0001)  
	bool                                               ToggleADS_51_28305F0848010BC97ADDDA88F801A69C;              // 0x002E   (0x0001)  
	bool                                               MessagesPopup_53_25F3E85442DA4AE773A3EDB7E28668D0;          // 0x002F   (0x0001)  
};

/// Class /Game/FPS/Blueprints/GameModes/GameInstance/BP_GameInstance.BP_GameInstance_C
/// Size: 0x01C5 (453 bytes) (0x0001A8 - 0x0001C5) align 8 MaxSize: 0x01C5
class UBP_GameInstance_C : public UGameInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x01A8   (0x0008)  
	int32_t                                            MaxPlayer;                                                  // 0x01B0   (0x0004)  
	bool                                               bAllowBots;                                                 // 0x01B4   (0x0001)  
	bool                                               bAllowFriendlyFire;                                         // 0x01B5   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x01B6   (0x0002)  MISSED
	int32_t                                            TeamABots;                                                  // 0x01B8   (0x0004)  
	int32_t                                            TeamBBots;                                                  // 0x01BC   (0x0004)  
	int32_t                                            PointsToWin;                                                // 0x01C0   (0x0004)  
	TEnumAsByte<E_AI_Difficulty>                       AIDifficulty;                                               // 0x01C4   (0x0001)  


	/// Functions
	// Function /Game/FPS/Blueprints/GameModes/GameInstance/BP_GameInstance.BP_GameInstance_C.TravelErrorToString
	// void TravelErrorToString(TEnumAsByte<ETravelFailure> TravelError, FString& OutString);                                   // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FPS/Blueprints/GameModes/GameInstance/BP_GameInstance.BP_GameInstance_C.NetErrorToString
	// void NetErrorToString(TEnumAsByte<ENetworkFailure> FailureType, FString& NewParam);                                      // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FPS/Blueprints/GameModes/GameInstance/BP_GameInstance.BP_GameInstance_C.OnFailure_FEB1A1304CDE2ED6CC6C06A948930758
	void OnFailure_FEB1A1304CDE2ED6CC6C06A948930758() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/GameInstance/BP_GameInstance.BP_GameInstance_C.OnSuccess_FEB1A1304CDE2ED6CC6C06A948930758
	void OnSuccess_FEB1A1304CDE2ED6CC6C06A948930758() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/GameInstance/BP_GameInstance.BP_GameInstance_C.OnFailure_5662C0584E0AE12FB90219B012FE5C60
	void OnFailure_5662C0584E0AE12FB90219B012FE5C60() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/GameInstance/BP_GameInstance.BP_GameInstance_C.OnSuccess_5662C0584E0AE12FB90219B012FE5C60
	void OnSuccess_5662C0584E0AE12FB90219B012FE5C60() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/GameInstance/BP_GameInstance.BP_GameInstance_C.DestroySessionCaller
	void DestroySessionCaller(APlayerController* PlayerController) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(APlayerController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func(PlayerController);
	}
	// Function /Game/FPS/Blueprints/GameModes/GameInstance/BP_GameInstance.BP_GameInstance_C.JoinServer
	void JoinServer(FBlueprintSessionResult SessionToJoin) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FBlueprintSessionResult);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(SessionToJoin);
	}
	// Function /Game/FPS/Blueprints/GameModes/GameInstance/BP_GameInstance.BP_GameInstance_C.ExecuteUbergraph_BP_GameInstance
	void ExecuteUbergraph_BP_GameInstance(int32_t EntryPoint) // [0x12295a0] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/Maps/MainMenu.MainMenu_C
/// Size: 0x0238 (568 bytes) (0x000228 - 0x000238) align 8 MaxSize: 0x0238
class AMainMenu_C : public ALevelScriptActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0228   (0x0008)  
	class UWB_MainMenu_C*                              MainMenu;                                                   // 0x0230   (0x0008)  


	/// Functions
	// Function /Game/FPS/Maps/MainMenu.MainMenu_C.OnFailure_288B6391425B13DE61F261A17C2D6D78
	void OnFailure_288B6391425B13DE61F261A17C2D6D78() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/FPS/Maps/MainMenu.MainMenu_C.OnSuccess_288B6391425B13DE61F261A17C2D6D78
	void OnSuccess_288B6391425B13DE61F261A17C2D6D78() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/FPS/Maps/MainMenu.MainMenu_C.ReceiveBeginPlay
	void ReceiveBeginPlay() // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/FPS/Maps/MainMenu.MainMenu_C.ExecuteUbergraph_MainMenu
	void ExecuteUbergraph_MainMenu(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/AI/Blueprints/Services/BPS_UpdateEnemy.BPS_UpdateEnemy_C
/// Size: 0x0110 (272 bytes) (0x000098 - 0x000110) align 8 MaxSize: 0x0110
class UBPS_UpdateEnemy_C : public UBTService_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0098   (0x0008)  
	FBlackboardKeySelector                             EnemyKey;                                                   // 0x00A0   (0x0028)  
	FBlackboardKeySelector                             IsOnSightKey;                                               // 0x00C8   (0x0028)  
	bool                                               bEnemyFound;                                                // 0x00F0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00F1   (0x0007)  MISSED
	class APawn*                                       Pawn;                                                       // 0x00F8   (0x0008)  
	class ABP_BaseCharacter_C*                         Enemy;                                                      // 0x0100   (0x0008)  
	class AAIController*                               AI_Controller;                                              // 0x0108   (0x0008)  


	/// Functions
	// Function /Game/FPS/AI/Blueprints/Services/BPS_UpdateEnemy.BPS_UpdateEnemy_C.IsEnemyAtMeleeRange
	void IsEnemyAtMeleeRange() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/FPS/AI/Blueprints/Services/BPS_UpdateEnemy.BPS_UpdateEnemy_C.IsEnemyOnSight
	void IsEnemyOnSight(AAIController* AIController, bool& bIsOnSight) // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AAIController*, bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(AIController, bIsOnSight);
	}
	// Function /Game/FPS/AI/Blueprints/Services/BPS_UpdateEnemy.BPS_UpdateEnemy_C.ReceiveTickAI
	void ReceiveTickAI(AAIController* OwnerController, APawn* ControlledPawn, float DeltaSeconds) // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AAIController*, APawn*, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(OwnerController, ControlledPawn, DeltaSeconds);
	}
	// Function /Game/FPS/AI/Blueprints/Services/BPS_UpdateEnemy.BPS_UpdateEnemy_C.ExecuteUbergraph_BPS_UpdateEnemy
	void ExecuteUbergraph_BPS_UpdateEnemy(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/AI/Blueprints/Tasks/BPT_ReturnAlwaysTrue.BPT_ReturnAlwaysTrue_C
/// Size: 0x00B0 (176 bytes) (0x0000A8 - 0x0000B0) align 8 MaxSize: 0x00B0
class UBPT_ReturnAlwaysTrue_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  


	/// Functions
	// Function /Game/FPS/AI/Blueprints/Tasks/BPT_ReturnAlwaysTrue.BPT_ReturnAlwaysTrue_C.ReceiveExecuteAI
	void ReceiveExecuteAI(AAIController* OwnerController, APawn* ControlledPawn) // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AAIController*, APawn*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(OwnerController, ControlledPawn);
	}
	// Function /Game/FPS/AI/Blueprints/Tasks/BPT_ReturnAlwaysTrue.BPT_ReturnAlwaysTrue_C.ExecuteUbergraph_BPT_ReturnAlwaysTrue
	void ExecuteUbergraph_BPT_ReturnAlwaysTrue(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/AI/Blueprints/Services/BPS_NextLocationFlag.BPS_NextLocationFlag_C
/// Size: 0x00D9 (217 bytes) (0x000098 - 0x0000D9) align 8 MaxSize: 0x00D9
class UBPS_NextLocationFlag_C : public UBTService_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0098   (0x0008)  
	FBlackboardKeySelector                             Vectorkey;                                                  // 0x00A0   (0x0028)  
	class ABP_CaptureTheFlag_GS_C*                     GS;                                                         // 0x00C8   (0x0008)  
	class APawn*                                       Controlled_Pawn;                                            // 0x00D0   (0x0008)  
	bool                                               Team;                                                       // 0x00D8   (0x0001)  


	/// Functions
	// Function /Game/FPS/AI/Blueprints/Services/BPS_NextLocationFlag.BPS_NextLocationFlag_C.TeamHasTheFlag
	void TeamHasTheFlag(bool& bTeamHasTheFlag) // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(bTeamHasTheFlag);
	}
	// Function /Game/FPS/AI/Blueprints/Services/BPS_NextLocationFlag.BPS_NextLocationFlag_C.GetFlag
	void GetFlag(bool bTeam, ABP_BaseFlag_C*& Flag) // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool, ABP_BaseFlag_C*&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(bTeam, Flag);
	}
	// Function /Game/FPS/AI/Blueprints/Services/BPS_NextLocationFlag.BPS_NextLocationFlag_C.EnemyHasTheFlag
	void EnemyHasTheFlag(bool& EnemyHasTheFlag) // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(EnemyHasTheFlag);
	}
	// Function /Game/FPS/AI/Blueprints/Services/BPS_NextLocationFlag.BPS_NextLocationFlag_C.SelectObjective
	void SelectObjective(bool Team, APawn* ControlledPawn) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool, APawn*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(Team, ControlledPawn);
	}
	// Function /Game/FPS/AI/Blueprints/Services/BPS_NextLocationFlag.BPS_NextLocationFlag_C.ReceiveTickAI
	void ReceiveTickAI(AAIController* OwnerController, APawn* ControlledPawn, float DeltaSeconds) // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AAIController*, APawn*, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(OwnerController, ControlledPawn, DeltaSeconds);
	}
	// Function /Game/FPS/AI/Blueprints/Services/BPS_NextLocationFlag.BPS_NextLocationFlag_C.ExecuteUbergraph_BPS_NextLocationFlag
	void ExecuteUbergraph_BPS_NextLocationFlag(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/AI/Blueprints/Tasks/BPT_ResetFocus.BPT_ResetFocus_C
/// Size: 0x00B0 (176 bytes) (0x0000A8 - 0x0000B0) align 8 MaxSize: 0x00B0
class UBPT_ResetFocus_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  


	/// Functions
	// Function /Game/FPS/AI/Blueprints/Tasks/BPT_ResetFocus.BPT_ResetFocus_C.ReceiveExecuteAI
	void ReceiveExecuteAI(AAIController* OwnerController, APawn* ControlledPawn) // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AAIController*, APawn*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(OwnerController, ControlledPawn);
	}
	// Function /Game/FPS/AI/Blueprints/Tasks/BPT_ResetFocus.BPT_ResetFocus_C.ExecuteUbergraph_BPT_ResetFocus
	void ExecuteUbergraph_BPT_ResetFocus(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/AI/Blueprints/Tasks/BPT_Fire.BPT_Fire_C
/// Size: 0x00D8 (216 bytes) (0x0000A8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UBPT_Fire_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	FBlackboardKeySelector                             Enemy;                                                      // 0x00B0   (0x0028)  


	/// Functions
	// Function /Game/FPS/AI/Blueprints/Tasks/BPT_Fire.BPT_Fire_C.ReceiveExecuteAI
	void ReceiveExecuteAI(AAIController* OwnerController, APawn* ControlledPawn) // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AAIController*, APawn*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(OwnerController, ControlledPawn);
	}
	// Function /Game/FPS/AI/Blueprints/Tasks/BPT_Fire.BPT_Fire_C.ExecuteUbergraph_BPT_Fire
	void ExecuteUbergraph_BPT_Fire(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/AI/Blueprints/Tasks/BPT_MoveToReachableRandomPoint.BPT_MoveToReachableRandomPoint_C
/// Size: 0x0100 (256 bytes) (0x0000A8 - 0x000100) align 8 MaxSize: 0x0100
class UBPT_MoveToReachableRandomPoint_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	FBlackboardKeySelector                             Location;                                                   // 0x00B0   (0x0028)  
	FBlackboardKeySelector                             Objective;                                                  // 0x00D8   (0x0028)  


	/// Functions
	// Function /Game/FPS/AI/Blueprints/Tasks/BPT_MoveToReachableRandomPoint.BPT_MoveToReachableRandomPoint_C.ReceiveExecuteAI
	void ReceiveExecuteAI(AAIController* OwnerController, APawn* ControlledPawn) // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AAIController*, APawn*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(OwnerController, ControlledPawn);
	}
	// Function /Game/FPS/AI/Blueprints/Tasks/BPT_MoveToReachableRandomPoint.BPT_MoveToReachableRandomPoint_C.ReceiveAbortAI
	void ReceiveAbortAI(AAIController* OwnerController, APawn* ControlledPawn) // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AAIController*, APawn*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(OwnerController, ControlledPawn);
	}
	// Function /Game/FPS/AI/Blueprints/Tasks/BPT_MoveToReachableRandomPoint.BPT_MoveToReachableRandomPoint_C.ExecuteUbergraph_BPT_MoveToReachableRandomPoint
	void ExecuteUbergraph_BPT_MoveToReachableRandomPoint(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/AI/Blueprints/Tasks/BPT_SetFocus.BPT_SetFocus_C
/// Size: 0x00D8 (216 bytes) (0x0000A8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UBPT_SetFocus_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	FBlackboardKeySelector                             Vectorkey;                                                  // 0x00B0   (0x0028)  


	/// Functions
	// Function /Game/FPS/AI/Blueprints/Tasks/BPT_SetFocus.BPT_SetFocus_C.ReceiveExecuteAI
	void ReceiveExecuteAI(AAIController* OwnerController, APawn* ControlledPawn) // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AAIController*, APawn*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(OwnerController, ControlledPawn);
	}
	// Function /Game/FPS/AI/Blueprints/Tasks/BPT_SetFocus.BPT_SetFocus_C.ExecuteUbergraph_BPT_SetFocus
	void ExecuteUbergraph_BPT_SetFocus(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/AI/Blueprints/Tasks/BPT_UseMelee.BPT_UseMelee_C
/// Size: 0x00B0 (176 bytes) (0x0000A8 - 0x0000B0) align 8 MaxSize: 0x00B0
class UBPT_UseMelee_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  


	/// Functions
	// Function /Game/FPS/AI/Blueprints/Tasks/BPT_UseMelee.BPT_UseMelee_C.SetRunning
	void SetRunning(APawn* Pawn, bool bRun) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(APawn*, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Pawn, bRun);
	}
	// Function /Game/FPS/AI/Blueprints/Tasks/BPT_UseMelee.BPT_UseMelee_C.ReceiveExecuteAI
	void ReceiveExecuteAI(AAIController* OwnerController, APawn* ControlledPawn) // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AAIController*, APawn*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(OwnerController, ControlledPawn);
	}
	// Function /Game/FPS/AI/Blueprints/Tasks/BPT_UseMelee.BPT_UseMelee_C.ExecuteUbergraph_BPT_UseMelee
	void ExecuteUbergraph_BPT_UseMelee(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/AI/Blueprints/Services/BPS_FindObjetiveFlag.BPS_FindObjetiveFlag_C
/// Size: 0x00E0 (224 bytes) (0x000098 - 0x0000E0) align 8 MaxSize: 0x00E0
class UBPS_FindObjetiveFlag_C : public UBTService_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0098   (0x0008)  
	FBlackboardKeySelector                             Objectivekey;                                               // 0x00A0   (0x0028)  
	TArray<class ABP_ConquestCapturePoint_C*>          PosibleFlagsToCapture;                                      // 0x00C8   (0x0010)  
	class ABP_ConquestCapturePoint_C*                  PossibleFlag;                                               // 0x00D8   (0x0008)  


	/// Functions
	// Function /Game/FPS/AI/Blueprints/Services/BPS_FindObjetiveFlag.BPS_FindObjetiveFlag_C.FindClosestFlag
	// void FindClosestFlag(TArray<ABP_ConquestCapturePoint_C*>& CapturePoints, APawn* SelfPawn, ABP_ConquestCapturePoint_C*& Flag); // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/AI/Blueprints/Services/BPS_FindObjetiveFlag.BPS_FindObjetiveFlag_C.ReceiveActivationAI
	void ReceiveActivationAI(AAIController* OwnerController, APawn* ControlledPawn) // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AAIController*, APawn*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(OwnerController, ControlledPawn);
	}
	// Function /Game/FPS/AI/Blueprints/Services/BPS_FindObjetiveFlag.BPS_FindObjetiveFlag_C.ExecuteUbergraph_BPS_FindObjetiveFlag
	void ExecuteUbergraph_BPS_FindObjetiveFlag(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/UI/KillFeedAndScore/WB_PlayerScores.WB_PlayerScores_C
/// Size: 0x02D0 (720 bytes) (0x000260 - 0x0002D0) align 8 MaxSize: 0x02D0
class UWB_PlayerScores_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UTextBlock*                                  GameModeText;                                               // 0x0268   (0x0008)  
	class UTextBlock*                                  TeamAScore;                                                 // 0x0270   (0x0008)  
	class UVerticalBox*                                TeamASlot;                                                  // 0x0278   (0x0008)  
	class UTextBlock*                                  TeamBScore;                                                 // 0x0280   (0x0008)  
	class UVerticalBox*                                TeamBSlot;                                                  // 0x0288   (0x0008)  
	class UImage*                                      TeamImageA;                                                 // 0x0290   (0x0008)  
	class UImage*                                      TeamImageB;                                                 // 0x0298   (0x0008)  
	class UScrollBox*                                  VB_TeamAPlayers;                                            // 0x02A0   (0x0008)  
	class UScrollBox*                                  VB_TeamBPlayers;                                            // 0x02A8   (0x0008)  
	bool                                               bRepeat;                                                    // 0x02B0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x02B1   (0x0003)  MISSED
	float                                              RefreshTime;                                                // 0x02B4   (0x0004)  
	class ABP_Base_GS_C*                               GS;                                                         // 0x02B8   (0x0008)  
	class ABP_PlayerState_C*                           PS;                                                         // 0x02C0   (0x0008)  
	class ABP_BasePlayerController_C*                  PC;                                                         // 0x02C8   (0x0008)  


	/// Functions
	// Function /Game/FPS/UI/KillFeedAndScore/WB_PlayerScores.WB_PlayerScores_C.UpdateTeamScores
	void UpdateTeamScores() // [0x12295a0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/FPS/UI/KillFeedAndScore/WB_PlayerScores.WB_PlayerScores_C.CleanList
	// void CleanList(TArray<ABP_PlayerState_C*>& List, int32_t Team);                                                          // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/UI/KillFeedAndScore/WB_PlayerScores.WB_PlayerScores_C.AssingPlayerSlots
	// void AssingPlayerSlots(UScrollBox* ScrollBox, TArray<ABP_PlayerState_C*>& Players);                                      // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/UI/KillFeedAndScore/WB_PlayerScores.WB_PlayerScores_C.UpdateSemiSortedLists
	void UpdateSemiSortedLists() // [0x12295a0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Game/FPS/UI/KillFeedAndScore/WB_PlayerScores.WB_PlayerScores_C.InitLists
	void InitLists() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/FPS/UI/KillFeedAndScore/WB_PlayerScores.WB_PlayerScores_C.FindPos
	// void FindPos(TArray<ABP_PlayerState_C*>& SortedArray, ABP_PlayerState_C* PlayerState, int32_t& Position);                // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/UI/KillFeedAndScore/WB_PlayerScores.WB_PlayerScores_C.InsertionSort
	// void InsertionSort(TArray<ABP_PlayerState_C*>& PlayersState, TArray<ABP_PlayerState_C*>& SortedPlayersState);            // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/UI/KillFeedAndScore/WB_PlayerScores.WB_PlayerScores_C.SortPlayerArray
	// void SortPlayerArray(TArray<ABP_PlayerState_C*>& Input, TArray<ABP_PlayerState_C*>& Output);                             // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/UI/KillFeedAndScore/WB_PlayerScores.WB_PlayerScores_C.UpdateScore
	void UpdateScore() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func();
	}
	// Function /Game/FPS/UI/KillFeedAndScore/WB_PlayerScores.WB_PlayerScores_C.Construct
	void Construct() // [0x12295a0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func();
	}
	// Function /Game/FPS/UI/KillFeedAndScore/WB_PlayerScores.WB_PlayerScores_C.UpdateLists
	void UpdateLists() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func();
	}
	// Function /Game/FPS/UI/KillFeedAndScore/WB_PlayerScores.WB_PlayerScores_C.ExecuteUbergraph_WB_PlayerScores
	void ExecuteUbergraph_WB_PlayerScores(int32_t EntryPoint) // [0x12295a0] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/Blueprints/AmmoBox/BP_SmallExplosiveAmmoBox.BP_SmallExplosiveAmmoBox_C
/// Size: 0x0258 (600 bytes) (0x000220 - 0x000258) align 8 MaxSize: 0x0258
class ABP_SmallExplosiveAmmoBox_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USceneComponent*                             Scene;                                                      // 0x0228   (0x0008)  
	class UStaticMeshComponent*                        StaticMesh;                                                 // 0x0230   (0x0008)  
	class UChildActorComponent*                        WidgetActor;                                                // 0x0238   (0x0008)  
	class USphereComponent*                            InfluenceSphere;                                            // 0x0240   (0x0008)  
	bool                                               bActive;                                                    // 0x0248   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0249   (0x0007)  MISSED
	FTimerHandle                                       CheckVelocityTimerHandle;                                   // 0x0250   (0x0008)  


	/// Functions
	// Function /Game/FPS/Blueprints/AmmoBox/BP_SmallExplosiveAmmoBox.BP_SmallExplosiveAmmoBox_C.AddInitialImpulse
	void AddInitialImpulse() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/FPS/Blueprints/AmmoBox/BP_SmallExplosiveAmmoBox.BP_SmallExplosiveAmmoBox_C.FindOverlappingActorOnActivation
	void FindOverlappingActorOnActivation() // [0x12295a0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/FPS/Blueprints/AmmoBox/BP_SmallExplosiveAmmoBox.BP_SmallExplosiveAmmoBox_C.Use
	void Use(AActor* Actor) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(Actor);
	}
	// Function /Game/FPS/Blueprints/AmmoBox/BP_SmallExplosiveAmmoBox.BP_SmallExplosiveAmmoBox_C.BndEvt__InfluenceSphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__InfluenceSphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult) // [0x12295a0] HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UPrimitiveComponent*, AActor*, UPrimitiveComponent*, int32_t, bool, FHitResult&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(OverlappedComponent, OtherActor, OtherComp, OtherBodyIndex, bFromSweep, SweepResult);
	}
	// Function /Game/FPS/Blueprints/AmmoBox/BP_SmallExplosiveAmmoBox.BP_SmallExplosiveAmmoBox_C.ReceiveBeginPlay
	void ReceiveBeginPlay() // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/FPS/Blueprints/AmmoBox/BP_SmallExplosiveAmmoBox.BP_SmallExplosiveAmmoBox_C.Init_Medkit
	void Init_Medkit() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Game/FPS/Blueprints/AmmoBox/BP_SmallExplosiveAmmoBox.BP_SmallExplosiveAmmoBox_C.StopSimulatingPhysics
	void StopSimulatingPhysics() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Game/FPS/Blueprints/AmmoBox/BP_SmallExplosiveAmmoBox.BP_SmallExplosiveAmmoBox_C.ExecuteUbergraph_BP_SmallExplosiveAmmoBox
	void ExecuteUbergraph_BP_SmallExplosiveAmmoBox(int32_t EntryPoint) // [0x12295a0] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C
/// Size: 0x0280 (640 bytes) (0x000260 - 0x000280) align 8 MaxSize: 0x0280
class UWB_ExplosiveAmmoBox_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UWidgetAnimation*                            OnStart_Icon_Anim;                                          // 0x0268   (0x0008)  
	class UImage*                                      Icon;                                                       // 0x0270   (0x0008)  
	FTimerHandle                                       HideWidgetTimer;                                            // 0x0278   (0x0008)  


	/// Functions
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.OnOwnerDeath
	void OnOwnerDeath() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.ShowHitMarker
	void ShowHitMarker(bool bVehicle) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(bVehicle);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.ShowKillMarker
	void ShowKillMarker() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.UpdateFiringMode
	// void UpdateFiringMode(TEnumAsByte<EFiringMode> NewFiringMode);                                                           // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.UpdateHP
	void UpdateHP(float NewHP, float MaxHP) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(NewHP, MaxHP);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.UpdateCurrentBullets
	void UpdateCurrentBullets(int32_t CurrentBullets, int32_t BulletsPerMag) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(int32_t, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(CurrentBullets, BulletsPerMag);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.UpdateTotalBullets
	void UpdateTotalBullets(int32_t TotalBullets) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func(TotalBullets);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.ShowHitOverlay
	void ShowHitOverlay() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.UpdateMatchTimer
	void UpdateMatchTimer(float TimeInSeconds) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func(TimeInSeconds);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.UpdateGameModeScores
	void UpdateGameModeScores(int32_t TeamAPoints, int32_t TeamBPoints, int32_t PointsToWin) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(int32_t, int32_t, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func(TeamAPoints, TeamBPoints, PointsToWin);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.UpdateKillFeed
	void UpdateKillFeed(APlayerState* Killer, APlayerState* Victim, UDamageType* DamageType, APlayerState* Assist, bool bHeadshot) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(APlayerState*, APlayerState*, UDamageType*, APlayerState*, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func(Killer, Victim, DamageType, Assist, bHeadshot);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.ShowScore
	void ShowScore(float Score, FText Reason) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float, FText);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func(Score, Reason);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.HideWeaponInfo
	void HideWeaponInfo() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.UpdateObjectiveMarkers
	void UpdateObjectiveMarkers(ABP_Base_Objective_C* ObjectiveToUpdate, bool PlayIconAnim, int32_t Team) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABP_Base_Objective_C*, bool, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func(ObjectiveToUpdate, PlayIconAnim, Team);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.ShowInteractProgressBar
	void ShowInteractProgressBar(float InteractTime) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func(InteractTime);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.HideInteractProgressBar
	void HideInteractProgressBar() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.ShowHealOverlay
	void ShowHealOverlay() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.ShowInteractInfo
	void ShowInteractInfo(FText Description) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FText);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		func(Description);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.HideInteractInfo
	void HideInteractInfo() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.ShowAbilityCooldownTime
	void ShowAbilityCooldownTime(float TimeRemaining) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		func(TimeRemaining);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.UpdateExplosives
	void UpdateExplosives(int32_t ExplosivesAmount, UTexture* Icon) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(int32_t, UTexture*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		func(ExplosivesAmount, Icon);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.UpdateRushScores
	void UpdateRushScores(int32_t Reinforcements, int32_t TotalReinforcements) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(int32_t, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[21]);
		func(Reinforcements, TotalReinforcements);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.UpdateDeathmatchScores
	void UpdateDeathmatchScores(FString WinnerName, int32_t WinnerKills, int32_t KillsToWin) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FString, int32_t, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		func(WinnerName, WinnerKills, KillsToWin);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.UpdateTeamIcon
	void UpdateTeamIcon(UTexture* TeamIcon) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UTexture*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		func(TeamIcon);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.ShowCrouchIcon
	void ShowCrouchIcon() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[24]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.ShowStandingIcon
	void ShowStandingIcon() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[25]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.UpdateSkillIcon
	void UpdateSkillIcon(UTexture2D* SkillIcon) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UTexture2D*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[26]);
		func(SkillIcon);
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.SetWidgetVisibility
	void SetWidgetVisibility() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[27]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.ShowWidget
	void ShowWidget() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[28]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.HideWidget
	void HideWidget() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[29]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/Widget_Icons/WB_ExplosiveAmmoBox.WB_ExplosiveAmmoBox_C.ExecuteUbergraph_WB_ExplosiveAmmoBox
	void ExecuteUbergraph_WB_ExplosiveAmmoBox(int32_t EntryPoint) // [0x12295a0] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[30]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C
/// Size: 0x6638 (26168 bytes) (0x0002B8 - 0x006638) align 16 MaxSize: 0x6638
class UABP_Base_TPP_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x02B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x02F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult0;                            // 0x0320   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult1;                            // 0x0348   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult2;                            // 0x0370   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0398   (0x0080)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0418   (0x0028)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive;                                // 0x0440   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0508   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult3;                            // 0x0538   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer4;                              // 0x0560   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult5;                                 // 0x05E0   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer6;                              // 0x0610   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult7;                                 // 0x0690   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x06C0   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult8;                                 // 0x0770   (0x0030)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose9;                               // 0x07A0   (0x0028)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult10;                                // 0x07C8   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine11;                               // 0x07F8   (0x00B0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x08A8   (0x0158)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0A00   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0A20   (0x0020)  
	FAnimNode_TwoBoneIK                                AnimGraphNode_TwoBoneIK;                                    // 0x0A40   (0x01E0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose12;                             // 0x0C20   (0x0158)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult13;                           // 0x0D78   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult14;                           // 0x0DA0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult15;                           // 0x0DC8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult16;                           // 0x0DF0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult17;                           // 0x0E18   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult18;                           // 0x0E40   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult19;                           // 0x0E68   (0x0028)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x0E90   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult20;                                // 0x0F78   (0x0030)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer21;                           // 0x0FA8   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult22;                                // 0x1090   (0x0030)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer23;                           // 0x10C0   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult24;                                // 0x11A8   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer25;                             // 0x11D8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult26;                                // 0x1258   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine27;                               // 0x1288   (0x00B0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose28;                             // 0x1338   (0x0158)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult29;                           // 0x1490   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult30;                           // 0x14B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult31;                           // 0x14E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult32;                           // 0x1508   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer33;                             // 0x1530   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer34;                             // 0x15B0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer35;                             // 0x1630   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x16B0   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer36;                             // 0x1760   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult37;                                // 0x17E0   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer38;                             // 0x1810   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer39;                             // 0x1890   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer40;                             // 0x1910   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer41;                             // 0x1990   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum42;                            // 0x1A10   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult43;                                // 0x1AC0   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer44;                             // 0x1AF0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer45;                             // 0x1B70   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer46;                             // 0x1BF0   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum47;                            // 0x1C70   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer48;                             // 0x1D20   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult49;                                // 0x1DA0   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer50;                             // 0x1DD0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer51;                             // 0x1E50   (0x0080)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose52;                              // 0x1ED0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose53;                              // 0x1EF8   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose54;                              // 0x1F20   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose55;                              // 0x1F48   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose56;                              // 0x1F70   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose57;                              // 0x1F98   (0x0028)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum58;                            // 0x1FC0   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult59;                                // 0x2070   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine60;                               // 0x20A0   (0x00B0)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace;                     // 0x2150   (0x0190)  
	FAnimNode_ApplyMeshSpaceAdditive                   AnimGraphNode_ApplyMeshSpaceAdditive;                       // 0x22E0   (0x00D0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose61;                              // 0x23B0   (0x0028)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose;                                 // 0x23D8   (0x0018)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x23F0   (0x00C0)  
	FAnimNode_MakeDynamicAdditive                      AnimGraphNode_MakeDynamicAdditive;                          // 0x24B0   (0x0038)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose62;                             // 0x24E8   (0x0158)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose63;                              // 0x2640   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose64;                              // 0x2668   (0x0028)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer65;                           // 0x2690   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer66;                           // 0x2778   (0x00E8)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose67;                              // 0x2860   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult68;                           // 0x2888   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult69;                           // 0x28B0   (0x0028)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x28D8   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator70;                          // 0x2928   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator71;                          // 0x2978   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator72;                          // 0x29C8   (0x0050)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x2A18   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool73;                            // 0x2AB8   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool74;                            // 0x2B58   (0x00A0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult75;                                // 0x2BF8   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator76;                          // 0x2C28   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator77;                          // 0x2C78   (0x0050)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool78;                            // 0x2CC8   (0x00A0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult79;                                // 0x2D68   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine80;                               // 0x2D98   (0x00B0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose81;                             // 0x2E48   (0x0158)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult82;                           // 0x2FA0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult83;                           // 0x2FC8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult84;                           // 0x2FF0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult85;                           // 0x3018   (0x0028)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator86;                          // 0x3040   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator87;                          // 0x3090   (0x0050)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool88;                            // 0x30E0   (0x00A0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult89;                                // 0x3180   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer90;                             // 0x31B0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer91;                             // 0x3230   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer92;                             // 0x32B0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer93;                             // 0x3330   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool94;                            // 0x33B0   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool95;                            // 0x3450   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool96;                            // 0x34F0   (0x00A0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult97;                                // 0x3590   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer98;                             // 0x35C0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer99;                             // 0x3640   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool100;                           // 0x36C0   (0x00A0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult101;                               // 0x3760   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine102;                              // 0x3790   (0x00B0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose103;                            // 0x3840   (0x0158)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult104;                          // 0x3998   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult105;                          // 0x39C0   (0x0028)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator106;                         // 0x39E8   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator107;                         // 0x3A38   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator108;                         // 0x3A88   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator109;                         // 0x3AD8   (0x0050)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool110;                           // 0x3B28   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool111;                           // 0x3BC8   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool112;                           // 0x3C68   (0x00A0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult113;                               // 0x3D08   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator114;                         // 0x3D38   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator115;                         // 0x3D88   (0x0050)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool116;                           // 0x3DD8   (0x00A0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult117;                               // 0x3E78   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine118;                              // 0x3EA8   (0x00B0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose119;                            // 0x3F58   (0x0158)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend120;                          // 0x40B0   (0x00C0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose121;                             // 0x4170   (0x0028)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend122;                          // 0x4198   (0x00C0)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose123;                              // 0x4258   (0x0018)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x4270   (0x00F8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult124;                          // 0x4368   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult125;                          // 0x4390   (0x0028)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator126;                         // 0x43B8   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator127;                         // 0x4408   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator128;                         // 0x4458   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator129;                         // 0x44A8   (0x0050)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool130;                           // 0x44F8   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool131;                           // 0x4598   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool132;                           // 0x4638   (0x00A0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult133;                               // 0x46D8   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator134;                         // 0x4708   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator135;                         // 0x4758   (0x0050)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool136;                           // 0x47A8   (0x00A0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult137;                               // 0x4848   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine138;                              // 0x4878   (0x00B0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose139;                            // 0x4928   (0x0158)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult140;                          // 0x4A80   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult141;                          // 0x4AA8   (0x0028)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator142;                         // 0x4AD0   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator143;                         // 0x4B20   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator144;                         // 0x4B70   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator145;                         // 0x4BC0   (0x0050)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool146;                           // 0x4C10   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool147;                           // 0x4CB0   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool148;                           // 0x4D50   (0x00A0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult149;                               // 0x4DF0   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator150;                         // 0x4E20   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator151;                         // 0x4E70   (0x0050)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool152;                           // 0x4EC0   (0x00A0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult153;                               // 0x4F60   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine154;                              // 0x4F90   (0x00B0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose155;                            // 0x5040   (0x0158)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult156;                          // 0x5198   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult157;                          // 0x51C0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult158;                          // 0x51E8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult159;                          // 0x5210   (0x0028)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator160;                         // 0x5238   (0x0050)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult161;                               // 0x5288   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer162;                            // 0x52B8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer163;                            // 0x5338   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer164;                            // 0x53B8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer165;                            // 0x5438   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool166;                           // 0x54B8   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool167;                           // 0x5558   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool168;                           // 0x55F8   (0x00A0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult169;                               // 0x5698   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer170;                            // 0x56C8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer171;                            // 0x5748   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool172;                           // 0x57C8   (0x00A0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult173;                               // 0x5868   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine174;                              // 0x5898   (0x00B0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose175;                            // 0x5948   (0x0158)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace176;                  // 0x5AA0   (0x0190)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend177;                          // 0x5C30   (0x00C0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose178;                             // 0x5CF0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer179;                            // 0x5D18   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool180;                           // 0x5D98   (0x00A0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer181;                          // 0x5E38   (0x00E8)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace182;                  // 0x5F20   (0x0190)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum183;                           // 0x60B0   (0x00B0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer184;                          // 0x6160   (0x00E8)  
	FAnimNode_Inertialization                          AnimGraphNode_Inertialization;                              // 0x6248   (0x0070)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer185;                          // 0x62B8   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer186;                          // 0x63A0   (0x00E8)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x6488   (0x0048)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer187;                          // 0x64D0   (0x00E8)  
	float                                              Speed;                                                      // 0x65B8   (0x0004)  
	float                                              Direction;                                                  // 0x65BC   (0x0004)  
	bool                                               bIsAiming;                                                  // 0x65C0   (0x0001)  
	bool                                               bCrouching;                                                 // 0x65C1   (0x0001)  
	bool                                               bReloading;                                                 // 0x65C2   (0x0001)  
	bool                                               bFalling;                                                   // 0x65C3   (0x0001)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x65C4   (0x0004)  MISSED
	class ABP_BaseCharacter_C*                         Pawn;                                                       // 0x65C8   (0x0008)  
	bool                                               bRunning;                                                   // 0x65D0   (0x0001)  
	TEnumAsByte<EEquipedWeapon>                        EquipedWeapon;                                              // 0x65D1   (0x0001)  
	unsigned char                                      UnknownData02_6[0x2];                                       // 0x65D2   (0x0002)  MISSED
	float                                              LeaningInput;                                               // 0x65D4   (0x0004)  
	class ABP_BaseWeapon_C*                            PawnWeapon;                                                 // 0x65D8   (0x0008)  
	bool                                               IsAccelerating;                                             // 0x65E0   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x65E1   (0x0003)  MISSED
	float                                              Acceleration;                                               // 0x65E4   (0x0004)  
	float                                              StopDirection;                                              // 0x65E8   (0x0004)  
	float                                              Roll;                                                       // 0x65EC   (0x0004)  
	float                                              Pitch;                                                      // 0x65F0   (0x0004)  
	float                                              Yaw;                                                        // 0x65F4   (0x0004)  
	float                                              PelvisCurrentOffset;                                        // 0x65F8   (0x0004)  
	float                                              Right;                                                      // 0x65FC   (0x0004)  
	bool                                               bUseFullBody;                                               // 0x6600   (0x0001)  
	bool                                               bUsingLethal;                                               // 0x6601   (0x0001)  
	unsigned char                                      UnknownData04_6[0x2];                                       // 0x6602   (0x0002)  MISSED
	float                                              Delta;                                                      // 0x6604   (0x0004)  
	float                                              IKoffsetLeftFoot;                                           // 0x6608   (0x0004)  
	float                                              IKoffsetRightFoot;                                          // 0x660C   (0x0004)  
	FRotator                                           foot_l_rotation;                                            // 0x6610   (0x000C)  
	FRotator                                           foot_r_rotation;                                            // 0x661C   (0x000C)  
	float                                              IKTraceDistance;                                            // 0x6628   (0x0004)  
	float                                              PelvilsOffsetRange;                                         // 0x662C   (0x0004)  
	TEnumAsByte<ELethalEquipment>                      Lethal_Type;                                                // 0x6630   (0x0001)  
	unsigned char                                      UnknownData05_6[0x3];                                       // 0x6631   (0x0003)  MISSED
	float                                              SpineOverrideAlpha;                                         // 0x6634   (0x0004)  


	/// Functions
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph) // [0x12295a0] HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FPoseLink&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(AnimGraph);
	}
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.MakeNosieEvent
	void MakeNosieEvent() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.PlayFootstepSound
	void PlayFootstepSound() // [0x12295a0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.SetPawnInfo
	void SetPawnInfo() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.BlueprintUpdateAnimation
	void BlueprintUpdateAnimation(float DeltaTimeX) // [0x12295a0] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(DeltaTimeX);
	}
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.AnimNotify_ReloadCompleted
	void AnimNotify_ReloadCompleted() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.AnimNotify_MeleeAttackCompleted
	void AnimNotify_MeleeAttackCompleted() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.AnimNotify_Footstep
	void AnimNotify_Footstep() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.BlueprintInitializeAnimation
	void BlueprintInitializeAnimation() // [0x12295a0] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func();
	}
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.AnimNotify_SpawnLethal
	void AnimNotify_SpawnLethal() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func();
	}
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.AnimNotify_ShowLethal
	void AnimNotify_ShowLethal() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func();
	}
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.AnimNotify_EquipWeapon
	void AnimNotify_EquipWeapon() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func();
	}
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.AnimNotify_HideLethal
	void AnimNotify_HideLethal() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func();
	}
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.AnimNotify_HideWeapon
	void AnimNotify_HideWeapon() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func();
	}
	// Function /Game/FPS/Animations/TPP_Animations/ABP_Base_TPP.ABP_Base_TPP_C.ExecuteUbergraph_ABP_Base_TPP
	void ExecuteUbergraph_ABP_Base_TPP(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C
/// Size: 0x72E0 (29408 bytes) (0x0002B8 - 0x0072E0) align 16 MaxSize: 0x72E0
class UABP_FPP_Base_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x02B8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x02F8   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0340   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult0;                            // 0x0368   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult1;                            // 0x0390   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult2;                            // 0x03B8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x03E0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer3;                              // 0x0460   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer4;                              // 0x04E0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer5;                              // 0x0560   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x05E0   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer6;                              // 0x0690   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0710   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer7;                              // 0x0740   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer8;                              // 0x07C0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer9;                              // 0x0840   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer10;                             // 0x08C0   (0x0080)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x0940   (0x00E8)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum11;                            // 0x0A28   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult12;                                // 0x0AD8   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer13;                             // 0x0B08   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer14;                             // 0x0B88   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer15;                             // 0x0C08   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer16;                             // 0x0C88   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer17;                             // 0x0D08   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum18;                            // 0x0D88   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult19;                                // 0x0E38   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult20;                           // 0x0E68   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult21;                           // 0x0E90   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer22;                             // 0x0EB8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult23;                                // 0x0F38   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult24;                           // 0x0F68   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult25;                           // 0x0F90   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult26;                           // 0x0FB8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult27;                           // 0x0FE0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult28;                           // 0x1008   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult29;                           // 0x1030   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult30;                           // 0x1058   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer31;                             // 0x1080   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult32;                                // 0x1100   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer33;                             // 0x1130   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult34;                                // 0x11B0   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer35;                             // 0x11E0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult36;                                // 0x1260   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer37;                             // 0x1290   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult38;                                // 0x1310   (0x0030)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace;                     // 0x1340   (0x0190)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer39;                           // 0x14D0   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult40;                                // 0x15B8   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x15E8   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult41;                                // 0x1698   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine42;                               // 0x16C8   (0x00B0)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult43;                           // 0x1778   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult44;                           // 0x17A0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer45;                             // 0x17C8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult46;                                // 0x1848   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult47;                           // 0x1878   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult48;                           // 0x18A0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult49;                           // 0x18C8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult50;                           // 0x18F0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult51;                           // 0x1918   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult52;                           // 0x1940   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult53;                           // 0x1968   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer54;                             // 0x1990   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult55;                                // 0x1A10   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer56;                             // 0x1A40   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult57;                                // 0x1AC0   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer58;                             // 0x1AF0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult59;                                // 0x1B70   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer60;                             // 0x1BA0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult61;                                // 0x1C20   (0x0030)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace62;                   // 0x1C50   (0x0190)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer63;                           // 0x1DE0   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult64;                                // 0x1EC8   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine65;                               // 0x1EF8   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult66;                                // 0x1FA8   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine67;                               // 0x1FD8   (0x00B0)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult68;                           // 0x2088   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult69;                           // 0x20B0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer70;                             // 0x20D8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult71;                                // 0x2158   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult72;                           // 0x2188   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult73;                           // 0x21B0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult74;                           // 0x21D8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult75;                           // 0x2200   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult76;                           // 0x2228   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult77;                           // 0x2250   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult78;                           // 0x2278   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult79;                           // 0x22A0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer80;                             // 0x22C8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult81;                                // 0x2348   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer82;                             // 0x2378   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult83;                                // 0x23F8   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer84;                             // 0x2428   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult85;                                // 0x24A8   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer86;                             // 0x24D8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult87;                                // 0x2558   (0x0030)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace88;                   // 0x2588   (0x0190)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer89;                           // 0x2718   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult90;                                // 0x2800   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine91;                               // 0x2830   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult92;                                // 0x28E0   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine93;                               // 0x2910   (0x00B0)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum94;                            // 0x29C0   (0x00B0)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult95;                           // 0x2A70   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult96;                           // 0x2A98   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer97;                             // 0x2AC0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult98;                                // 0x2B40   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult99;                           // 0x2B70   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult100;                          // 0x2B98   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult101;                          // 0x2BC0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult102;                          // 0x2BE8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult103;                          // 0x2C10   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult104;                          // 0x2C38   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult105;                          // 0x2C60   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer106;                            // 0x2C88   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult107;                               // 0x2D08   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer108;                            // 0x2D38   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult109;                               // 0x2DB8   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer110;                            // 0x2DE8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult111;                               // 0x2E68   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer112;                            // 0x2E98   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult113;                               // 0x2F18   (0x0030)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace114;                  // 0x2F48   (0x0190)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer115;                          // 0x30D8   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult116;                               // 0x31C0   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine117;                              // 0x31F0   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult118;                               // 0x32A0   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine119;                              // 0x32D0   (0x00B0)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult120;                          // 0x3380   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult121;                          // 0x33A8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer122;                            // 0x33D0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult123;                               // 0x3450   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult124;                          // 0x3480   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult125;                          // 0x34A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult126;                          // 0x34D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult127;                          // 0x34F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult128;                          // 0x3520   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult129;                          // 0x3548   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult130;                          // 0x3570   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer131;                            // 0x3598   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult132;                               // 0x3618   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer133;                            // 0x3648   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult134;                               // 0x36C8   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer135;                            // 0x36F8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult136;                               // 0x3778   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer137;                            // 0x37A8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult138;                               // 0x3828   (0x0030)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace139;                  // 0x3858   (0x0190)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer140;                          // 0x39E8   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult141;                               // 0x3AD0   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine142;                              // 0x3B00   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult143;                               // 0x3BB0   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine144;                              // 0x3BE0   (0x00B0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x3C90   (0x0050)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult145;                          // 0x3CE0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult146;                          // 0x3D08   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer147;                            // 0x3D30   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult148;                               // 0x3DB0   (0x0030)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace149;                  // 0x3DE0   (0x0190)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult150;                          // 0x3F70   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult151;                          // 0x3F98   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult152;                          // 0x3FC0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult153;                          // 0x3FE8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult154;                          // 0x4010   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult155;                          // 0x4038   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult156;                          // 0x4060   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult157;                          // 0x4088   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer158;                            // 0x40B0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult159;                               // 0x4130   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer160;                            // 0x4160   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult161;                               // 0x41E0   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer162;                            // 0x4210   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult163;                               // 0x4290   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer164;                            // 0x42C0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult165;                               // 0x4340   (0x0030)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer166;                          // 0x4370   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult167;                               // 0x4458   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine168;                              // 0x4488   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult169;                               // 0x4538   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine170;                              // 0x4568   (0x00B0)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult171;                          // 0x4618   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult172;                          // 0x4640   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer173;                            // 0x4668   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult174;                               // 0x46E8   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult175;                          // 0x4718   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult176;                          // 0x4740   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult177;                          // 0x4768   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult178;                          // 0x4790   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult179;                          // 0x47B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult180;                          // 0x47E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult181;                          // 0x4808   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult182;                          // 0x4830   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer183;                            // 0x4858   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult184;                               // 0x48D8   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator185;                         // 0x4908   (0x0050)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult186;                               // 0x4958   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer187;                            // 0x4988   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult188;                               // 0x4A08   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer189;                            // 0x4A38   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult190;                               // 0x4AB8   (0x0030)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace191;                  // 0x4AE8   (0x0190)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer192;                          // 0x4C78   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult193;                               // 0x4D60   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine194;                              // 0x4D90   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult195;                               // 0x4E40   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine196;                              // 0x4E70   (0x00B0)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult197;                          // 0x4F20   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult198;                          // 0x4F48   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer199;                            // 0x4F70   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult200;                               // 0x4FF0   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult201;                          // 0x5020   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult202;                          // 0x5048   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult203;                          // 0x5070   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult204;                          // 0x5098   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult205;                          // 0x50C0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult206;                          // 0x50E8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult207;                          // 0x5110   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer208;                            // 0x5138   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult209;                               // 0x51B8   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer210;                            // 0x51E8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult211;                               // 0x5268   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer212;                            // 0x5298   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult213;                               // 0x5318   (0x0030)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace214;                  // 0x5348   (0x0190)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer215;                          // 0x54D8   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult216;                               // 0x55C0   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine217;                              // 0x55F0   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult218;                               // 0x56A0   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine219;                              // 0x56D0   (0x00B0)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult220;                          // 0x5780   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult221;                          // 0x57A8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer222;                            // 0x57D0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult223;                               // 0x5850   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult224;                          // 0x5880   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult225;                          // 0x58A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult226;                          // 0x58D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult227;                          // 0x58F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult228;                          // 0x5920   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult229;                          // 0x5948   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult230;                          // 0x5970   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult231;                          // 0x5998   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer232;                            // 0x59C0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult233;                               // 0x5A40   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer234;                            // 0x5A70   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult235;                               // 0x5AF0   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer236;                            // 0x5B20   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult237;                               // 0x5BA0   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer238;                            // 0x5BD0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult239;                               // 0x5C50   (0x0030)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace240;                  // 0x5C80   (0x0190)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer241;                          // 0x5E10   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult242;                               // 0x5EF8   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine243;                              // 0x5F28   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult244;                               // 0x5FD8   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine245;                              // 0x6008   (0x00B0)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult246;                          // 0x60B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult247;                          // 0x60E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult248;                          // 0x6108   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult249;                          // 0x6130   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult250;                          // 0x6158   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult251;                          // 0x6180   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult252;                          // 0x61A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult253;                          // 0x61D0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer254;                            // 0x61F8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult255;                               // 0x6278   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer256;                            // 0x62A8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult257;                               // 0x6328   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer258;                            // 0x6358   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult259;                               // 0x63D8   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer260;                            // 0x6408   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult261;                               // 0x6488   (0x0030)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer262;                          // 0x64B8   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult263;                               // 0x65A0   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine264;                              // 0x65D0   (0x00B0)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult265;                          // 0x6680   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult266;                          // 0x66A8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer267;                            // 0x66D0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult268;                               // 0x6750   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult269;                          // 0x6780   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult270;                          // 0x67A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult271;                          // 0x67D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult272;                          // 0x67F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult273;                          // 0x6820   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult274;                          // 0x6848   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult275;                          // 0x6870   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult276;                          // 0x6898   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer277;                            // 0x68C0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult278;                               // 0x6940   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer279;                            // 0x6970   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult280;                               // 0x69F0   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer281;                            // 0x6A20   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult282;                               // 0x6AA0   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer283;                            // 0x6AD0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult284;                               // 0x6B50   (0x0030)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace285;                  // 0x6B80   (0x0190)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer286;                          // 0x6D10   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult287;                               // 0x6DF8   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine288;                              // 0x6E28   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult289;                               // 0x6ED8   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine290;                              // 0x6F08   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult291;                               // 0x6FB8   (0x0030)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine292;                              // 0x6FE8   (0x00B0)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x7098   (0x0020)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x70B8   (0x0008)  MISSED
	FAnimNode_TwoBoneIK                                AnimGraphNode_TwoBoneIK;                                    // 0x70C0   (0x01E0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x72A0   (0x0020)  
	class ABP_BaseCharacter_C*                         PawnRef;                                                    // 0x72C0   (0x0008)  
	bool                                               bAiming;                                                    // 0x72C8   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x72C9   (0x0003)  MISSED
	float                                              Speed;                                                      // 0x72CC   (0x0004)  
	bool                                               bFalling;                                                   // 0x72D0   (0x0001)  
	bool                                               IsRunning;                                                  // 0x72D1   (0x0001)  
	TEnumAsByte<EEquipedWeapon>                        EquipedWeapon;                                              // 0x72D2   (0x0001)  
	unsigned char                                      UnknownData03_6[0x1];                                       // 0x72D3   (0x0001)  MISSED
	float                                              Right;                                                      // 0x72D4   (0x0004)  
	float                                              Up;                                                         // 0x72D8   (0x0004)  
	bool                                               IsCrouched;                                                 // 0x72DC   (0x0001)  
	bool                                               bUsingLethal;                                               // 0x72DD   (0x0001)  
	TEnumAsByte<ELethalEquipment>                      LethalEquipment;                                            // 0x72DE   (0x0001)  
	TEnumAsByte<EWeaponNames>                          Weapon_Name;                                                // 0x72DF   (0x0001)  


	/// Functions
	// Function /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph) // [0x12295a0] HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FPoseLink&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(AnimGraph);
	}
	// Function /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C.GetPawnInfo
	void GetPawnInfo() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C.BlueprintUpdateAnimation
	void BlueprintUpdateAnimation(float DeltaTimeX) // [0x12295a0] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(DeltaTimeX);
	}
	// Function /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C.AnimNotify_ReloadCompleted
	void AnimNotify_ReloadCompleted() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C.AnimNotify_Footstep
	void AnimNotify_Footstep() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C.AnimNotify_MeleeCompleted
	void AnimNotify_MeleeCompleted() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C.BlueprintInitializeAnimation
	void BlueprintInitializeAnimation() // [0x12295a0] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C.AnimNotify_SpawnExplosive
	void AnimNotify_SpawnExplosive() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
	// Function /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C.AnimNotify_ThrowItem
	void AnimNotify_ThrowItem() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func();
	}
	// Function /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C.AnimNotify_ShowLethal
	void AnimNotify_ShowLethal() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func();
	}
	// Function /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C.AnimNotify_HideLethalEquipment
	void AnimNotify_HideLethalEquipment() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func();
	}
	// Function /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C.AnimNotify_EquipWeapon
	void AnimNotify_EquipWeapon() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func();
	}
	// Function /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C.AnimNotify_HideWeapon
	void AnimNotify_HideWeapon() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func();
	}
	// Function /Game/FPS/Animations/FPP_Animations/ABP_FPP_Base.ABP_FPP_Base_C.ExecuteUbergraph_ABP_FPP_Base
	void ExecuteUbergraph_ABP_FPP_Base(int32_t EntryPoint) // [0x12295a0] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/Blueprints/CameraShake/CS_Impact.CS_Impact_C
/// Size: 0x01B0 (432 bytes) (0x0001B0 - 0x0001B0) align 16 MaxSize: 0x01B0
class UCS_Impact_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/FPS/Blueprints/CameraShake/CS_Melee.CS_Melee_C
/// Size: 0x01B0 (432 bytes) (0x0001B0 - 0x0001B0) align 16 MaxSize: 0x01B0
class UCS_Melee_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/FPS/Blueprints/CameraShake/CS_Run.CS_Run_C
/// Size: 0x01B0 (432 bytes) (0x0001B0 - 0x0001B0) align 16 MaxSize: 0x01B0
class UCS_Run_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/FPS/Blueprints/Spectator/BP_SpectatorBase.BP_SpectatorBase_C
/// Size: 0x0298 (664 bytes) (0x000280 - 0x000298) align 8 MaxSize: 0x0298
class ABP_SpectatorBase_C : public APawn
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	class USpringArmComponent*                         SpringArm;                                                  // 0x0288   (0x0008)  
	class UCameraComponent*                            Camera;                                                     // 0x0290   (0x0008)  


	/// Functions
	// Function /Game/FPS/Blueprints/Spectator/BP_SpectatorBase.BP_SpectatorBase_C.InpAxisEvt_LookUp_K2Node_InputAxisEvent
	void InpAxisEvt_LookUp_K2Node_InputAxisEvent(float AxisValue) // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(AxisValue);
	}
	// Function /Game/FPS/Blueprints/Spectator/BP_SpectatorBase.BP_SpectatorBase_C.InpAxisEvt_Turn_K2Node_InputAxisEvent
	void InpAxisEvt_Turn_K2Node_InputAxisEvent(float AxisValue) // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(AxisValue);
	}
	// Function /Game/FPS/Blueprints/Spectator/BP_SpectatorBase.BP_SpectatorBase_C.ReceiveBeginPlay
	void ReceiveBeginPlay() // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/FPS/Blueprints/Spectator/BP_SpectatorBase.BP_SpectatorBase_C.ExecuteUbergraph_BP_SpectatorBase
	void ExecuteUbergraph_BP_SpectatorBase(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/Blueprints/WeaponPickup/BP_PickupAmmo.BP_PickupAmmo_C
/// Size: 0x0248 (584 bytes) (0x000220 - 0x000248) align 8 MaxSize: 0x0248
class ABP_PickupAmmo_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USphereComponent*                            Sphere;                                                     // 0x0228   (0x0008)  
	class UStaticMeshComponent*                        StaticMesh;                                                 // 0x0230   (0x0008)  
	bool                                               bActive;                                                    // 0x0238   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0239   (0x0007)  MISSED
	FTimerHandle                                       CheckVelocityTimerHandle;                                   // 0x0240   (0x0008)  


	/// Functions
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupAmmo.BP_PickupAmmo_C.PickupMagazines
	void PickupMagazines(AActor* Actor) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Actor);
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupAmmo.BP_PickupAmmo_C.CheckForOverlappingActors
	void CheckForOverlappingActors() // [0x12295a0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupAmmo.BP_PickupAmmo_C.ReceiveBeginPlay
	void ReceiveBeginPlay() // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupAmmo.BP_PickupAmmo_C.BndEvt__BP_PickupAmmo_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__BP_PickupAmmo_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult) // [0x12295a0] HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UPrimitiveComponent*, AActor*, UPrimitiveComponent*, int32_t, bool, FHitResult&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(OverlappedComponent, OtherActor, OtherComp, OtherBodyIndex, bFromSweep, SweepResult);
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupAmmo.BP_PickupAmmo_C.InitMag
	void InitMag() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupAmmo.BP_PickupAmmo_C.SimCheck
	void SimCheck() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupAmmo.BP_PickupAmmo_C.ExecuteUbergraph_BP_PickupAmmo
	void ExecuteUbergraph_BP_PickupAmmo(int32_t EntryPoint) // [0x12295a0] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C
/// Size: 0x025C (604 bytes) (0x000220 - 0x00025C) align 8 MaxSize: 0x025C
class ABP_PickupWeapon_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UCapsuleComponent*                           interactionCapsule;                                         // 0x0228   (0x0008)  
	class USkeletalMeshComponent*                      Mesh;                                                       // 0x0230   (0x0008)  
	class USkeletalMesh*                               WeaponMesh;                                                 // 0x0238   (0x0008)  
	FTimerHandle                                       CheckVelocityTimerHandle;                                   // 0x0240   (0x0008)  
	class UStaticMeshComponent*                        StaticMesh;                                                 // 0x0248   (0x0008)  
	class UClass*                                      WeaponClass;                                                // 0x0250   (0x0008)  
	int32_t                                            Ammo;                                                       // 0x0258   (0x0004)  


	/// Functions
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C.GetInteractTime
	void GetInteractTime(float& InteractTime) // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(InteractTime);
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C.GetIcon
	void GetIcon(UTexture*& Icon) // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UTexture*&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(Icon);
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C.GetDescription
	void GetDescription(FText& Description) // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FText&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(Description);
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C.TryToInteract
	void TryToInteract(bool& bFailure) // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(bFailure);
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C.OnRep_WeaponMesh
	void OnRep_WeaponMesh() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C.BeginInteract
	void BeginInteract(ACharacter* Instigator) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ACharacter*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(Instigator);
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C.EndInteract
	void EndInteract() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C.StopSimulatingPhysics
	void StopSimulatingPhysics() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C.EndHover
	void EndHover() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func();
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C.CheckPhysics
	void CheckPhysics() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func();
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C.ReceiveBeginPlay
	void ReceiveBeginPlay() // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func();
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C.Interact
	void Interact(ACharacter* Instigator) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ACharacter*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func(Instigator);
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C.BeginHover
	void BeginHover(ACharacter* Instigator) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ACharacter*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func(Instigator);
	}
	// Function /Game/FPS/Blueprints/WeaponPickup/BP_PickupWeapon.BP_PickupWeapon_C.ExecuteUbergraph_BP_PickupWeapon
	void ExecuteUbergraph_BP_PickupWeapon(int32_t EntryPoint) // [0x12295a0] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/UI/Gameplay/WB_Dynamic_Crosshair.WB_Dynamic_Crosshair_C
/// Size: 0x02B0 (688 bytes) (0x000260 - 0x0002B0) align 8 MaxSize: 0x02B0
class UWB_Dynamic_Crosshair_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UWidgetAnimation*                            CookGrenadeAnim;                                            // 0x0268   (0x0008)  
	class UImage*                                      CrosshairBottom;                                            // 0x0270   (0x0008)  
	class UImage*                                      CrosshairLeft;                                              // 0x0278   (0x0008)  
	class UImage*                                      CrosshairRight;                                             // 0x0280   (0x0008)  
	class UImage*                                      CrosshairTop;                                               // 0x0288   (0x0008)  
	class ABP_PlayerCharacter_C*                       PawnRef;                                                    // 0x0290   (0x0008)  
	float                                              CurrentPosition;                                            // 0x0298   (0x0004)  
	float                                              TargetPosition;                                             // 0x029C   (0x0004)  
	float                                              MaxSpread;                                                  // 0x02A0   (0x0004)  
	float                                              IncreaseSpeed;                                              // 0x02A4   (0x0004)  
	float                                              DecreaseSpeed;                                              // 0x02A8   (0x0004)  
	float                                              MaxOpacity;                                                 // 0x02AC   (0x0004)  


	/// Functions
	// Function /Game/FPS/UI/Gameplay/WB_Dynamic_Crosshair.WB_Dynamic_Crosshair_C.ShouldHideCrosshair
	void ShouldHideCrosshair(ABP_PlayerCharacter_C* Pawn, bool& Hide) // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABP_PlayerCharacter_C*, bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Pawn, Hide);
	}
	// Function /Game/FPS/UI/Gameplay/WB_Dynamic_Crosshair.WB_Dynamic_Crosshair_C.SetColorAndVisibility
	void SetColorAndVisibility() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/WB_Dynamic_Crosshair.WB_Dynamic_Crosshair_C.GetCrosshairVisibility
	ESlateVisibility GetCrosshairVisibility() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef ESlateVisibility (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func();
	}
	// Function /Game/FPS/UI/Gameplay/WB_Dynamic_Crosshair.WB_Dynamic_Crosshair_C.Construct
	void Construct() // [0x12295a0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/WB_Dynamic_Crosshair.WB_Dynamic_Crosshair_C.UpdateCrosshair
	void UpdateCrosshair() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/FPS/UI/Gameplay/WB_Dynamic_Crosshair.WB_Dynamic_Crosshair_C.ExecuteUbergraph_WB_Dynamic_Crosshair
	void ExecuteUbergraph_WB_Dynamic_Crosshair(int32_t EntryPoint) // [0x12295a0] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C
/// Size: 0x03D4 (980 bytes) (0x000308 - 0x0003D4) align 8 MaxSize: 0x03D4
class ABP_Base_GM_C : public AGameMode
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0308   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0310   (0x0008)  
	float                                              TimeDilationTimeline_TimeDilation_4E0F90B64A3A72D68D02ACB8159EBC91; // 0x0318   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    TimeDilationTimeline__Direction_4E0F90B64A3A72D68D02ACB8159EBC91; // 0x031C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x031D   (0x0003)  MISSED
	class UTimelineComponent*                          TimeDilationTimeline;                                       // 0x0320   (0x0008)  
	TArray<class APlayerController*>                   AllPlayersPCs;                                              // 0x0328   (0x0010)  
	TArray<class ABP_PlayerSpawn_C*>                   PossibleSpawnsA;                                            // 0x0338   (0x0010)  
	TArray<class ABP_PlayerSpawn_C*>                   PossibleSpawnsB;                                            // 0x0348   (0x0010)  
	bool                                               bGameOver;                                                  // 0x0358   (0x0001)  
	bool                                               bAllowBots;                                                 // 0x0359   (0x0001)  
	bool                                               bFriendlyFire;                                              // 0x035A   (0x0001)  
	unsigned char                                      UnknownData01_6[0x1];                                       // 0x035B   (0x0001)  MISSED
	float                                              FriendlyDmgMultiplier;                                      // 0x035C   (0x0004)  
	int32_t                                            TeamABots;                                                  // 0x0360   (0x0004)  
	int32_t                                            TeamBBots;                                                  // 0x0364   (0x0004)  
	TArray<class ABP_PlayerSpawn_C*>                   PlayerSpawnsA;                                              // 0x0368   (0x0010)  
	TArray<class ABP_PlayerSpawn_C*>                   PlayerSpawnsB;                                              // 0x0378   (0x0010)  
	float                                              MinSpawnEnemyDistance;                                      // 0x0388   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x038C   (0x0004)  MISSED
	TArray<class AController*>                         TeamABotsControllers;                                       // 0x0390   (0x0010)  
	TArray<class AController*>                         TeamBBotsControllers;                                       // 0x03A0   (0x0010)  
	int32_t                                            TeamAScore;                                                 // 0x03B0   (0x0004)  
	int32_t                                            TeamBScore;                                                 // 0x03B4   (0x0004)  
	float                                              TimeToReset;                                                // 0x03B8   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x03BC   (0x0004)  MISSED
	class ABP_PlayerSpawn_C*                           SelectedSpawn;                                              // 0x03C0   (0x0008)  
	class UBehaviorTree*                               AI_BehaviorTree;                                            // 0x03C8   (0x0008)  
	bool                                               bUseAutoTeamBalance;                                        // 0x03D0   (0x0001)  
	TEnumAsByte<E_AI_Difficulty>                       AI_Difficulty;                                              // 0x03D1   (0x0001)  
	bool                                               bPlayerCanChangeTeam;                                       // 0x03D2   (0x0001)  
	bool                                               FFAMode;                                                    // 0x03D3   (0x0001)  


	/// Functions
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.DestroyGameModeActors
	void DestroyGameModeActors() // [0x12295a0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.ChooseSpawnDM
	// void ChooseSpawnDM(TArray<ABP_PlayerSpawn_C*>& Spawns, int32_t Team, TArray<ABP_PlayerSpawn_C*>& BestSpawns);            // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.AutoTeamBalanceUponDeath
	void AutoTeamBalanceUponDeath(AController* PlayerController) // [0x12295a0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(PlayerController);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.CheckTeamBalance
	void CheckTeamBalance(AController* PlayerController, bool& NoSwap) // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AController*, bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(PlayerController, NoSwap);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.GetDefaultPawnClassForController
	UClass* GetDefaultPawnClassForController(AController* InController) // [0x12295a0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef class UClass* (*FuncPtr)(AController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		return func(InController);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.SetGameWithBots
	void SetGameWithBots(bool bAllowBots) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(bAllowBots);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.GetGameWithBots
	void GetGameWithBots(bool& bGameWithBots) // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	{
		typedef void (*FuncPtr)(bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func(bGameWithBots);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.SetGameOver
	void SetGameOver(bool bGameOver) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(bGameOver);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.IsGameOver
	void IsGameOver(bool& bGameOver) // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	{
		typedef void (*FuncPtr)(bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func(bGameOver);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.IsFriendlyFireEnabled
	void IsFriendlyFireEnabled(bool& bEnabled) // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	{
		typedef void (*FuncPtr)(bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func(bEnabled);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.SetFriedlyFire
	void SetFriedlyFire(bool bFriendlyFire) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func(bFriendlyFire);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.ShowCharacterSelection Screen
	void ShowCharacterSelectionScreen(APlayerController* NewPlayer) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(APlayerController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func(NewPlayer);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.SetAIDifficulty
	void SetAIDifficulty() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.AutoBalanceTeam
	void AutoBalanceTeam() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.AutoTeamBalance_InitialTeam
	void AutoTeamBalance_InitialTeam(AController* PlayerController) // [0x12295a0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func(PlayerController);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.HandleFriendlyFireDamage
	void HandleFriendlyFireDamage(float Damage, float& DamageToDo) // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float, float&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func(Damage, DamageToDo);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.OverrideNumberOfBots
	void OverrideNumberOfBots(int32_t TeamA, int32_t TeamB) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(int32_t, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func(TeamA, TeamB);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.OnRep_AllPlayersPCs
	void OnRep_AllPlayersPCs() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.DestroyBotsPlayerState
	void DestroyBotsPlayerState() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.UnpossesBots
	void UnpossesBots() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.ReadyToStartMatch
	bool ReadyToStartMatch() // [0x12295a0] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		return func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.ReadyToEndMatch
	bool ReadyToEndMatch() // [0x12295a0] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[21]);
		return func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.PossesPawn
	void PossesPawn(AActor* Pawn, APlayerController* Controller, FTransform Transform) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AActor*, APlayerController*, FTransform);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		func(Pawn, Controller, Transform);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.SendKillFeedInfo
	void SendKillFeedInfo(APlayerState* Kill, APlayerState* Vic, UDamageType* DmgType, APlayerState* Assist, bool bHeadshot) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(APlayerState*, APlayerState*, UDamageType*, APlayerState*, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		func(Kill, Vic, DmgType, Assist, bHeadshot);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.ChooseSpawn
	// void ChooseSpawn(TArray<ABP_PlayerSpawn_C*>& Spawns, int32_t Team, TArray<ABP_PlayerSpawn_C*>& BestSpawns);              // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.GetPlayerSpawns
	void GetPlayerSpawns(bool FFA) // [0x12295a0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[25]);
		func(FFA);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.AllPosibleSpawns
	void AllPosibleSpawns(APlayerController* PlayerController) // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(APlayerController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[26]);
		func(PlayerController);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.SpawnCharacterPawn
	// void SpawnCharacterPawn(FTransform SpawnTransform, TEnumAsByte<EPlayerClass> PlayerClass, APlayerController* PC);        // [0x12295a0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.Team Posible Spawn
	// void TeamPosibleSpawn(int32_t Team, TArray<ABP_PlayerSpawn_C*>& TeamSpawns, bool Bots, TArray<ABP_PlayerSpawn_C*>& PosibleSpawn); // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.TimeDilationTimeline__FinishedFunc
	void TimeDilationTimeline__FinishedFunc() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[29]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.TimeDilationTimeline__UpdateFunc
	void TimeDilationTimeline__UpdateFunc() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[30]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.CheckGameOptions
	void CheckGameOptions() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[31]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.ManageNumberOfBots
	void ManageNumberOfBots() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[32]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.SVR_SetPointsToWin
	void SVR_SetPointsToWin(int32_t PointsToWin) // [0x12295a0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[33]);
		func(PointsToWin);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.CreateBots
	void CreateBots() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[34]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.SpawnBots
	void SpawnBots() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[35]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.SpawnPlayers
	void SpawnPlayers() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[36]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.SpawnCharacterWithClass
	// void SpawnCharacterWithClass(TEnumAsByte<EPlayerClass> PlayerClass, APlayerController* PlayerController);                // [0x12295a0] BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.SpawnPlayerClass
	// void SpawnPlayerClass(TEnumAsByte<EPlayerClass> PlayerClass, APlayerController* PlayerController);                       // [0x12295a0] BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.Server_KickAllPlayers
	void Server_KickAllPlayers() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[39]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.Server_RemovePC
	void Server_RemovePC(APlayerController* NewParam) // [0x12295a0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(APlayerController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[40]);
		func(NewParam);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.K2_OnLogout
	void K2_OnLogout(AController* ExitingController) // [0x12295a0] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[41]);
		func(ExitingController);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.Server_EndGame
	void Server_EndGame() // [0x12295a0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[42]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.HandleStartingNewPlayer
	void HandleStartingNewPlayer(APlayerController* NewPlayer) // [0x12295a0] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(APlayerController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[43]);
		func(NewPlayer);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.ReceiveBeginPlay
	void ReceiveBeginPlay() // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[44]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.ResetGame
	void ResetGame(float Delay) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[45]);
		func(Delay);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.Server_ResetSpawns
	void Server_ResetSpawns() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[46]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.Server_GetKillFeedText
	void Server_GetKillFeedText(APlayerState* Kill, APlayerState* Vic, UDamageType* DmgType, APlayerState* Assist, bool bHeadshot) // [0x12295a0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(APlayerState*, APlayerState*, UDamageType*, APlayerState*, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[47]);
		func(Kill, Vic, DmgType, Assist, bHeadshot);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.Server_UpdateScores
	void Server_UpdateScores() // [0x12295a0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[48]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.InitializeHUDForPlayer
	void InitializeHUDForPlayer(APlayerController* NewPlayer) // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(APlayerController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[49]);
		func(NewPlayer);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.Server_SendChatMessage
	void Server_SendChatMessage(FText TextToSend) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FText);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[50]);
		func(TextToSend);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.K2_PostLogin
	void K2_PostLogin(APlayerController* NewPlayer) // [0x12295a0] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(APlayerController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[51]);
		func(NewPlayer);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.K2_OnSetMatchState
	void K2_OnSetMatchState(FName NewState) // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FName);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[52]);
		func(NewState);
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.StartSlomo
	void StartSlomo() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[53]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/BP_Base_GM.BP_Base_GM_C.ExecuteUbergraph_BP_Base_GM
	void ExecuteUbergraph_BP_Base_GM(int32_t EntryPoint) // [0x12295a0] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[54]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/Blueprints/GameModes/CaptureTheFlag/BP_CaptureTheFlag_GM.BP_CaptureTheFlag_GM_C
/// Size: 0x03E0 (992 bytes) (0x0003D4 - 0x0003E0) align 8 MaxSize: 0x03E0
class ABP_CaptureTheFlag_GM_C : public ABP_Base_GM_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x03D4   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x03D8   (0x0008)  


	/// Functions
	// Function /Game/FPS/Blueprints/GameModes/CaptureTheFlag/BP_CaptureTheFlag_GM.BP_CaptureTheFlag_GM_C.ReceiveBeginPlay
	void ReceiveBeginPlay() // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/CaptureTheFlag/BP_CaptureTheFlag_GM.BP_CaptureTheFlag_GM_C.ExecuteUbergraph_BP_CaptureTheFlag_GM
	void ExecuteUbergraph_BP_CaptureTheFlag_GM(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/Blueprints/GameModes/Conquest/BP_Conquest_GM.BP_Conquest_GM_C
/// Size: 0x03E0 (992 bytes) (0x0003D4 - 0x0003E0) align 8 MaxSize: 0x03E0
class ABP_Conquest_GM_C : public ABP_Base_GM_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x03D4   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x03D8   (0x0008)  


	/// Functions
	// Function /Game/FPS/Blueprints/GameModes/Conquest/BP_Conquest_GM.BP_Conquest_GM_C.ReceiveBeginPlay
	void ReceiveBeginPlay() // [0x12295a0] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/FPS/Blueprints/GameModes/Conquest/BP_Conquest_GM.BP_Conquest_GM_C.ExecuteUbergraph_BP_Conquest_GM
	void ExecuteUbergraph_BP_Conquest_GM(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C
/// Size: 0x0370 (880 bytes) (0x000260 - 0x000370) align 8 MaxSize: 0x0370
class UWB_MainMenu_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0268   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x0270   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x0278   (0x0008)  
	class UImage*                                      Image2;                                                     // 0x0280   (0x0008)  
	class UWidgetSwitcher*                             MenuWidgetSwitcher;                                         // 0x0288   (0x0008)  
	class UWB_BaseButton_C*                            WB_ComingNext;                                              // 0x0290   (0x0008)  
	class UWB_BaseButton_C*                            WB_CreateGame;                                              // 0x0298   (0x0008)  
	class UWB_BaseButton_C*                            WB_CreateGameAS;                                            // 0x02A0   (0x0008)  
	class UWB_BaseButton_C*                            WB_CreateLobby;                                             // 0x02A8   (0x0008)  
	class UWB_BaseButton_C*                            WB_CreateLobbyAS;                                           // 0x02B0   (0x0008)  
	class UWB_BaseButton_C*                            WB_Customise;                                               // 0x02B8   (0x0008)  
	class UWB_BaseButton_C*                            WB_JoinGame;                                                // 0x02C0   (0x0008)  
	class UWB_BaseButton_C*                            WB_JoinGameAS;                                              // 0x02C8   (0x0008)  
	class UWB_BaseButton_C*                            WB_Multiplayer;                                             // 0x02D0   (0x0008)  
	class UWB_BaseButton_C*                            WB_MultiplayerAS;                                           // 0x02D8   (0x0008)  
	class UWB_BaseButton_C*                            WB_PatchNotes;                                              // 0x02E0   (0x0008)  
	class UWB_BaseButton_C*                            WB_QuitButton;                                              // 0x02E8   (0x0008)  
	class UWB_BaseButton_C*                            WB_Return;                                                  // 0x02F0   (0x0008)  
	class UWB_BaseButton_C*                            WB_ReturnAS;                                                // 0x02F8   (0x0008)  
	class UWB_BaseButton_C*                            WB_Settings;                                                // 0x0300   (0x0008)  
	class UWB_BaseButton_C*                            WB_SinglePlayer;                                            // 0x0308   (0x0008)  
	class UWB_BaseButton_C*                            WB_SurvivalMode;                                            // 0x0310   (0x0008)  
	class UBP_GameInstance_C*                          GameInstance;                                               // 0x0318   (0x0008)  
	FLinearColor                                       On_HoveredTextColor;                                        // 0x0320   (0x0010)  
	FLinearColor                                       ButtonColor;                                                // 0x0330   (0x0010)  
	FLinearColor                                       TextColor;                                                  // 0x0340   (0x0010)  
	FLinearColor                                       HoveredTextColor;                                           // 0x0350   (0x0010)  
	FLinearColor                                       HoveredColor;                                               // 0x0360   (0x0010)  


	/// Functions
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.OnFailure_73CB559D488732FFD705B69E8730BDCC
	void OnFailure_73CB559D488732FFD705B69E8730BDCC() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.OnSuccess_73CB559D488732FFD705B69E8730BDCC
	void OnSuccess_73CB559D488732FFD705B69E8730BDCC() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.BndEvt__WB_MainMenu_WB_Multiplayer_K2Node_ComponentBoundEvent_3_OnReleased__DelegateSignature
	void BndEvt__WB_MainMenu_WB_Multiplayer_K2Node_ComponentBoundEvent_3_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.BndEvt__WB_MainMenu_WB_SinglePlayer_K2Node_ComponentBoundEvent_10_OnReleased__DelegateSignature
	void BndEvt__WB_MainMenu_WB_SinglePlayer_K2Node_ComponentBoundEvent_10_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.BndEvt__WB_MainMenu_WB_Settings_K2Node_ComponentBoundEvent_12_OnReleased__DelegateSignature
	void BndEvt__WB_MainMenu_WB_Settings_K2Node_ComponentBoundEvent_12_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.BndEvt__WB_MainMenu_WB_QuitButton_K2Node_ComponentBoundEvent_21_OnReleased__DelegateSignature
	void BndEvt__WB_MainMenu_WB_QuitButton_K2Node_ComponentBoundEvent_21_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.BndEvt__WB_MainMenu_WB_Return_K2Node_ComponentBoundEvent_2_OnReleased__DelegateSignature
	void BndEvt__WB_MainMenu_WB_Return_K2Node_ComponentBoundEvent_2_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.BndEvt__WB_MainMenu_WB_CreateGame_K2Node_ComponentBoundEvent_4_OnReleased__DelegateSignature
	void BndEvt__WB_MainMenu_WB_CreateGame_K2Node_ComponentBoundEvent_4_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.BndEvt__WB_MainMenu_WB_JoinGame_K2Node_ComponentBoundEvent_5_OnReleased__DelegateSignature
	void BndEvt__WB_MainMenu_WB_JoinGame_K2Node_ComponentBoundEvent_5_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.Construct
	void Construct() // [0x12295a0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.BndEvt__WB_MainMenu_WB_CreateLobby_K2Node_ComponentBoundEvent_0_OnReleased__DelegateSignature
	void BndEvt__WB_MainMenu_WB_CreateLobby_K2Node_ComponentBoundEvent_0_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.BndEvt__WB_MainMenu_WB_MultiplayerAS_K2Node_ComponentBoundEvent_1_OnReleased__DelegateSignature
	void BndEvt__WB_MainMenu_WB_MultiplayerAS_K2Node_ComponentBoundEvent_1_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.BndEvt__WB_MainMenu_WB_ReturnAS_K2Node_ComponentBoundEvent_6_OnReleased__DelegateSignature
	void BndEvt__WB_MainMenu_WB_ReturnAS_K2Node_ComponentBoundEvent_6_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.BndEvt__WB_MainMenu_WB_JoinGame_1_K2Node_ComponentBoundEvent_7_OnReleased__DelegateSignature
	void BndEvt__WB_MainMenu_WB_JoinGame_1_K2Node_ComponentBoundEvent_7_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.BndEvt__WB_MainMenu_WB_CreateGameAS_K2Node_ComponentBoundEvent_8_OnReleased__DelegateSignature
	void BndEvt__WB_MainMenu_WB_CreateGameAS_K2Node_ComponentBoundEvent_8_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.BndEvt__WB_MainMenu_WB_JoinGameAS_K2Node_ComponentBoundEvent_9_OnReleased__DelegateSignature
	void BndEvt__WB_MainMenu_WB_JoinGameAS_K2Node_ComponentBoundEvent_9_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.BndEvt__WB_MainMenu_WB_ComingNext_K2Node_ComponentBoundEvent_13_OnReleased__DelegateSignature
	void BndEvt__WB_MainMenu_WB_ComingNext_K2Node_ComponentBoundEvent_13_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_MainMenu.WB_MainMenu_C.ExecuteUbergraph_WB_MainMenu
	void ExecuteUbergraph_WB_MainMenu(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/UI/Buttons/WB_BaseButton.WB_BaseButton_C
/// Size: 0x03D0 (976 bytes) (0x000260 - 0x0003D0) align 8 MaxSize: 0x03D0
class UWB_BaseButton_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UButton*                                     BaseButton;                                                 // 0x0268   (0x0008)  
	class UTextBlock*                                  ButtonText;                                                 // 0x0270   (0x0008)  
	FText                                              Text;                                                       // 0x0278   (0x0018)  
	FSlateFontInfo                                     DefaultTextFont;                                            // 0x0290   (0x0058)  
	TEnumAsByte<ETextJustify>                          Justification;                                              // 0x02E8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x02E9   (0x0007)  MISSED
	SDK_UNDEFINED(16,553) /* FMulticastInlineDelegate */ __um(OnClicked);                                          // 0x02F0   (0x0010)  
	SDK_UNDEFINED(16,554) /* FMulticastInlineDelegate */ __um(OnReleased);                                         // 0x0300   (0x0010)  
	FSlateFontInfo                                     HoveredTextFont;                                            // 0x0310   (0x0058)  
	FSlateColor                                        DefaultColor;                                               // 0x0368   (0x0028)  
	FSlateColor                                        HoveredColor;                                               // 0x0390   (0x0028)  
	FLinearColor                                       ButtonBackground_Color;                                     // 0x03B8   (0x0010)  
	class USoundBase*                                  HoveredSound;                                               // 0x03C8   (0x0008)  


	/// Functions
	// Function /Game/FPS/UI/Buttons/WB_BaseButton.WB_BaseButton_C.InitButton
	void InitButton() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/FPS/UI/Buttons/WB_BaseButton.WB_BaseButton_C.BndEvt__WB_BaseButton_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__WB_BaseButton_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/FPS/UI/Buttons/WB_BaseButton.WB_BaseButton_C.BndEvt__WB_BaseButton_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature
	void BndEvt__WB_BaseButton_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/FPS/UI/Buttons/WB_BaseButton.WB_BaseButton_C.BndEvt__WB_BaseButton_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WB_BaseButton_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Game/FPS/UI/Buttons/WB_BaseButton.WB_BaseButton_C.BndEvt__WB_BaseButton_BaseButton_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WB_BaseButton_BaseButton_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/FPS/UI/Buttons/WB_BaseButton.WB_BaseButton_C.PreConstruct
	void PreConstruct(bool IsDesignTime) // [0x12295a0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(IsDesignTime);
	}
	// Function /Game/FPS/UI/Buttons/WB_BaseButton.WB_BaseButton_C.ExecuteUbergraph_WB_BaseButton
	void ExecuteUbergraph_WB_BaseButton(int32_t EntryPoint) // [0x12295a0] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func(EntryPoint);
	}
	// Function /Game/FPS/UI/Buttons/WB_BaseButton.WB_BaseButton_C.OnReleased__DelegateSignature
	void OnReleased__DelegateSignature() // [0x12295a0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
	// Function /Game/FPS/UI/Buttons/WB_BaseButton.WB_BaseButton_C.OnClicked__DelegateSignature
	void OnClicked__DelegateSignature() // [0x12295a0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func();
	}
};

/// Class /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C
/// Size: 0x0568 (1384 bytes) (0x000260 - 0x000568) align 8 MaxSize: 0x0568
class UWB_CreateMatchMenuAS_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UHorizontalBox*                              AIDifficultyHB;                                             // 0x0268   (0x0008)  
	class UCheckBox*                                   BotsCheckBox;                                               // 0x0270   (0x0008)  
	class UButton*                                     DecreaseAIDifficulty;                                       // 0x0278   (0x0008)  
	class UTextBlock*                                  Description;                                                // 0x0280   (0x0008)  
	class UEditableTextBox*                            EditableTextBox;                                            // 0x0288   (0x0008)  
	class UHorizontalBox*                              EnableLanHB;                                                // 0x0290   (0x0008)  
	class UImage*                                      Fade;                                                       // 0x0298   (0x0008)  
	class UCheckBox*                                   FriendlyFireCheckBox;                                       // 0x02A0   (0x0008)  
	class UHorizontalBox*                              FriendlyFireHB;                                             // 0x02A8   (0x0008)  
	class UImage*                                      GameModeImage;                                              // 0x02B0   (0x0008)  
	class UTextBlock*                                  GameModeName;                                               // 0x02B8   (0x0008)  
	class UHorizontalBox*                              HB_ServerName;                                              // 0x02C0   (0x0008)  
	class UButton*                                     IncreaseAIDifficulty;                                       // 0x02C8   (0x0008)  
	class UCheckBox*                                   LANCB;                                                      // 0x02D0   (0x0008)  
	class UButton*                                     LessABots;                                                  // 0x02D8   (0x0008)  
	class UButton*                                     LessBBots;                                                  // 0x02E0   (0x0008)  
	class UButton*                                     LessPlayersButton;                                          // 0x02E8   (0x0008)  
	class UHorizontalBox*                              MaxPlayersHB;                                               // 0x02F0   (0x0008)  
	class UButton*                                     MoreABots;                                                  // 0x02F8   (0x0008)  
	class UButton*                                     MoreBBots;                                                  // 0x0300   (0x0008)  
	class UButton*                                     MorePlayersButton;                                          // 0x0308   (0x0008)  
	class UButton*                                     NextMapButton;                                              // 0x0310   (0x0008)  
	class UButton*                                     NextModeButton;                                             // 0x0318   (0x0008)  
	class UButton*                                     PreviousMapButton;                                          // 0x0320   (0x0008)  
	class UButton*                                     PreviousModeButton;                                         // 0x0328   (0x0008)  
	class USlider*                                     ScoreSlider;                                                // 0x0330   (0x0008)  
	class UTextBlock*                                  ScoreTextBox;                                               // 0x0338   (0x0008)  
	class UHorizontalBox*                              TeamABotsHB;                                                // 0x0340   (0x0008)  
	class UHorizontalBox*                              TeamBBotsHB;                                                // 0x0348   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x0350   (0x0008)  
	class UTextBlock*                                  TextBlock0;                                                 // 0x0358   (0x0008)  
	class UTextBlock*                                  TextBlock1;                                                 // 0x0360   (0x0008)  
	class UTextBlock*                                  TextBlock2;                                                 // 0x0368   (0x0008)  
	class UTextBlock*                                  TextBlock3;                                                 // 0x0370   (0x0008)  
	class UTextBlock*                                  TextBlock4;                                                 // 0x0378   (0x0008)  
	class UTextBlock*                                  TextBlock5;                                                 // 0x0380   (0x0008)  
	class UTextBlock*                                  TextBlock6;                                                 // 0x0388   (0x0008)  
	class UWB_BaseButton_C*                            WB_Return;                                                  // 0x0390   (0x0008)  
	class UWB_BaseButton_C*                            WB_StartGame;                                               // 0x0398   (0x0008)  
	class UWidgetSwitcher*                             WS_Bots;                                                    // 0x03A0   (0x0008)  
	int32_t                                            MaxPlayers;                                                 // 0x03A8   (0x0004)  
	int32_t                                            MapIndex;                                                   // 0x03AC   (0x0004)  
	bool                                               bLAN;                                                       // 0x03B0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x03B1   (0x0003)  MISSED
	int32_t                                            TeamBBots;                                                  // 0x03B4   (0x0004)  
	int32_t                                            TeamABots;                                                  // 0x03B8   (0x0004)  
	bool                                               bUseBots;                                                   // 0x03BC   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x03BD   (0x0003)  MISSED
	FLinearColor                                       HoveredColor;                                               // 0x03C0   (0x0010)  
	FLinearColor                                       HoveredTextColor;                                           // 0x03D0   (0x0010)  
	FLinearColor                                       ButtonColor;                                                // 0x03E0   (0x0010)  
	FLinearColor                                       TextColor;                                                  // 0x03F0   (0x0010)  
	int32_t                                            MaxNumberOfBots;                                            // 0x0400   (0x0004)  
	bool                                               bFriendlyFire;                                              // 0x0404   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0405   (0x0003)  MISSED
	int32_t                                            DifficultyIndex;                                            // 0x0408   (0x0004)  
	bool                                               bMultiplayer;                                               // 0x040C   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x040D   (0x0003)  MISSED
	FMapInfo                                           CurrentGameModeInfo;                                        // 0x0410   (0x0060)  
	int32_t                                            ModeIndex;                                                  // 0x0470   (0x0004)  
	TEnumAsByte<EGameModeNames>                        SelectedGameMode;                                           // 0x0474   (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x0475   (0x0003)  MISSED
	TArray<FName>                                      ListOfRows;                                                 // 0x0478   (0x0010)  
	int32_t                                            NumberOfMapEntries;                                         // 0x0488   (0x0004)  
	unsigned char                                      UnknownData05_6[0x4];                                       // 0x048C   (0x0004)  MISSED
	FText                                              GameModeFriendlyName;                                       // 0x0490   (0x0018)  
	TMap<FString, FSteamSessionSetting>                Session_Settings;                                           // 0x04A8   (0x0050)  
	TMap<FString, FSteamSessionSetting>                Session_Settings7;                                          // 0x04F8   (0x0050)  
	FText                                              ServerName;                                                 // 0x0548   (0x0018)  
	int32_t                                            PointsToWin;                                                // 0x0560   (0x0004)  
	int32_t                                            RecalcCheck;                                                // 0x0564   (0x0004)  


	/// Functions
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.UpdateScoreSelector
	void UpdateScoreSelector() // [0x12295a0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.GetServerName
	void GetServerName() // [0x12295a0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.UpdateMapList
	void UpdateMapList() // [0x12295a0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.UpdateGameMode
	FText UpdateGameMode() // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.GetNumberOfBotsSelection
	ESlateVisibility GetNumberOfBotsSelection() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef ESlateVisibility (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.InitOptions
	void InitOptions() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.Get_DecreaseAIDifficulty_bIsEnabled
	bool Get_DecreaseAIDifficulty_bIsEnabled() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.Get_IncreaseAIDifficulty_bIsEnabled
	bool Get_IncreaseAIDifficulty_bIsEnabled() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.GetAIDifficulty
	FText GetAIDifficulty() // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.GetVisibilityNotDM
	ESlateVisibility GetVisibilityNotDM() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef ESlateVisibility (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.GetNumberOfBotsText
	FText GetNumberOfBotsText() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.GetTeamBBots
	FText GetTeamBBots() // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.GetTeamABots
	FText GetTeamABots() // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.GetMapName
	FText GetMapName() // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.GetMaxPlayers
	FText GetMaxPlayers() // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.GetLessPlayersButtonIsEnabled
	bool GetLessPlayersButtonIsEnabled() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.GetMorePlayersButtonIsEnabled
	bool GetMorePlayersButtonIsEnabled() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.OnFailure_BCDAC8ED44B29089D7D865AD8F8770E7
	void OnFailure_BCDAC8ED44B29089D7D865AD8F8770E7() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.OnSuccess_BCDAC8ED44B29089D7D865AD8F8770E7
	void OnSuccess_BCDAC8ED44B29089D7D865AD8F8770E7() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__LessPlayersButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	void BndEvt__LessPlayersButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__MorePlayersButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	void BndEvt__MorePlayersButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__NextMapButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature
	void BndEvt__NextMapButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[21]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__PreviusMapButton_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature
	void BndEvt__PreviusMapButton_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.PlaySoundEffect
	void PlaySoundEffect() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.PlaySoundLow
	void PlaySoundLow() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[24]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__LANCB_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__DelegateSignature
	void BndEvt__LANCB_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked) // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[25]);
		func(bIsChecked);
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__MoreABots_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature
	void BndEvt__MoreABots_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[26]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__MoreBBots_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature
	void BndEvt__MoreBBots_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[27]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__LessBBots_K2Node_ComponentBoundEvent_21_OnButtonClickedEvent__DelegateSignature
	void BndEvt__LessBBots_K2Node_ComponentBoundEvent_21_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[28]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__LessABots_K2Node_ComponentBoundEvent_22_OnButtonClickedEvent__DelegateSignature
	void BndEvt__LessABots_K2Node_ComponentBoundEvent_22_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[29]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__BotsCheckBox_K2Node_ComponentBoundEvent_23_OnCheckBoxComponentStateChanged__DelegateSignature
	void BndEvt__BotsCheckBox_K2Node_ComponentBoundEvent_23_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked) // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[30]);
		func(bIsChecked);
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__FriendlyFireCheckBox_K2Node_ComponentBoundEvent_24_OnCheckBoxComponentStateChanged__DelegateSignature
	void BndEvt__FriendlyFireCheckBox_K2Node_ComponentBoundEvent_24_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked) // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[31]);
		func(bIsChecked);
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.OnButtonHovered
	void OnButtonHovered(UButton* Button, UTextBlock* Text) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UButton*, UTextBlock*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[32]);
		func(Button, Text);
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.OnButtonUnhovered
	void OnButtonUnhovered(UButton* Button, UTextBlock* Text) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UButton*, UTextBlock*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[33]);
		func(Button, Text);
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.CheckNumberOfBots
	void CheckNumberOfBots() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[34]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.Construct
	void Construct() // [0x12295a0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[35]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__DecreaseAIDifficulty_K2Node_ComponentBoundEvent_10_OnButtonReleasedEvent__DelegateSignature
	void BndEvt__DecreaseAIDifficulty_K2Node_ComponentBoundEvent_10_OnButtonReleasedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[36]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__IncreaseAIDifficulty_K2Node_ComponentBoundEvent_11_OnButtonReleasedEvent__DelegateSignature
	void BndEvt__IncreaseAIDifficulty_K2Node_ComponentBoundEvent_11_OnButtonReleasedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[37]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.CreateMatch
	void CreateMatch(bool bMultiplayer, int32_t Players, bool LAN, FName Map) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool, int32_t, bool, FName);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[38]);
		func(bMultiplayer, Players, LAN, Map);
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__WB_CreateMatchMenu_WB_Return_K2Node_ComponentBoundEvent_12_OnReleased__DelegateSignature
	void BndEvt__WB_CreateMatchMenu_WB_Return_K2Node_ComponentBoundEvent_12_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[39]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__WB_CreateMatchMenu_WB_StartGame_K2Node_ComponentBoundEvent_13_OnReleased__DelegateSignature
	void BndEvt__WB_CreateMatchMenu_WB_StartGame_K2Node_ComponentBoundEvent_13_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[40]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.UpdateGameModeInfo
	void UpdateGameModeInfo() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[41]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__WB_CreateMatchMenu_PreviousModeButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__WB_CreateMatchMenu_PreviousModeButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[42]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__WB_CreateMatchMenu_NextModeButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
	void BndEvt__WB_CreateMatchMenu_NextModeButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[43]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.BndEvt__WB_CreateMatchMenuAS_ScoreSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature
	void BndEvt__WB_CreateMatchMenuAS_ScoreSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature(float Value) // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[44]);
		func(Value);
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_CreateMatchMenuAS.WB_CreateMatchMenuAS_C.ExecuteUbergraph_WB_CreateMatchMenuAS
	void ExecuteUbergraph_WB_CreateMatchMenuAS(int32_t EntryPoint) // [0x12295a0] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[45]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C
/// Size: 0x0468 (1128 bytes) (0x000260 - 0x000468) align 8 MaxSize: 0x0468
class UWB_JoinServerMenuAS_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UCircularThrobber*                           CircularThrobber;                                           // 0x0268   (0x0008)  
	class UImage*                                      Fade;                                                       // 0x0270   (0x0008)  
	class UButton*                                     HelpButton;                                                 // 0x0278   (0x0008)  
	class UBorder*                                     JoiningServerBorder;                                        // 0x0280   (0x0008)  
	class UButton*                                     JoinServer;                                                 // 0x0288   (0x0008)  
	class UTextBlock*                                  JoinText;                                                   // 0x0290   (0x0008)  
	class UButton*                                     Return;                                                     // 0x0298   (0x0008)  
	class UTextBlock*                                  ReturnText;                                                 // 0x02A0   (0x0008)  
	class UButton*                                     SearchButton;                                               // 0x02A8   (0x0008)  
	class UTextBlock*                                  SearchText;                                                 // 0x02B0   (0x0008)  
	class UVerticalBox*                                ServerList;                                                 // 0x02B8   (0x0008)  
	class USizeBox*                                    SizeBox;                                                    // 0x02C0   (0x0008)  
	int32_t                                            MaxSeachResults;                                            // 0x02C8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x02CC   (0x0004)  MISSED
	TArray<FBlueprintSessionResult>                    SessionsFound;                                              // 0x02D0   (0x0010)  
	class UWB_ServerSlotAS_C*                          WB_ServerSlot;                                              // 0x02E0   (0x0008)  
	FBlueprintSessionResult                            SessionToJoin;                                              // 0x02E8   (0x0108)  
	bool                                               bSearching;                                                 // 0x03F0   (0x0001)  
	bool                                               bLAN;                                                       // 0x03F1   (0x0001)  
	unsigned char                                      UnknownData01_6[0x6];                                       // 0x03F2   (0x0006)  MISSED
	TArray<class UWB_ServerSlotAS_C*>                  ServerSlots;                                                // 0x03F8   (0x0010)  
	FLinearColor                                       HoveredColor;                                               // 0x0408   (0x0010)  
	FLinearColor                                       HoveredTextColor;                                           // 0x0418   (0x0010)  
	FLinearColor                                       ButtonColor;                                                // 0x0428   (0x0010)  
	FLinearColor                                       TextColor;                                                  // 0x0438   (0x0010)  
	float                                              Timeout;                                                    // 0x0448   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x044C   (0x0004)  MISSED
	TArray<FSteamSessionResult>                        Results;                                                    // 0x0450   (0x0010)  
	class UWB_ServerSlotAS_C*                          WB_ServerSlotAS;                                            // 0x0460   (0x0008)  


	/// Functions
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.ResetServerSlots
	void ResetServerSlots() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.GetNotSearching
	bool GetNotSearching() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.GetVisivilityIsSearching
	ESlateVisibility GetVisivilityIsSearching() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef ESlateVisibility (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.GetbSessionIsSet
	bool GetbSessionIsSet() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.OnFailure_90484E3C42BEB47C51B397B1459B1AFC
	void OnFailure_90484E3C42BEB47C51B397B1459B1AFC() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.OnSuccess_90484E3C42BEB47C51B397B1459B1AFC
	void OnSuccess_90484E3C42BEB47C51B397B1459B1AFC() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.OnFailure_BCC501034583C75F3242EE87A5459571
	void OnFailure_BCC501034583C75F3242EE87A5459571() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.OnSuccess_BCC501034583C75F3242EE87A5459571
	void OnSuccess_BCC501034583C75F3242EE87A5459571() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.OnCallback_9DC8AB9641C830A367093B8E86B5E4F7
	// void OnCallback_9DC8AB9641C830A367093B8E86B5E4F7(TArray<FSteamSessionResult>& Results);                                  // [0x12295a0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.BndEvt__HostServer_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature
	void BndEvt__HostServer_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.BndEvt__HostServer_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature
	void BndEvt__HostServer_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.BndEvt__GoBack_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature
	void BndEvt__GoBack_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.BndEvt__GoBack_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature
	void BndEvt__GoBack_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.BndEvt__GoBack_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoBack_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.BndEvt__HostServer_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__HostServer_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.BndEvt__SearchButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__SearchButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.BndEvt__SearchButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__SearchButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.UnselectServer
	void UnselectServer() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.OnButtonHovered
	void OnButtonHovered(UButton* Button, UTextBlock* Text) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UButton*, UTextBlock*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		func(Button, Text);
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.OnButtonUnhovered
	void OnButtonUnhovered(UButton* Button, UTextBlock* Text) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UButton*, UTextBlock*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		func(Button, Text);
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.Construct
	void Construct() // [0x12295a0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[21]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.BndEvt__HelpButton_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature
	void BndEvt__HelpButton_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.BndEvt__HelpButton_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature
	void BndEvt__HelpButton_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		func();
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.JoinSession
	void JoinSession(FBlueprintSessionResult SessionToJoin) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FBlueprintSessionResult);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[24]);
		func(SessionToJoin);
	}
	// Function /Game/FPS/UI/Menus/AdvancedSessions/WB_JoinServerMenuAS.WB_JoinServerMenuAS_C.ExecuteUbergraph_WB_JoinServerMenuAS
	void ExecuteUbergraph_WB_JoinServerMenuAS(int32_t EntryPoint) // [0x12295a0] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[25]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C
/// Size: 0x0488 (1160 bytes) (0x000260 - 0x000488) align 8 MaxSize: 0x0488
class UWB_CreateMatchMenu_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UHorizontalBox*                              AIDifficultyHB;                                             // 0x0268   (0x0008)  
	class UCheckBox*                                   BotsCheckBox;                                               // 0x0270   (0x0008)  
	class UButton*                                     DecreaseAIDifficulty;                                       // 0x0278   (0x0008)  
	class UTextBlock*                                  Description;                                                // 0x0280   (0x0008)  
	class UHorizontalBox*                              EnableLanHB;                                                // 0x0288   (0x0008)  
	class UImage*                                      Fade;                                                       // 0x0290   (0x0008)  
	class UCheckBox*                                   FriendlyFireCheckBox;                                       // 0x0298   (0x0008)  
	class UHorizontalBox*                              FriendlyFireHB;                                             // 0x02A0   (0x0008)  
	class UImage*                                      GameModeImage;                                              // 0x02A8   (0x0008)  
	class UTextBlock*                                  GameModeName;                                               // 0x02B0   (0x0008)  
	class UButton*                                     IncreaseAIDifficulty;                                       // 0x02B8   (0x0008)  
	class UCheckBox*                                   LANCB;                                                      // 0x02C0   (0x0008)  
	class UButton*                                     LessABots;                                                  // 0x02C8   (0x0008)  
	class UButton*                                     LessBBots;                                                  // 0x02D0   (0x0008)  
	class UButton*                                     LessPlayersButton;                                          // 0x02D8   (0x0008)  
	class UHorizontalBox*                              MaxPlayersHB;                                               // 0x02E0   (0x0008)  
	class UButton*                                     MoreABots;                                                  // 0x02E8   (0x0008)  
	class UButton*                                     MoreBBots;                                                  // 0x02F0   (0x0008)  
	class UButton*                                     MorePlayersButton;                                          // 0x02F8   (0x0008)  
	class UButton*                                     NextMapButton;                                              // 0x0300   (0x0008)  
	class UButton*                                     NextModeButton;                                             // 0x0308   (0x0008)  
	class UButton*                                     PreviousMapButton;                                          // 0x0310   (0x0008)  
	class UButton*                                     PreviousModeButton;                                         // 0x0318   (0x0008)  
	class UHorizontalBox*                              TeamABotsHB;                                                // 0x0320   (0x0008)  
	class UHorizontalBox*                              TeamBBotsHB;                                                // 0x0328   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x0330   (0x0008)  
	class UTextBlock*                                  TextBlock0;                                                 // 0x0338   (0x0008)  
	class UTextBlock*                                  TextBlock1;                                                 // 0x0340   (0x0008)  
	class UTextBlock*                                  TextBlock2;                                                 // 0x0348   (0x0008)  
	class UTextBlock*                                  TextBlock3;                                                 // 0x0350   (0x0008)  
	class UTextBlock*                                  TextBlock4;                                                 // 0x0358   (0x0008)  
	class UTextBlock*                                  TextBlock5;                                                 // 0x0360   (0x0008)  
	class UTextBlock*                                  TextBlock6;                                                 // 0x0368   (0x0008)  
	class UWB_BaseButton_C*                            WB_Return;                                                  // 0x0370   (0x0008)  
	class UWB_BaseButton_C*                            WB_StartGame;                                               // 0x0378   (0x0008)  
	class UWidgetSwitcher*                             WS_Bots;                                                    // 0x0380   (0x0008)  
	int32_t                                            MaxPlayers;                                                 // 0x0388   (0x0004)  
	int32_t                                            MapIndex;                                                   // 0x038C   (0x0004)  
	bool                                               bLAN;                                                       // 0x0390   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0391   (0x0003)  MISSED
	int32_t                                            TeamBBots;                                                  // 0x0394   (0x0004)  
	int32_t                                            TeamABots;                                                  // 0x0398   (0x0004)  
	bool                                               bUseBots;                                                   // 0x039C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x039D   (0x0003)  MISSED
	FLinearColor                                       HoveredColor;                                               // 0x03A0   (0x0010)  
	FLinearColor                                       HoveredTextColor;                                           // 0x03B0   (0x0010)  
	FLinearColor                                       ButtonColor;                                                // 0x03C0   (0x0010)  
	FLinearColor                                       TextColor;                                                  // 0x03D0   (0x0010)  
	int32_t                                            MaxNumberOfBots;                                            // 0x03E0   (0x0004)  
	bool                                               bFriendlyFire;                                              // 0x03E4   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x03E5   (0x0003)  MISSED
	int32_t                                            DifficultyIndex;                                            // 0x03E8   (0x0004)  
	bool                                               bMultiplayer;                                               // 0x03EC   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x03ED   (0x0003)  MISSED
	FMapInfo                                           CurrentGameModeInfo;                                        // 0x03F0   (0x0060)  
	int32_t                                            ModeIndex;                                                  // 0x0450   (0x0004)  
	TEnumAsByte<EGameModeNames>                        SelectedGameMode;                                           // 0x0454   (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x0455   (0x0003)  MISSED
	TArray<FName>                                      ListOfRows;                                                 // 0x0458   (0x0010)  
	int32_t                                            NumberOfMapEntries;                                         // 0x0468   (0x0004)  
	unsigned char                                      UnknownData05_6[0x4];                                       // 0x046C   (0x0004)  MISSED
	FText                                              GameModeFriendlyName;                                       // 0x0470   (0x0018)  


	/// Functions
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.UpdateMapList
	void UpdateMapList() // [0x12295a0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.UpdateGameMode
	FText UpdateGameMode() // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.GetNumberOfBotsSelection
	ESlateVisibility GetNumberOfBotsSelection() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef ESlateVisibility (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.InitOptions
	void InitOptions() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.Get_DecreaseAIDifficulty_bIsEnabled
	bool Get_DecreaseAIDifficulty_bIsEnabled() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.Get_IncreaseAIDifficulty_bIsEnabled
	bool Get_IncreaseAIDifficulty_bIsEnabled() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.GetAIDifficulty
	FText GetAIDifficulty() // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.GetVisibilityNotDM
	ESlateVisibility GetVisibilityNotDM() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef ESlateVisibility (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.GetNumberOfBotsText
	FText GetNumberOfBotsText() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.GetTeamBBots
	FText GetTeamBBots() // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.GetTeamABots
	FText GetTeamABots() // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.GetMapName
	FText GetMapName() // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.GetMaxPlayers
	FText GetMaxPlayers() // [0x12295a0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.GetLessPlayersButtonIsEnabled
	bool GetLessPlayersButtonIsEnabled() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.GetMorePlayersButtonIsEnabled
	bool GetMorePlayersButtonIsEnabled() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.OnFailure_BAC502AF476E13714F8579ACC80D0110
	void OnFailure_BAC502AF476E13714F8579ACC80D0110() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.OnSuccess_BAC502AF476E13714F8579ACC80D0110
	void OnSuccess_BAC502AF476E13714F8579ACC80D0110() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__LessPlayersButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	void BndEvt__LessPlayersButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__MorePlayersButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	void BndEvt__MorePlayersButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__NextMapButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature
	void BndEvt__NextMapButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__PreviusMapButton_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature
	void BndEvt__PreviusMapButton_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.PlaySoundEffect
	void PlaySoundEffect() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[21]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.PlaySoundLow
	void PlaySoundLow() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__LANCB_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__DelegateSignature
	void BndEvt__LANCB_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked) // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		func(bIsChecked);
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__MoreABots_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature
	void BndEvt__MoreABots_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[24]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__MoreBBots_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature
	void BndEvt__MoreBBots_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[25]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__LessBBots_K2Node_ComponentBoundEvent_21_OnButtonClickedEvent__DelegateSignature
	void BndEvt__LessBBots_K2Node_ComponentBoundEvent_21_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[26]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__LessABots_K2Node_ComponentBoundEvent_22_OnButtonClickedEvent__DelegateSignature
	void BndEvt__LessABots_K2Node_ComponentBoundEvent_22_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[27]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__BotsCheckBox_K2Node_ComponentBoundEvent_23_OnCheckBoxComponentStateChanged__DelegateSignature
	void BndEvt__BotsCheckBox_K2Node_ComponentBoundEvent_23_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked) // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[28]);
		func(bIsChecked);
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__FriendlyFireCheckBox_K2Node_ComponentBoundEvent_24_OnCheckBoxComponentStateChanged__DelegateSignature
	void BndEvt__FriendlyFireCheckBox_K2Node_ComponentBoundEvent_24_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked) // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[29]);
		func(bIsChecked);
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.OnButtonHovered
	void OnButtonHovered(UButton* Button, UTextBlock* Text) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UButton*, UTextBlock*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[30]);
		func(Button, Text);
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.OnButtonUnhovered
	void OnButtonUnhovered(UButton* Button, UTextBlock* Text) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UButton*, UTextBlock*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[31]);
		func(Button, Text);
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.CheckNumberOfBots
	void CheckNumberOfBots() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[32]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.Construct
	void Construct() // [0x12295a0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[33]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__DecreaseAIDifficulty_K2Node_ComponentBoundEvent_10_OnButtonReleasedEvent__DelegateSignature
	void BndEvt__DecreaseAIDifficulty_K2Node_ComponentBoundEvent_10_OnButtonReleasedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[34]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__IncreaseAIDifficulty_K2Node_ComponentBoundEvent_11_OnButtonReleasedEvent__DelegateSignature
	void BndEvt__IncreaseAIDifficulty_K2Node_ComponentBoundEvent_11_OnButtonReleasedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[35]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.CreateMatch
	void CreateMatch(bool bMultiplayer, int32_t Players, bool LAN, FName Map) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool, int32_t, bool, FName);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[36]);
		func(bMultiplayer, Players, LAN, Map);
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__WB_CreateMatchMenu_WB_Return_K2Node_ComponentBoundEvent_12_OnReleased__DelegateSignature
	void BndEvt__WB_CreateMatchMenu_WB_Return_K2Node_ComponentBoundEvent_12_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[37]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__WB_CreateMatchMenu_WB_StartGame_K2Node_ComponentBoundEvent_13_OnReleased__DelegateSignature
	void BndEvt__WB_CreateMatchMenu_WB_StartGame_K2Node_ComponentBoundEvent_13_OnReleased__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[38]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.UpdateGameModeInfo
	void UpdateGameModeInfo() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[39]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__WB_CreateMatchMenu_PreviousModeButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__WB_CreateMatchMenu_PreviousModeButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[40]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.BndEvt__WB_CreateMatchMenu_NextModeButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
	void BndEvt__WB_CreateMatchMenu_NextModeButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[41]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_CreateMatchMenu.WB_CreateMatchMenu_C.ExecuteUbergraph_WB_CreateMatchMenu
	void ExecuteUbergraph_WB_CreateMatchMenu(int32_t EntryPoint) // [0x12295a0] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[42]);
		func(EntryPoint);
	}
};

/// Class /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C
/// Size: 0x0454 (1108 bytes) (0x000260 - 0x000454) align 8 MaxSize: 0x0454
class UWB_JoinServerMenu_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UCircularThrobber*                           CircularThrobber;                                           // 0x0268   (0x0008)  
	class UImage*                                      Fade;                                                       // 0x0270   (0x0008)  
	class UButton*                                     HelpButton;                                                 // 0x0278   (0x0008)  
	class UBorder*                                     JoiningServerBorder;                                        // 0x0280   (0x0008)  
	class UButton*                                     JoinServer;                                                 // 0x0288   (0x0008)  
	class UTextBlock*                                  JoinText;                                                   // 0x0290   (0x0008)  
	class UCheckBox*                                   LANCB;                                                      // 0x0298   (0x0008)  
	class UButton*                                     Return;                                                     // 0x02A0   (0x0008)  
	class UTextBlock*                                  ReturnText;                                                 // 0x02A8   (0x0008)  
	class UButton*                                     SearchButton;                                               // 0x02B0   (0x0008)  
	class UTextBlock*                                  SearchText;                                                 // 0x02B8   (0x0008)  
	class UVerticalBox*                                ServerList;                                                 // 0x02C0   (0x0008)  
	class USizeBox*                                    SizeBox;                                                    // 0x02C8   (0x0008)  
	int32_t                                            MaxSeachResults;                                            // 0x02D0   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x02D4   (0x0004)  MISSED
	TArray<FBlueprintSessionResult>                    SessionsFound;                                              // 0x02D8   (0x0010)  
	class UWB_ServerSlot_C*                            WB_ServerSlot;                                              // 0x02E8   (0x0008)  
	FBlueprintSessionResult                            SessionToJoin;                                              // 0x02F0   (0x0108)  
	bool                                               bSearching;                                                 // 0x03F8   (0x0001)  
	bool                                               bLAN;                                                       // 0x03F9   (0x0001)  
	unsigned char                                      UnknownData01_6[0x6];                                       // 0x03FA   (0x0006)  MISSED
	TArray<class UWB_ServerSlot_C*>                    ServerSlots;                                                // 0x0400   (0x0010)  
	FLinearColor                                       HoveredColor;                                               // 0x0410   (0x0010)  
	FLinearColor                                       HoveredTextColor;                                           // 0x0420   (0x0010)  
	FLinearColor                                       ButtonColor;                                                // 0x0430   (0x0010)  
	FLinearColor                                       TextColor;                                                  // 0x0440   (0x0010)  
	float                                              Timeout;                                                    // 0x0450   (0x0004)  


	/// Functions
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.ResetServerSlots
	void ResetServerSlots() // [0x12295a0] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.GetNotSearching
	bool GetNotSearching() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.GetVisivilityIsSearching
	ESlateVisibility GetVisivilityIsSearching() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef ESlateVisibility (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.GetbSessionIsSet
	bool GetbSessionIsSet() // [0x12295a0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.OnFailure_6BA0CF164A37C86CE5618D95145A6EFE
	// void OnFailure_6BA0CF164A37C86CE5618D95145A6EFE(TArray<FBlueprintSessionResult>& Results);                               // [0x12295a0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.OnSuccess_6BA0CF164A37C86CE5618D95145A6EFE
	// void OnSuccess_6BA0CF164A37C86CE5618D95145A6EFE(TArray<FBlueprintSessionResult>& Results);                               // [0x12295a0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.OnFailure_DA2492E34B0F7EC42A78539057DF262D
	void OnFailure_DA2492E34B0F7EC42A78539057DF262D() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.OnSuccess_DA2492E34B0F7EC42A78539057DF262D
	void OnSuccess_DA2492E34B0F7EC42A78539057DF262D() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.OnFailure_0CEF4A5647DD5A8D40EF139B191C5E4D
	void OnFailure_0CEF4A5647DD5A8D40EF139B191C5E4D() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.OnSuccess_0CEF4A5647DD5A8D40EF139B191C5E4D
	void OnSuccess_0CEF4A5647DD5A8D40EF139B191C5E4D() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.BndEvt__HostServer_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__HostServer_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.BndEvt__GoBack_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoBack_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.BndEvt__HostServer_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature
	void BndEvt__HostServer_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.BndEvt__HostServer_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature
	void BndEvt__HostServer_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.BndEvt__GoBack_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature
	void BndEvt__GoBack_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.BndEvt__GoBack_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature
	void BndEvt__GoBack_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.BndEvt__SearchButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__SearchButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.BndEvt__SearchButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__SearchButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature() // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.BndEvt__LANCB_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature
	void BndEvt__LANCB_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked) // [0x12295a0] BlueprintEvent       
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		func(bIsChecked);
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.UnselectServer
	void UnselectServer() // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.OnButtonHovered
	void OnButtonHovered(UButton* Button, UTextBlock* Text) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UButton*, UTextBlock*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[21]);
		func(Button, Text);
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.OnButtonUnhovered
	void OnButtonUnhovered(UButton* Button, UTextBlock* Text) // [0x12295a0] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UButton*, UTextBlock*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		func(Button, Text);
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.Construct
	void Construct() // [0x12295a0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		func();
	}
	// Function /Game/FPS/UI/Menus/WB_JoinServerMenu.WB_JoinServerMenu_C.BndEvt__HelpButton_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature
