
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
#include "BasicType.h"
#include "CoreUObject.h"
#include "DeveloperSettings.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"
#include "OnlineSubsystemUtils.h"

#pragma pack(push, 0x1)

class ASteamCoreGameMode;
class UAppList;
class UApps;
class UFriends;
class UGameServerStats;
class UInput;
class UInventory;
class UMatchmaking;
class UMatchmakingServers;
class UMusic;
class UNetworking;
class UNetworkingUtils;
class UParentalSettings;
class URemotePlay;
class URemoteStorage;
class UScreenshots;
class UServerFilter;
class USteamCore;
class USteamCoreAppsAsyncActionGetFileDetails;
class USteamCoreAsyncAction;
class USteamCoreCreateSession;
class USteamCoreDestroySession;
class USteamCoreFindSession;
class USteamCoreFriendsAsyncActionDownloadClanActivityCounts;
class USteamCoreFriendsAsyncActionEnumerateFollowingList;
class USteamCoreFriendsAsyncActionGetFollowerCount;
class USteamCoreFriendsAsyncActionIsFollowing;
class USteamCoreFriendsAsyncActionJoinClanChatRoom;
class USteamCoreFriendsAsyncActionRequestClanOfficerList;
class USteamCoreFriendsAsyncActionRequestUserInformation;
class USteamCoreFriendsAsyncActionSetPersonaName;
class USteamCoreInventoryAsyncActionRequestEligiblePromoItemDefinitionsIDs;
class USteamCoreInventoryAsyncActionRequestPricesResult;
class USteamCoreInventoryAsyncActionStartPurchaseResult;
class USteamCoreMatchmakingAsyncActionCreateLobby;
class USteamCoreMatchmakingAsyncActionJoinLobby;
class USteamCoreMatchmakingAsyncActionRequestLobbyList;
class USteamCoreMatchmakingServersAsyncActionPingServer;
class USteamCoreMatchmakingServersAsyncActionRequestServerList;
class USteamCoreMatchmakingServersAsyncActionServerRules;
class USteamCoreSettings;
class USteamCoreSteamPartiesAsyncActionChangeNumOpenSlots;
class USteamCoreSteamPartiesAsyncActionCreateBeacon;
class USteamCoreSteamPartiesAsyncActionJoinParty;
class USteamCoreSubsystem;
class USteamCoreUGCAsyncActionAddAppDependency;
class USteamCoreUGCAsyncActionAddItemToFavorites;
class USteamCoreUGCAsyncActionAddUGCDependency;
class USteamCoreUGCAsyncActionCreateItem;
class USteamCoreUGCAsyncActionDeleteItem;
class USteamCoreUGCAsyncActionDownloadItem;
class USteamCoreUGCAsyncActionGetAppDependencies;
class USteamCoreUGCAsyncActionGetUserItemVote;
class USteamCoreUGCAsyncActionRemoveAppDependency;
class USteamCoreUGCAsyncActionRemoveItemFromFavorites;
class USteamCoreUGCAsyncActionRemoveUGCDependency;
class USteamCoreUGCAsyncActionSendQueryUGCRequest;
class USteamCoreUGCAsyncActionSetUserItemVote;
class USteamCoreUGCAsyncActionStartPlaytimeTracking;
class USteamCoreUGCAsyncActionStopPlaytimeTracking;
class USteamCoreUGCAsyncActionStopPlaytimeTrackingForAllItems;
class USteamCoreUGCAsyncActionSubmitItemUpdate;
class USteamCoreUGCAsyncActionSubscribeItem;
class USteamCoreUGCAsyncActionUnsubscribeItem;
class USteamCoreUpdateSession;
class USteamCoreUserAsyncActionRequestEncryptedAppTicket;
class USteamCoreUserAsyncActionRequestStoreAuthURL;
class USteamCoreUserStatsAsyncActionAttachLeaderboardUGC;
class USteamCoreUserStatsAsyncActionDownloadLeaderboardEntries;
class USteamCoreUserStatsAsyncActionDownloadLeaderboardEntriesForUsers;
class USteamCoreUserStatsAsyncActionDownloadRequestGlobalStats;
class USteamCoreUserStatsAsyncActionFindLeaderboard;
class USteamCoreUserStatsAsyncActionFindOrCreateLeaderboard;
class USteamCoreUserStatsAsyncActionGetNumberOfCurrentPlayers;
class USteamCoreUserStatsAsyncActionRequestGlobalAchievementPercentages;
class USteamCoreUserStatsAsyncActionRequestUserStats;
class USteamCoreUserStatsAsyncActionUploadLeaderboardScore;
class USteamCoreVoice;
class USteamGameSearch;
class USteamGameServer;
class USteamParties;
class USteamUtilities;
class UUGC;
class UUser;
class UUserStats;
class UUtils;
class UVideo;

/// Enum /Script/SteamCore.ESteamResult
/// Size: 0x01 (1 bytes)
enum class ESteamResult : uint8_t
{
	ESteamResult__None                                                               = 0,
	ESteamResult__OK                                                                 = 1,
	ESteamResult__Fail                                                               = 2,
	ESteamResult__NoConnection                                                       = 3,
	ESteamResult__sultNoConnectionRetry                                              = 4,
	ESteamResult__InvalidPassword                                                    = 5,
	ESteamResult__LoggedInElsewhere                                                  = 6,
	ESteamResult__InvalidProtocolVer                                                 = 7,
	ESteamResult__InvalidParam                                                       = 8,
	ESteamResult__FileNotFound                                                       = 9,
	ESteamResult__Busy                                                               = 10,
	ESteamResult__InvalidState                                                       = 11,
	ESteamResult__InvalidName                                                        = 12,
	ESteamResult__InvalidEmail                                                       = 13,
	ESteamResult__DuplicateName                                                      = 14,
	ESteamResult__AccessDenied                                                       = 15,
	ESteamResult__Timeout                                                            = 16,
	ESteamResult__Banned                                                             = 17,
	ESteamResult__AccountNotFound                                                    = 18,
	ESteamResult__InvalidSteamID                                                     = 19,
	ESteamResult__ServiceUnavailable                                                 = 20,
	ESteamResult__NotLoggedOn                                                        = 21,
	ESteamResult__Pending                                                            = 22,
	ESteamResult__EncryptionFailure                                                  = 23,
	ESteamResult__InsufficientPrivilege                                              = 24,
	ESteamResult__LimitExceeded                                                      = 25,
	ESteamResult__Revoked                                                            = 26,
	ESteamResult__Expired                                                            = 27,
	ESteamResult__AlreadyRedeemed                                                    = 28,
	ESteamResult__DuplicateRequest                                                   = 29,
	ESteamResult__AlreadyOwned                                                       = 30,
	ESteamResult__IPNotFound                                                         = 31,
	ESteamResult__PersistFailed                                                      = 32,
	ESteamResult__LockingFailed                                                      = 33,
	ESteamResult__LogonSessionReplaced                                               = 34,
	ESteamResult__ConnectFailed                                                      = 35,
	ESteamResult__HandshakeFailed                                                    = 36,
	ESteamResult__IOFailure                                                          = 37,
	ESteamResult__RemoteDisconnect                                                   = 38,
	ESteamResult__ShoppingCartNotFound                                               = 39,
	ESteamResult__Blocked                                                            = 40,
	ESteamResult__Ignored                                                            = 41,
	ESteamResult__NoMatch                                                            = 42,
	ESteamResult__AccountDisabled                                                    = 43,
	ESteamResult__ServiceReadOnly                                                    = 44,
	ESteamResult__AccountNotFeatured                                                 = 45,
	ESteamResult__AdministratorOK                                                    = 46,
	ESteamResult__ContentVersion                                                     = 47,
	ESteamResult__TryAnotherCM                                                       = 48,
	ESteamResult__PasswordRequiredToKickSession                                      = 49,
	ESteamResult__AlreadyLoggedInElsewhere                                           = 50,
	ESteamResult__Suspended                                                          = 51,
	ESteamResult__Cancelled                                                          = 52,
	ESteamResult__DataCorruption                                                     = 53,
	ESteamResult__DiskFull                                                           = 54,
	ESteamResult__RemoteCallFailed                                                   = 55,
	ESteamResult__PasswordUnset                                                      = 56,
	ESteamResult__ExternalAccountUnlinked                                            = 57,
	ESteamResult__PSNTicketInvalid                                                   = 58,
	ESteamResult__ExternalAccountAlreadyLinked                                       = 59,
	ESteamResult__RemoteFileConflict                                                 = 60,
	ESteamResult__IllegalPassword                                                    = 61,
	ESteamResult__SameAsPreviousValue                                                = 62,
	ESteamResult__AccountLogonDenied                                                 = 63,
	ESteamResult__CannotUseOldPassword                                               = 64,
	ESteamResult__InvalidLoginAuthCode                                               = 65,
	ESteamResult__AccountLogonDeniedNoMail                                           = 66,
	ESteamResult__HardwareNotCapableOfIPT                                            = 67,
	ESteamResult__IPTInitError                                                       = 68,
	ESteamResult__ParentalControlRestricted                                          = 69,
	ESteamResult__FacebookQueryError                                                 = 70,
	ESteamResult__ExpiredLoginAuthCode                                               = 71,
	ESteamResult__IPLoginRestrictionFailed                                           = 72,
	ESteamResult__AccountLockedDown                                                  = 73,
	ESteamResult__AccountLogonDeniedVerifiedEmailRequired                            = 74,
	ESteamResult__NoMatchingURL                                                      = 75,
	ESteamResult__BadResponse                                                        = 76,
	ESteamResult__RequirePasswordReEntry                                             = 77,
	ESteamResult__ValueOutOfRange                                                    = 78,
	ESteamResult__UnexpectedError                                                    = 79,
	ESteamResult__Disabled                                                           = 80,
	ESteamResult__InvalidCEGSubmission                                               = 81,
	ESteamResult__RestrictedDevice                                                   = 82,
	ESteamResult__RegionLocked                                                       = 83,
	ESteamResult__RateLimitExceeded                                                  = 84,
	ESteamResult__AccountLoginDeniedNeedTwoFactor                                    = 85,
	ESteamResult__ItemDeleted                                                        = 86,
	ESteamResult__AccountLoginDeniedThrottle                                         = 87,
	ESteamResult__TwoFactorCodeMismatch                                              = 88,
	ESteamResult__TwoFactorActivationCodeMismatch                                    = 89,
	ESteamResult__AccountAssociatedToMultiplePartners                                = 90,
	ESteamResult__NotModified                                                        = 91,
	ESteamResult__NoMobileDevice                                                     = 92,
	ESteamResult__TimeNotSynced                                                      = 93,
	ESteamResult__SmsCodeFailed                                                      = 94,
	ESteamResult__AccountLimitExceeded                                               = 95,
	ESteamResult__AccountActivityLimitExceeded                                       = 96,
	ESteamResult__PhoneActivityLimitExceeded                                         = 97,
	ESteamResult__RefundToWallet                                                     = 98,
	ESteamResult__EmailSendFailure                                                   = 99,
	ESteamResult__NotSettled                                                         = 100,
	ESteamResult__NeedCaptcha                                                        = 101,
	ESteamResult__GSLTDenied                                                         = 102,
	ESteamResult__GSOwnerDenied                                                      = 103,
	ESteamResult__InvalidItemType                                                    = 104,
	ESteamResult__IPBanned                                                           = 105,
	ESteamResult__GSLTExpired                                                        = 106,
	ESteamResult__InsufficientFunds                                                  = 107,
	ESteamResult__TooManyPending                                                     = 108,
	ESteamResult__NoSiteLicensesFound                                                = 109,
	ESteamResult__WGNetworkSendExceeded                                              = 110,
	ESteamResult__AccountNotFriends                                                  = 111,
	ESteamResult__LimitedUserAccount                                                 = 112,
	ESteamResult__CantRemoveItem                                                     = 113
};

/// Enum /Script/SteamCore.ESteamMessageType
/// Size: 0x01 (1 bytes)
enum class ESteamMessageType : uint8_t
{
	ESteamMessageType__ENotification                                                 = 0,
	ESteamMessageType__EMessage                                                      = 1,
	ESteamMessageType__EWarning                                                      = 2
};

/// Enum /Script/SteamCore.ESteamPersonaChange
/// Size: 0x01 (1 bytes)
enum class ESteamPersonaChange : uint8_t
{
	ESteamPersonaChange__Name                                                        = 0,
	ESteamPersonaChange__Status                                                      = 1,
	ESteamPersonaChange__ComeOnline                                                  = 2,
	ESteamPersonaChange__GoneOffline                                                 = 3,
	ESteamPersonaChange__GamePlayed                                                  = 4,
	ESteamPersonaChange__GameServer                                                  = 5,
	ESteamPersonaChange__Avatar                                                      = 6,
	ESteamPersonaChange__JoinedSource                                                = 7,
	ESteamPersonaChange__LeftSource                                                  = 8,
	ESteamPersonaChange__RelationshipChanged                                         = 9,
	ESteamPersonaChange__NameFirstSet                                                = 10,
	ESteamPersonaChange__FacebookInfo                                                = 11,
	ESteamPersonaChange__Nickname                                                    = 12,
	ESteamPersonaChange__SteamLevel                                                  = 13
};

/// Enum /Script/SteamCore.ESteamChatRoomEnterResponse
/// Size: 0x01 (1 bytes)
enum class ESteamChatRoomEnterResponse : uint8_t
{
	ESteamChatRoomEnterResponse__None                                                = 0,
	ESteamChatRoomEnterResponse__Success                                             = 1,
	ESteamChatRoomEnterResponse__DoesntExist                                         = 2,
	ESteamChatRoomEnterResponse__NotAllowed                                          = 3,
	ESteamChatRoomEnterResponse__Full                                                = 4,
	ESteamChatRoomEnterResponse__Error                                               = 5,
	ESteamChatRoomEnterResponse__Banned                                              = 6,
	ESteamChatRoomEnterResponse__Limited                                             = 7,
	ESteamChatRoomEnterResponse__ClanDisabled                                        = 8,
	ESteamChatRoomEnterResponse__CommunityBan                                        = 9,
	ESteamChatRoomEnterResponse__MemberBlockedYou                                    = 10,
	ESteamChatRoomEnterResponse__YouBlockedMember                                    = 11,
	ESteamChatRoomEnterResponse__RatelimitExceeded                                   = 15
};

/// Enum /Script/SteamCore.ESteamPlayerAcceptState
/// Size: 0x01 (1 bytes)
enum class ESteamPlayerAcceptState : uint8_t
{
	ESteamPlayerAcceptState__Unknown                                                 = 0,
	ESteamPlayerAcceptState__PlayerAccepted                                          = 1,
	ESteamPlayerAcceptState__PlayerDeclined                                          = 2
};

/// Enum /Script/SteamCore.ESteamAuthSessionResponse
/// Size: 0x01 (1 bytes)
enum class ESteamAuthSessionResponse : uint8_t
{
	ESteamAuthSessionResponse__OK                                                    = 0,
	ESteamAuthSessionResponse__UserNotConnectedToSteam                               = 1,
	ESteamAuthSessionResponse__NoLicenseOrExpired                                    = 2,
	ESteamAuthSessionResponse__VACBanned                                             = 3,
	ESteamAuthSessionResponse__LoggedInElseWhere                                     = 4,
	ESteamAuthSessionResponse__VACCheckTimedOut                                      = 5,
	ESteamAuthSessionResponse__AuthTicketCanceled                                    = 6,
	ESteamAuthSessionResponse__AuthTicketInvalidAlreadyUsed                          = 7,
	ESteamAuthSessionResponse__AuthTicketInvalid                                     = 8,
	ESteamAuthSessionResponse__PublisherIssuedBan                                    = 9
};

/// Enum /Script/SteamCore.ESteamDenyReason
/// Size: 0x01 (1 bytes)
enum class ESteamDenyReason : uint8_t
{
	ESteamDenyReason__Invalid                                                        = 0,
	ESteamDenyReason__InvalidVersion                                                 = 1,
	ESteamDenyReason__Generic                                                        = 2,
	ESteamDenyReason__NotLoggedOn                                                    = 3,
	ESteamDenyReason__NoLicense                                                      = 4,
	ESteamDenyReason__Cheater                                                        = 5,
	ESteamDenyReason__LoggedInElseWhere                                              = 6,
	ESteamDenyReason__UnknownText                                                    = 7,
	ESteamDenyReason__IncompatibleAnticheat                                          = 8,
	ESteamDenyReason__MemoryCorruption                                               = 9,
	ESteamDenyReason__IncompatibleSoftware                                           = 10,
	ESteamDenyReason__SteamConnectionLost                                            = 11,
	ESteamDenyReason__SteamConnectionError                                           = 12,
	ESteamDenyReason__SteamResponseTimedOut                                          = 13,
	ESteamDenyReason__SteamValidationStalled                                         = 14,
	ESteamDenyReason__SteamOwnerLeftGuestUser                                        = 15
};

/// Enum /Script/SteamCore.ESteamFavoriteFlags
/// Size: 0x01 (1 bytes)
enum class ESteamFavoriteFlags : uint8_t
{
	ESteamFavoriteFlags__None                                                        = 0,
	ESteamFavoriteFlags__Favorite                                                    = 1,
	ESteamFavoriteFlags__History                                                     = 2
};

/// Enum /Script/SteamCore.ESteamChatEntryType
/// Size: 0x01 (1 bytes)
enum class ESteamChatEntryType : uint8_t
{
	ESteamChatEntryType__Invalid                                                     = 0,
	ESteamChatEntryType__ChatMsg                                                     = 1,
	ESteamChatEntryType__Typing                                                      = 2,
	ESteamChatEntryType__InviteGame                                                  = 3,
	ESteamChatEntryType__Emote                                                       = 4,
	ESteamChatEntryType__LeftConversation                                            = 6,
	ESteamChatEntryType__Entered                                                     = 7,
	ESteamChatEntryType__WasKicked                                                   = 8,
	ESteamChatEntryType__WasBanned                                                   = 9,
	ESteamChatEntryType__Disconnected                                                = 10,
	ESteamChatEntryType__HistoricalChat                                              = 11,
	ESteamChatEntryType__LinkBlocked                                                 = 14
};

/// Enum /Script/SteamCore.ESteamChatMemberStateChange
/// Size: 0x01 (1 bytes)
enum class ESteamChatMemberStateChange : uint8_t
{
	ESteamChatMemberStateChange__None                                                = 0,
	ESteamChatMemberStateChange__Entered                                             = 1,
	ESteamChatMemberStateChange__Left                                                = 2,
	ESteamChatMemberStateChange__Disconnected                                        = 4,
	ESteamChatMemberStateChange__Kicked                                              = 8,
	ESteamChatMemberStateChange__Banned                                              = 16
};

/// Enum /Script/SteamCore.ESteamP2PSessionError
/// Size: 0x01 (1 bytes)
enum class ESteamP2PSessionError : uint8_t
{
	ESteamP2PSessionError__None                                                      = 0,
	ESteamP2PSessionError__NotRunningApp                                             = 1,
	ESteamP2PSessionError__NoRightsToApp                                             = 2,
	ESteamP2PSessionError__DestinationNotLoggedIn                                    = 3,
	ESteamP2PSessionError__Timeout                                                   = 4,
	ESteamP2PSessionError__Max                                                       = 5
};

/// Enum /Script/SteamCore.ESteamFailureType
/// Size: 0x01 (1 bytes)
enum class ESteamFailureType : uint8_t
{
	ESteamFailureType__FlushedCallbackQueue                                          = 0,
	ESteamFailureType__PipeFail                                                      = 1
};

/// Enum /Script/SteamCore.ESteamCheckFileSignature
/// Size: 0x01 (1 bytes)
enum class ESteamCheckFileSignature : uint8_t
{
	ESteamCheckFileSignature__InvalidSignature                                       = 0,
	ESteamCheckFileSignature__ValidSignature                                         = 1,
	ESteamCheckFileSignature__FileNotFound                                           = 2,
	ESteamCheckFileSignature__NoSignaturesFoundForThisApp                            = 3,
	ESteamCheckFileSignature__NoSignaturesFoundForThisFile                           = 4
};

/// Enum /Script/SteamCore.ESteamSubsystem
/// Size: 0x01 (1 bytes)
enum class ESteamSubsystem : uint8_t
{
	ESteamSubsystem__SteamCore                                                       = 0,
	ESteamSubsystem__AppList                                                         = 1,
	ESteamSubsystem__Apps                                                            = 2,
	ESteamSubsystem__Friends                                                         = 3,
	ESteamSubsystem__GameServer                                                      = 4,
	ESteamSubsystem__GameServerStats                                                 = 5,
	ESteamSubsystem__Inventory                                                       = 6,
	ESteamSubsystem__Input                                                           = 7,
	ESteamSubsystem__Matchmaking                                                     = 8,
	ESteamSubsystem__MatchmakingServers                                              = 9,
	ESteamSubsystem__Music                                                           = 10,
	ESteamSubsystem__Networking                                                      = 11,
	ESteamSubsystem__NetworkingUtils                                                 = 12,
	ESteamSubsystem__ParentalSettings                                                = 13,
	ESteamSubsystem__RemoteStorage                                                   = 14,
	ESteamSubsystem__RemotePlay                                                      = 15,
	ESteamSubsystem__Screenshots                                                     = 16,
	ESteamSubsystem__UGC                                                             = 17,
	ESteamSubsystem__User                                                            = 18,
	ESteamSubsystem__UserStats                                                       = 19,
	ESteamSubsystem__Utils                                                           = 20,
	ESteamSubsystem__Video                                                           = 21,
	ESteamSubsystem__SteamParties                                                    = 22,
	ESteamSubsystem__GameSearch                                                      = 23
};

/// Enum /Script/SteamCore.ESteamOverlayToStoreFlag
/// Size: 0x01 (1 bytes)
enum class ESteamOverlayToStoreFlag : uint8_t
{
	ESteamOverlayToStoreFlag__None                                                   = 0,
	ESteamOverlayToStoreFlag__AddToCart                                              = 1,
	ESteamOverlayToStoreFlag__AddToCartAndShow                                       = 2
};

/// Enum /Script/SteamCore.ESteamUserRestriction
/// Size: 0x01 (1 bytes)
enum class ESteamUserRestriction : uint8_t
{
	ESteamUserRestriction__None                                                      = 0,
	ESteamUserRestriction__Unknown                                                   = 1,
	ESteamUserRestriction__AnyChat                                                   = 2,
	ESteamUserRestriction__VoiceChat                                                 = 4,
	ESteamUserRestriction__GroupChat                                                 = 8,
	ESteamUserRestriction__Rating                                                    = 16,
	ESteamUserRestriction__GameInvites                                               = 32,
	ESteamUserRestriction__Trading                                                   = 64
};

/// Enum /Script/SteamCore.ESteamFriendFlags
/// Size: 0x01 (1 bytes)
enum class ESteamFriendFlags : uint8_t
{
	ESteamFriendFlags__None                                                          = 0,
	ESteamFriendFlags__Blocked                                                       = 1,
	ESteamFriendFlags__FriendshipRequested                                           = 2,
	ESteamFriendFlags__Immediate                                                     = 3,
	ESteamFriendFlags__ClanMember                                                    = 4,
	ESteamFriendFlags__OnGameServer                                                  = 5,
	ESteamFriendFlags__RequestingFriendship                                          = 6,
	ESteamFriendFlags__RequestingInfo                                                = 7,
	ESteamFriendFlags__Ignored                                                       = 8,
	ESteamFriendFlags__IgnoredFriend                                                 = 9,
	ESteamFriendFlags__ChatMember                                                    = 10,
	ESteamFriendFlags__All                                                           = 11
};

/// Enum /Script/SteamCore.ESteamPersonaState
/// Size: 0x01 (1 bytes)
enum class ESteamPersonaState : uint8_t
{
	ESteamPersonaState__Offline                                                      = 0,
	ESteamPersonaState__Online                                                       = 1,
	ESteamPersonaState__Busy                                                         = 2,
	ESteamPersonaState__Away                                                         = 3,
	ESteamPersonaState__Snooze                                                       = 4,
	ESteamPersonaState__LookingToTrade                                               = 5,
	ESteamPersonaState__LookingToPlay                                                = 6,
	ESteamPersonaState__Max                                                          = 7
};

/// Enum /Script/SteamCore.ESteamFriendRelationship
/// Size: 0x01 (1 bytes)
enum class ESteamFriendRelationship : uint8_t
{
	ESteamFriendRelationship__None                                                   = 0,
	ESteamFriendRelationship__Blocked                                                = 1,
	ESteamFriendRelationship__RequestRecipient                                       = 2,
	ESteamFriendRelationship__Friend                                                 = 3,
	ESteamFriendRelationship__RequestInitiator                                       = 4,
	ESteamFriendRelationship__Ignored                                                = 5,
	ESteamFriendRelationship__IgnoredFriend                                          = 6,
	ESteamFriendRelationship__Suggested_DEPRECATED                                   = 7,
	ESteamFriendRelationship__Max                                                    = 8
};

/// Enum /Script/SteamCore.ESteamActivateGameOverlayToWebPageMode
/// Size: 0x01 (1 bytes)
enum class ESteamActivateGameOverlayToWebPageMode : uint8_t
{
	ESteamActivateGameOverlayToWebPageMode__Default                                  = 0,
	ESteamActivateGameOverlayToWebPageMode__Modal                                    = 1
};

/// Enum /Script/SteamCore.ESteamPlayerResult
/// Size: 0x01 (1 bytes)
enum class ESteamPlayerResult : uint8_t
{
	ESteamPlayerResult__Invalid                                                      = 0,
	ESteamPlayerResult__FailedToConnect                                              = 1,
	ESteamPlayerResult__Abandoned                                                    = 2,
	ESteamPlayerResult__Kicked                                                       = 3,
	ESteamPlayerResult__Incomplete                                                   = 4,
	ESteamPlayerResult__Completed                                                    = 5
};

/// Enum /Script/SteamCore.ESteamGameSearchErrorCode
/// Size: 0x01 (1 bytes)
enum class ESteamGameSearchErrorCode : uint8_t
{
	ESteamGameSearchErrorCode__Invalid                                               = 0,
	ESteamGameSearchErrorCode__OK                                                    = 1,
	ESteamGameSearchErrorCode__Failed_Search_Already_In_Progress                     = 2,
	ESteamGameSearchErrorCode__Failed_No_Search_In_Progress                          = 3,
	ESteamGameSearchErrorCode__Failed_Not_Lobby_Leader                               = 4,
	ESteamGameSearchErrorCode__Failed_No_Host_Available                              = 5,
	ESteamGameSearchErrorCode__Failed_Search_Params_Invalid                          = 6,
	ESteamGameSearchErrorCode__Failed_Offline                                        = 7,
	ESteamGameSearchErrorCode__Failed_NotAuthorized                                  = 8,
	ESteamGameSearchErrorCode__Failed_Unknown_Error                                  = 9
};

/// Enum /Script/SteamCore.ESteamCoreInputLEDFlag
/// Size: 0x01 (1 bytes)
enum class ESteamCoreInputLEDFlag : uint8_t
{
	ESteamCoreInputLEDFlag__SetColor                                                 = 0,
	ESteamCoreInputLEDFlag__RestoreUserDefault                                       = 1
};

/// Enum /Script/SteamCore.ESteamCoreInputType
/// Size: 0x01 (1 bytes)
enum class ESteamCoreInputType : uint8_t
{
	ESteamCoreInputType__Unknown                                                     = 0,
	ESteamCoreInputType__SteamController                                             = 1,
	ESteamCoreInputType__XBox360Controller                                           = 2,
	ESteamCoreInputType__XBoxOneController                                           = 3,
	ESteamCoreInputType__GenericGamepad                                              = 4,
	ESteamCoreInputType__PS4Controller                                               = 5,
	ESteamCoreInputType__AppleMFiController                                          = 6,
	ESteamCoreInputType__AndroidController                                           = 7,
	ESteamCoreInputType__SwitchJoyConPair                                            = 8,
	ESteamCoreInputType__SwitchJoyConSingle                                          = 9,
	ESteamCoreInputType__SwitchProController                                         = 10,
	ESteamCoreInputType__MobileTouch                                                 = 11,
	ESteamCoreInputType__PS3Controller                                               = 12,
	ESteamCoreInputType__Count                                                       = 13,
	ESteamCoreInputType__MaximumPossibleValue                                        = 255
};

/// Enum /Script/SteamCore.ESteamCoreControllerPad
/// Size: 0x01 (1 bytes)
enum class ESteamCoreControllerPad : uint8_t
{
	ESteamCoreControllerPad__Left                                                    = 0,
	ESteamCoreControllerPad__Right                                                   = 1
};

/// Enum /Script/SteamCore.ESteamCoreXboxOrigin
/// Size: 0x01 (1 bytes)
enum class ESteamCoreXboxOrigin : uint8_t
{
	ESteamCoreXboxOrigin__A                                                          = 0,
	ESteamCoreXboxOrigin__B                                                          = 1,
	ESteamCoreXboxOrigin__X                                                          = 2,
	ESteamCoreXboxOrigin__Y                                                          = 3,
	ESteamCoreXboxOrigin__LeftBumper                                                 = 4,
	ESteamCoreXboxOrigin__RightBumper                                                = 5,
	ESteamCoreXboxOrigin__Menu                                                       = 6,
	ESteamCoreXboxOrigin__View                                                       = 7,
	ESteamCoreXboxOrigin__LeftTrigger_Pull                                           = 8,
	ESteamCoreXboxOrigin__LeftTrigger_Click                                          = 9,
	ESteamCoreXboxOrigin__RightTrigger_Pull                                          = 10,
	ESteamCoreXboxOrigin__RightTrigger_Click                                         = 11,
	ESteamCoreXboxOrigin__LeftStick_Move                                             = 12,
	ESteamCoreXboxOrigin__LeftStick_Click                                            = 13,
	ESteamCoreXboxOrigin__LeftStick_DPadNorth                                        = 14,
	ESteamCoreXboxOrigin__LeftStick_DPadSouth                                        = 15,
	ESteamCoreXboxOrigin__LeftStick_DPadWest                                         = 16,
	ESteamCoreXboxOrigin__LeftStick_DPadEast                                         = 17,
	ESteamCoreXboxOrigin__RightStick_Move                                            = 18,
	ESteamCoreXboxOrigin__RightStick_Click                                           = 19,
	ESteamCoreXboxOrigin__RightStick_DPadNorth                                       = 20,
	ESteamCoreXboxOrigin__RightStick_DPadSouth                                       = 21,
	ESteamCoreXboxOrigin__RightStick_DPadWest                                        = 22,
	ESteamCoreXboxOrigin__RightStick_DPadEast                                        = 23,
	ESteamCoreXboxOrigin__DPad_North                                                 = 24,
	ESteamCoreXboxOrigin__DPad_South                                                 = 25,
	ESteamCoreXboxOrigin__DPad_West                                                  = 26,
	ESteamCoreXboxOrigin__DPad_East                                                  = 27,
	ESteamCoreXboxOrigin__Count                                                      = 28
};

/// Enum /Script/SteamCore.ESteamCoreInputActionOrigin
/// Size: 0x01 (1 bytes)
enum class ESteamCoreInputActionOrigin : uint8_t
{
	ESteamCoreInputActionOrigin__None                                                = 0,
	ESteamCoreInputActionOrigin__SteamController_A                                   = 1,
	ESteamCoreInputActionOrigin__SteamController_B                                   = 2,
	ESteamCoreInputActionOrigin__SteamController_X                                   = 3,
	ESteamCoreInputActionOrigin__SteamController_Y                                   = 4,
	ESteamCoreInputActionOrigin__SteamController_LeftBumper                          = 5,
	ESteamCoreInputActionOrigin__SteamController_RightBumper                         = 6,
	ESteamCoreInputActionOrigin__SteamController_LeftGrip                            = 7,
	ESteamCoreInputActionOrigin__SteamController_RightGrip                           = 8,
	ESteamCoreInputActionOrigin__SteamController_Start                               = 9,
	ESteamCoreInputActionOrigin__SteamController_Back                                = 10,
	ESteamCoreInputActionOrigin__SteamController_LeftPad_Touch                       = 11,
	ESteamCoreInputActionOrigin__SteamController_LeftPad_Swipe                       = 12,
	ESteamCoreInputActionOrigin__SteamController_LeftPad_Click                       = 13,
	ESteamCoreInputActionOrigin__SteamController_LeftPad_DPadNorth                   = 14,
	ESteamCoreInputActionOrigin__SteamController_LeftPad_DPadSouth                   = 15,
	ESteamCoreInputActionOrigin__SteamController_LeftPad_DPadWest                    = 16,
	ESteamCoreInputActionOrigin__SteamController_LeftPad_DPadEast                    = 17,
	ESteamCoreInputActionOrigin__SteamController_RightPad_Touch                      = 18,
	ESteamCoreInputActionOrigin__SteamController_RightPad_Swipe                      = 19,
	ESteamCoreInputActionOrigin__SteamController_RightPad_Click                      = 20,
	ESteamCoreInputActionOrigin__SteamController_RightPad_DPadNorth                  = 21,
	ESteamCoreInputActionOrigin__SteamController_RightPad_DPadSouth                  = 22,
	ESteamCoreInputActionOrigin__SteamController_RightPad_DPadWest                   = 23,
	ESteamCoreInputActionOrigin__SteamController_RightPad_DPadEast                   = 24,
	ESteamCoreInputActionOrigin__SteamController_LeftTrigger_Pull                    = 25,
	ESteamCoreInputActionOrigin__SteamController_LeftTrigger_Click                   = 26,
	ESteamCoreInputActionOrigin__SteamController_RightTrigger_Pull                   = 27,
	ESteamCoreInputActionOrigin__SteamController_RightTrigger_Click                  = 28,
	ESteamCoreInputActionOrigin__SteamController_LeftStick_Move                      = 29,
	ESteamCoreInputActionOrigin__SteamController_LeftStick_Click                     = 30,
	ESteamCoreInputActionOrigin__SteamController_LeftStick_DPadNorth                 = 31,
	ESteamCoreInputActionOrigin__SteamController_LeftStick_DPadSouth                 = 32,
	ESteamCoreInputActionOrigin__SteamController_LeftStick_DPadWest                  = 33,
	ESteamCoreInputActionOrigin__SteamController_LeftStick_DPadEast                  = 34,
	ESteamCoreInputActionOrigin__SteamController_Gyro_Move                           = 35,
	ESteamCoreInputActionOrigin__SteamController_Gyro_Pitch                          = 36,
	ESteamCoreInputActionOrigin__SteamController_Gyro_Yaw                            = 37,
	ESteamCoreInputActionOrigin__SteamController_Gyro_Roll                           = 38,
	ESteamCoreInputActionOrigin__SteamController_Reserved0                           = 39,
	ESteamCoreInputActionOrigin__SteamController_Reserved1                           = 40,
	ESteamCoreInputActionOrigin__SteamController_Reserved2                           = 41,
	ESteamCoreInputActionOrigin__SteamController_Reserved3                           = 42,
	ESteamCoreInputActionOrigin__SteamController_Reserved4                           = 43,
	ESteamCoreInputActionOrigin__SteamController_Reserved5                           = 44,
	ESteamCoreInputActionOrigin__SteamController_Reserved6                           = 45,
	ESteamCoreInputActionOrigin__SteamController_Reserved7                           = 46,
	ESteamCoreInputActionOrigin__SteamController_Reserved8                           = 47,
	ESteamCoreInputActionOrigin__SteamController_Reserved9                           = 48,
	ESteamCoreInputActionOrigin__SteamController_Reserved10                          = 49,
	ESteamCoreInputActionOrigin__PS4_X                                               = 50,
	ESteamCoreInputActionOrigin__PS4_Circle                                          = 51,
	ESteamCoreInputActionOrigin__PS4_Triangle                                        = 52,
	ESteamCoreInputActionOrigin__PS4_Square                                          = 53,
	ESteamCoreInputActionOrigin__PS4_LeftBumper                                      = 54,
	ESteamCoreInputActionOrigin__PS4_RightBumper                                     = 55,
	ESteamCoreInputActionOrigin__PS4_Options                                         = 56,
	ESteamCoreInputActionOrigin__PS4_Share                                           = 57,
	ESteamCoreInputActionOrigin__PS4_LeftPad_Touch                                   = 58,
	ESteamCoreInputActionOrigin__PS4_LeftPad_Swipe                                   = 59,
	ESteamCoreInputActionOrigin__PS4_LeftPad_Click                                   = 60,
	ESteamCoreInputActionOrigin__PS4_LeftPad_DPadNorth                               = 61,
	ESteamCoreInputActionOrigin__PS4_LeftPad_DPadSouth                               = 62,
	ESteamCoreInputActionOrigin__PS4_LeftPad_DPadWest                                = 63,
	ESteamCoreInputActionOrigin__PS4_LeftPad_DPadEast                                = 64,
	ESteamCoreInputActionOrigin__PS4_RightPad_Touch                                  = 65,
	ESteamCoreInputActionOrigin__PS4_RightPad_Swipe                                  = 66,
	ESteamCoreInputActionOrigin__PS4_RightPad_Click                                  = 67,
	ESteamCoreInputActionOrigin__PS4_RightPad_DPadNorth                              = 68,
	ESteamCoreInputActionOrigin__PS4_RightPad_DPadSouth                              = 69,
	ESteamCoreInputActionOrigin__PS4_RightPad_DPadWest                               = 70,
	ESteamCoreInputActionOrigin__PS4_RightPad_DPadEast                               = 71,
	ESteamCoreInputActionOrigin__PS4_CenterPad_Touch                                 = 72,
	ESteamCoreInputActionOrigin__PS4_CenterPad_Swipe                                 = 73,
	ESteamCoreInputActionOrigin__PS4_CenterPad_Click                                 = 74,
	ESteamCoreInputActionOrigin__PS4_CenterPad_DPadNorth                             = 75,
	ESteamCoreInputActionOrigin__PS4_CenterPad_DPadSouth                             = 76,
	ESteamCoreInputActionOrigin__PS4_CenterPad_DPadWest                              = 77,
	ESteamCoreInputActionOrigin__PS4_CenterPad_DPadEast                              = 78,
	ESteamCoreInputActionOrigin__PS4_LeftTrigger_Pull                                = 79,
	ESteamCoreInputActionOrigin__PS4_LeftTrigger_Click                               = 80,
	ESteamCoreInputActionOrigin__PS4_RightTrigger_Pull                               = 81,
	ESteamCoreInputActionOrigin__PS4_RightTrigger_Click                              = 82,
	ESteamCoreInputActionOrigin__PS4_LeftStick_Move                                  = 83,
	ESteamCoreInputActionOrigin__PS4_LeftStick_Click                                 = 84,
	ESteamCoreInputActionOrigin__PS4_LeftStick_DPadNorth                             = 85,
	ESteamCoreInputActionOrigin__PS4_LeftStick_DPadSouth                             = 86,
	ESteamCoreInputActionOrigin__PS4_LeftStick_DPadWest                              = 87,
	ESteamCoreInputActionOrigin__PS4_LeftStick_DPadEast                              = 88,
	ESteamCoreInputActionOrigin__PS4_RightStick_Move                                 = 89,
	ESteamCoreInputActionOrigin__PS4_RightStick_Click                                = 90,
	ESteamCoreInputActionOrigin__PS4_RightStick_DPadNorth                            = 91,
	ESteamCoreInputActionOrigin__PS4_RightStick_DPadSouth                            = 92,
	ESteamCoreInputActionOrigin__PS4_RightStick_DPadWest                             = 93,
	ESteamCoreInputActionOrigin__PS4_RightStick_DPadEast                             = 94,
	ESteamCoreInputActionOrigin__PS4_DPad_North                                      = 95,
	ESteamCoreInputActionOrigin__PS4_DPad_South                                      = 96,
	ESteamCoreInputActionOrigin__PS4_DPad_West                                       = 97,
	ESteamCoreInputActionOrigin__PS4_DPad_East                                       = 98,
	ESteamCoreInputActionOrigin__PS4_Gyro_Move                                       = 99,
	ESteamCoreInputActionOrigin__PS4_Gyro_Pitch                                      = 100,
	ESteamCoreInputActionOrigin__PS4_Gyro_Yaw                                        = 101,
	ESteamCoreInputActionOrigin__PS4_Gyro_Roll                                       = 102,
	ESteamCoreInputActionOrigin__PS4_DPad_Move                                       = 103,
	ESteamCoreInputActionOrigin__PS4_Reserved1                                       = 104,
	ESteamCoreInputActionOrigin__PS4_Reserved2                                       = 105,
	ESteamCoreInputActionOrigin__PS4_Reserved3                                       = 106,
	ESteamCoreInputActionOrigin__PS4_Reserved4                                       = 107,
	ESteamCoreInputActionOrigin__PS4_Reserved5                                       = 108,
	ESteamCoreInputActionOrigin__PS4_Reserved6                                       = 109,
	ESteamCoreInputActionOrigin__PS4_Reserved7                                       = 110,
	ESteamCoreInputActionOrigin__PS4_Reserved8                                       = 111,
	ESteamCoreInputActionOrigin__PS4_Reserved9                                       = 112,
	ESteamCoreInputActionOrigin__PS4_Reserved10                                      = 113,
	ESteamCoreInputActionOrigin__XBoxOne_A                                           = 114,
	ESteamCoreInputActionOrigin__XBoxOne_B                                           = 115,
	ESteamCoreInputActionOrigin__XBoxOne_X                                           = 116,
	ESteamCoreInputActionOrigin__XBoxOne_Y                                           = 117,
	ESteamCoreInputActionOrigin__XBoxOne_LeftBumper                                  = 118,
	ESteamCoreInputActionOrigin__XBoxOne_RightBumper                                 = 119,
	ESteamCoreInputActionOrigin__XBoxOne_Menu                                        = 120,
	ESteamCoreInputActionOrigin__XBoxOne_View                                        = 121,
	ESteamCoreInputActionOrigin__XBoxOne_LeftTrigger_Pull                            = 122,
	ESteamCoreInputActionOrigin__XBoxOne_LeftTrigger_Click                           = 123,
	ESteamCoreInputActionOrigin__XBoxOne_RightTrigger_Pull                           = 124,
	ESteamCoreInputActionOrigin__XBoxOne_RightTrigger_Click                          = 125,
	ESteamCoreInputActionOrigin__XBoxOne_LeftStick_Move                              = 126,
	ESteamCoreInputActionOrigin__XBoxOne_LeftStick_Click                             = 127,
	ESteamCoreInputActionOrigin__XBoxOne_LeftStick_DPadNorth                         = 128,
	ESteamCoreInputActionOrigin__XBoxOne_LeftStick_DPadSouth                         = 129,
	ESteamCoreInputActionOrigin__XBoxOne_LeftStick_DPadWest                          = 130,
	ESteamCoreInputActionOrigin__XBoxOne_LeftStick_DPadEast                          = 131,
	ESteamCoreInputActionOrigin__XBoxOne_RightStick_Move                             = 132,
	ESteamCoreInputActionOrigin__XBoxOne_RightStick_Click                            = 133,
	ESteamCoreInputActionOrigin__XBoxOne_RightStick_DPadNorth                        = 134,
	ESteamCoreInputActionOrigin__XBoxOne_RightStick_DPadSouth                        = 135,
	ESteamCoreInputActionOrigin__XBoxOne_RightStick_DPadWest                         = 136,
	ESteamCoreInputActionOrigin__XBoxOne_RightStick_DPadEast                         = 137,
	ESteamCoreInputActionOrigin__XBoxOne_DPad_North                                  = 138,
	ESteamCoreInputActionOrigin__XBoxOne_DPad_South                                  = 139,
	ESteamCoreInputActionOrigin__XBoxOne_DPad_West                                   = 140,
	ESteamCoreInputActionOrigin__XBoxOne_DPad_East                                   = 141,
	ESteamCoreInputActionOrigin__XBoxOne_DPad_Move                                   = 142,
	ESteamCoreInputActionOrigin__XBoxOne_Reserved1                                   = 143,
	ESteamCoreInputActionOrigin__XBoxOne_Reserved2                                   = 144,
	ESteamCoreInputActionOrigin__XBoxOne_Reserved3                                   = 145,
	ESteamCoreInputActionOrigin__XBoxOne_Reserved4                                   = 146,
	ESteamCoreInputActionOrigin__XBoxOne_Reserved5                                   = 147,
	ESteamCoreInputActionOrigin__XBoxOne_Reserved6                                   = 148,
	ESteamCoreInputActionOrigin__XBoxOne_Reserved7                                   = 149,
	ESteamCoreInputActionOrigin__XBoxOne_Reserved8                                   = 150,
	ESteamCoreInputActionOrigin__XBoxOne_Reserved9                                   = 151,
	ESteamCoreInputActionOrigin__XBoxOne_Reserved10                                  = 152,
	ESteamCoreInputActionOrigin__XBox360_A                                           = 153,
	ESteamCoreInputActionOrigin__XBox360_B                                           = 154,
	ESteamCoreInputActionOrigin__XBox360_X                                           = 155,
	ESteamCoreInputActionOrigin__XBox360_Y                                           = 156,
	ESteamCoreInputActionOrigin__XBox360_LeftBumper                                  = 157,
	ESteamCoreInputActionOrigin__XBox360_RightBumper                                 = 158,
	ESteamCoreInputActionOrigin__XBox360_Start                                       = 159,
	ESteamCoreInputActionOrigin__XBox360_Back                                        = 160,
	ESteamCoreInputActionOrigin__XBox360_LeftTrigger_Pull                            = 161,
	ESteamCoreInputActionOrigin__XBox360_LeftTrigger_Click                           = 162,
	ESteamCoreInputActionOrigin__XBox360_RightTrigger_Pull                           = 163,
	ESteamCoreInputActionOrigin__XBox360_RightTrigger_Click                          = 164,
	ESteamCoreInputActionOrigin__XBox360_LeftStick_Move                              = 165,
	ESteamCoreInputActionOrigin__XBox360_LeftStick_Click                             = 166,
	ESteamCoreInputActionOrigin__XBox360_LeftStick_DPadNorth                         = 167,
	ESteamCoreInputActionOrigin__XBox360_LeftStick_DPadSouth                         = 168,
	ESteamCoreInputActionOrigin__XBox360_LeftStick_DPadWest                          = 169,
	ESteamCoreInputActionOrigin__XBox360_LeftStick_DPadEast                          = 170,
	ESteamCoreInputActionOrigin__XBox360_RightStick_Move                             = 171,
	ESteamCoreInputActionOrigin__XBox360_RightStick_Click                            = 172,
	ESteamCoreInputActionOrigin__XBox360_RightStick_DPadNorth                        = 173,
	ESteamCoreInputActionOrigin__XBox360_RightStick_DPadSouth                        = 174,
	ESteamCoreInputActionOrigin__XBox360_RightStick_DPadWest                         = 175,
	ESteamCoreInputActionOrigin__XBox360_RightStick_DPadEast                         = 176,
	ESteamCoreInputActionOrigin__XBox360_DPad_North                                  = 177,
	ESteamCoreInputActionOrigin__XBox360_DPad_South                                  = 178,
	ESteamCoreInputActionOrigin__XBox360_DPad_West                                   = 179,
	ESteamCoreInputActionOrigin__XBox360_DPad_East                                   = 180,
	ESteamCoreInputActionOrigin__XBox360_DPad_Move                                   = 181,
	ESteamCoreInputActionOrigin__XBox360_Reserved1                                   = 182,
	ESteamCoreInputActionOrigin__XBox360_Reserved2                                   = 183,
	ESteamCoreInputActionOrigin__XBox360_Reserved3                                   = 184,
	ESteamCoreInputActionOrigin__XBox360_Reserved4                                   = 185,
	ESteamCoreInputActionOrigin__XBox360_Reserved5                                   = 186,
	ESteamCoreInputActionOrigin__XBox360_Reserved6                                   = 187,
	ESteamCoreInputActionOrigin__XBox360_Reserved7                                   = 188,
	ESteamCoreInputActionOrigin__XBox360_Reserved8                                   = 189,
	ESteamCoreInputActionOrigin__XBox360_Reserved9                                   = 190,
	ESteamCoreInputActionOrigin__XBox360_Reserved10                                  = 191,
	ESteamCoreInputActionOrigin__Switch_A                                            = 192,
	ESteamCoreInputActionOrigin__Switch_B                                            = 193,
	ESteamCoreInputActionOrigin__Switch_X                                            = 194,
	ESteamCoreInputActionOrigin__Switch_Y                                            = 195,
	ESteamCoreInputActionOrigin__Switch_LeftBumper                                   = 196,
	ESteamCoreInputActionOrigin__Switch_RightBumper                                  = 197,
	ESteamCoreInputActionOrigin__Switch_Plus                                         = 198,
	ESteamCoreInputActionOrigin__Switch_Minus                                        = 199,
	ESteamCoreInputActionOrigin__Switch_Capture                                      = 200,
	ESteamCoreInputActionOrigin__Switch_LeftTrigger_Pull                             = 201,
	ESteamCoreInputActionOrigin__Switch_LeftTrigger_Click                            = 202,
	ESteamCoreInputActionOrigin__Switch_RightTrigger_Pull                            = 203,
	ESteamCoreInputActionOrigin__Switch_RightTrigger_Click                           = 204,
	ESteamCoreInputActionOrigin__Switch_LeftStick_Move                               = 205,
	ESteamCoreInputActionOrigin__Switch_LeftStick_Click                              = 206,
	ESteamCoreInputActionOrigin__Switch_LeftStick_DPadNorth                          = 207,
	ESteamCoreInputActionOrigin__Switch_LeftStick_DPadSouth                          = 208,
	ESteamCoreInputActionOrigin__Switch_LeftStick_DPadWest                           = 209,
	ESteamCoreInputActionOrigin__Switch_LeftStick_DPadEast                           = 210,
	ESteamCoreInputActionOrigin__Switch_RightStick_Move                              = 211,
	ESteamCoreInputActionOrigin__Switch_RightStick_Click                             = 212,
	ESteamCoreInputActionOrigin__Switch_RightStick_DPadNorth                         = 213,
	ESteamCoreInputActionOrigin__Switch_RightStick_DPadSouth                         = 214,
	ESteamCoreInputActionOrigin__Switch_RightStick_DPadWest                          = 215,
	ESteamCoreInputActionOrigin__Switch_RightStick_DPadEast                          = 216,
	ESteamCoreInputActionOrigin__Switch_DPad_North                                   = 217,
	ESteamCoreInputActionOrigin__Switch_DPad_South                                   = 218,
	ESteamCoreInputActionOrigin__Switch_DPad_West                                    = 219,
	ESteamCoreInputActionOrigin__Switch_DPad_East                                    = 220,
	ESteamCoreInputActionOrigin__Switch_ProGyro_Move                                 = 221,
	ESteamCoreInputActionOrigin__Switch_ProGyro_Pitch                                = 222,
	ESteamCoreInputActionOrigin__Switch_ProGyro_Yaw                                  = 223,
	ESteamCoreInputActionOrigin__Switch_ProGyro_Roll                                 = 224,
	ESteamCoreInputActionOrigin__Switch_DPad_Move                                    = 225,
	ESteamCoreInputActionOrigin__Switch_Reserved1                                    = 226,
	ESteamCoreInputActionOrigin__Switch_Reserved2                                    = 227,
	ESteamCoreInputActionOrigin__Switch_Reserved3                                    = 228,
	ESteamCoreInputActionOrigin__Switch_Reserved4                                    = 229,
	ESteamCoreInputActionOrigin__Switch_Reserved5                                    = 230,
	ESteamCoreInputActionOrigin__Switch_Reserved6                                    = 231,
	ESteamCoreInputActionOrigin__Switch_Reserved7                                    = 232,
	ESteamCoreInputActionOrigin__Switch_Reserved8                                    = 233,
	ESteamCoreInputActionOrigin__Switch_Reserved9                                    = 234,
	ESteamCoreInputActionOrigin__Switch_Reserved10                                   = 235,
	ESteamCoreInputActionOrigin__Switch_RightGyro_Move                               = 236,
	ESteamCoreInputActionOrigin__Switch_RightGyro_Pitch                              = 237,
	ESteamCoreInputActionOrigin__Switch_RightGyro_Yaw                                = 238,
	ESteamCoreInputActionOrigin__Switch_RightGyro_Roll                               = 239,
	ESteamCoreInputActionOrigin__Switch_LeftGyro_Move                                = 240,
	ESteamCoreInputActionOrigin__Switch_LeftGyro_Pitch                               = 241,
	ESteamCoreInputActionOrigin__Switch_LeftGyro_Yaw                                 = 242,
	ESteamCoreInputActionOrigin__Switch_LeftGyro_Roll                                = 243,
	ESteamCoreInputActionOrigin__Switch_LeftGrip_Lower                               = 244,
	ESteamCoreInputActionOrigin__Switch_LeftGrip_Upper                               = 245,
	ESteamCoreInputActionOrigin__Switch_RightGrip_Lower                              = 246,
	ESteamCoreInputActionOrigin__Switch_RightGrip_Upper                              = 247,
	ESteamCoreInputActionOrigin__Switch_Reserved11                                   = 248,
	ESteamCoreInputActionOrigin__Switch_Reserved12                                   = 249,
	ESteamCoreInputActionOrigin__Switch_Reserved13                                   = 250,
	ESteamCoreInputActionOrigin__Switch_Reserved14                                   = 251,
	ESteamCoreInputActionOrigin__Switch_Reserved15                                   = 252,
	ESteamCoreInputActionOrigin__Switch_Reserved16                                   = 253,
	ESteamCoreInputActionOrigin__Switch_Reserved17                                   = 254,
	ESteamCoreInputActionOrigin__Switch_Reserved18                                   = 255
};

/// Enum /Script/SteamCore.ESteamCoreInputSourceMode
/// Size: 0x01 (1 bytes)
enum class ESteamCoreInputSourceMode : uint8_t
{
	ESteamCoreInputSourceMode__None                                                  = 0,
	ESteamCoreInputSourceMode__Dpad                                                  = 1,
	ESteamCoreInputSourceMode__Buttons                                               = 2,
	ESteamCoreInputSourceMode__FourButtons                                           = 3,
	ESteamCoreInputSourceMode__AbsoluteMouse                                         = 4,
	ESteamCoreInputSourceMode__RelativeMouse                                         = 5,
	ESteamCoreInputSourceMode__JoystickMove                                          = 6,
	ESteamCoreInputSourceMode__JoystickMouse                                         = 7,
	ESteamCoreInputSourceMode__JoystickCamera                                        = 8,
	ESteamCoreInputSourceMode__ScrollWheel                                           = 9,
	ESteamCoreInputSourceMode__Trigger                                               = 10,
	ESteamCoreInputSourceMode__TouchMenu                                             = 11,
	ESteamCoreInputSourceMode__MouseJoystick                                         = 12,
	ESteamCoreInputSourceMode__MouseRegion                                           = 13,
	ESteamCoreInputSourceMode__RadialMenu                                            = 14,
	ESteamCoreInputSourceMode__SingleButton                                          = 15,
	ESteamCoreInputSourceMode__Switches                                              = 16
};

/// Enum /Script/SteamCore.ESteamCoreInputSource
/// Size: 0x01 (1 bytes)
enum class ESteamCoreInputSource : uint8_t
{
	ESteamCoreInputSource__None                                                      = 0,
	ESteamCoreInputSource__LeftTrackpad                                              = 1,
	ESteamCoreInputSource__RightTrackpad                                             = 2,
	ESteamCoreInputSource__Joystick                                                  = 3,
	ESteamCoreInputSource__ABXY                                                      = 4,
	ESteamCoreInputSource__Switch                                                    = 5,
	ESteamCoreInputSource__LeftTrigger                                               = 6,
	ESteamCoreInputSource__RightTrigger                                              = 7,
	ESteamCoreInputSource__LeftBumper                                                = 8,
	ESteamCoreInputSource__RightBumper                                               = 9,
	ESteamCoreInputSource__Gyro                                                      = 10,
	ESteamCoreInputSource__CenterTrackpad                                            = 11,
	ESteamCoreInputSource__RightJoystick                                             = 12,
	ESteamCoreInputSource__DPad                                                      = 13,
	ESteamCoreInputSource__Key                                                       = 14,
	ESteamCoreInputSource__Mouse                                                     = 15,
	ESteamCoreInputSource__LeftGyro                                                  = 16,
	ESteamCoreInputSource__Count                                                     = 17
};

/// Enum /Script/SteamCore.ESteamCoreItemFlags
/// Size: 0x01 (1 bytes)
enum class ESteamCoreItemFlags : uint8_t
{
	ENoTrade                                                                         = 0,
	ERemoved                                                                         = 8,
	EConsumed                                                                        = 9
};

/// Enum /Script/SteamCore.ESteamLobbyDistanceFilter
/// Size: 0x01 (1 bytes)
enum class ESteamLobbyDistanceFilter : uint8_t
{
	ESteamLobbyDistanceFilter__Close                                                 = 0,
	ESteamLobbyDistanceFilter__Default                                               = 1,
	ESteamLobbyDistanceFilter__Far                                                   = 2,
	ESteamLobbyDistanceFilter__Worldwide                                             = 3
};

/// Enum /Script/SteamCore.ESteamLobbyComparison
/// Size: 0x01 (1 bytes)
enum class ESteamLobbyComparison : uint8_t
{
	ESteamLobbyComparison__EqualToOrLessThan                                         = 0,
	ESteamLobbyComparison__LessThan                                                  = 1,
	ESteamLobbyComparison__Equal                                                     = 2,
	ESteamLobbyComparison__GreaterThan                                               = 3,
	ESteamLobbyComparison__EqualToOrGreaterThan                                      = 4,
	ESteamLobbyComparison__NotEqual                                                  = 5
};

/// Enum /Script/SteamCore.ESteamLobbyType
/// Size: 0x01 (1 bytes)
enum class ESteamLobbyType : uint8_t
{
	ESteamLobbyType__Private                                                         = 0,
	ESteamLobbyType__FriendsOnly                                                     = 1,
	ESteamLobbyType__Public                                                          = 2,
	ESteamLobbyType__Invisible                                                       = 3
};

/// Enum /Script/SteamCore.ESteamSessionFindType
/// Size: 0x01 (1 bytes)
enum class ESteamSessionFindType : uint8_t
{
	ESteamSessionFindType__Listen                                                    = 0,
	ESteamSessionFindType__Dedicated                                                 = 1
};

/// Enum /Script/SteamCore.ESteamAudioPlaybackStatus
/// Size: 0x01 (1 bytes)
enum class ESteamAudioPlaybackStatus : uint8_t
{
	ESteamAudioPlaybackStatus__Undefined                                             = 0,
	ESteamAudioPlaybackStatus__Playing                                               = 1,
	ESteamAudioPlaybackStatus__Paused                                                = 2,
	ESteamAudioPlaybackStatus__Idle                                                  = 3
};

/// Enum /Script/SteamCore.ESteamP2PSend
/// Size: 0x01 (1 bytes)
enum class ESteamP2PSend : uint8_t
{
	ESteamP2PSend__Unreliable                                                        = 0,
	ESteamP2PSend__UnreliableNoDelay                                                 = 1,
	ESteamP2PSend__Reliable                                                          = 2,
	ESteamP2PSend__ReliableWithBuffering                                             = 3
};

/// Enum /Script/SteamCore.ESteamParentalFeature
/// Size: 0x01 (1 bytes)
enum class ESteamParentalFeature : uint8_t
{
	ESteamParentalFeature__Invalid                                                   = 0,
	ESteamParentalFeature__Store                                                     = 1,
	ESteamParentalFeature__Community                                                 = 2,
	ESteamParentalFeature__Profile                                                   = 3,
	ESteamParentalFeature__Friends                                                   = 4,
	ESteamParentalFeature__News                                                      = 5,
	ESteamParentalFeature__Trading                                                   = 6,
	ESteamParentalFeature__Settings                                                  = 7,
	ESteamParentalFeature__Console                                                   = 8,
	ESteamParentalFeature__Browser                                                   = 9,
	ESteamParentalFeature__ParentalSetup                                             = 10,
	ESteamParentalFeature__Library                                                   = 11,
	ESteamParentalFeature__Test                                                      = 12,
	ESteamParentalFeature__Max                                                       = 13
};

/// Enum /Script/SteamCore.ESteamPartiesBeaconLocationData
/// Size: 0x01 (1 bytes)
enum class ESteamPartiesBeaconLocationData : uint8_t
{
	ESteamPartiesBeaconLocationData__Invalid                                         = 0,
	ESteamPartiesBeaconLocationData__Name                                            = 1,
	ESteamPartiesBeaconLocationData__IconURLSmall                                    = 2,
	ESteamPartiesBeaconLocationData__IconURLMedium                                   = 3,
	ESteamPartiesBeaconLocationData__IconURLLarge                                    = 4
};

/// Enum /Script/SteamCore.ESteamPartiesBeaconLocationType
/// Size: 0x01 (1 bytes)
enum class ESteamPartiesBeaconLocationType : uint8_t
{
	ESteamPartiesBeaconLocationType__Invalid                                         = 0,
	ESteamPartiesBeaconLocationType__ChatGroup                                       = 1,
	ESteamPartiesBeaconLocationType__Max                                             = 2
};

/// Enum /Script/SteamCore.ESteamCoreDeviceFormFactor
/// Size: 0x01 (1 bytes)
enum class ESteamCoreDeviceFormFactor : uint8_t
{
	ESteamCoreDeviceFormFactor__Unknown                                              = 0,
	ESteamCoreDeviceFormFactor__Phone                                                = 1,
	ESteamCoreDeviceFormFactor__Tablet                                               = 2,
	ESteamCoreDeviceFormFactor__Computer                                             = 3,
	ESteamCoreDeviceFormFactor__TV                                                   = 4
};

/// Enum /Script/SteamCore.ESteamUGCReadAction
/// Size: 0x01 (1 bytes)
enum class ESteamUGCReadAction : uint8_t
{
	ESteamUGCReadAction__k_EUGCRead_ContinueReadingUntilFinished                     = 0,
	ESteamUGCReadAction__k_EUGCRead_ContinueReading                                  = 1,
	ESteamUGCReadAction__k_EUGCRead_Close                                            = 2
};

/// Enum /Script/SteamCore.ESteamRemoteStoragePlatform
/// Size: 0x01 (1 bytes)
enum class ESteamRemoteStoragePlatform : uint8_t
{
	ESteamRemoteStoragePlatform__None                                                = 0,
	ESteamRemoteStoragePlatform__Windows                                             = 1,
	ESteamRemoteStoragePlatform__OSX                                                 = 2,
	ESteamRemoteStoragePlatform__PS3                                                 = 4,
	ESteamRemoteStoragePlatform__Linux                                               = 8,
	ESteamRemoteStoragePlatform__Reserved2                                           = 16,
	ESteamRemoteStoragePlatform__All                                                 = 254
};

/// Enum /Script/SteamCore.ESteamVRScreenshotType
/// Size: 0x01 (1 bytes)
enum class ESteamVRScreenshotType : uint8_t
{
	ESteamVRScreenshotType__None                                                     = 0,
	ESteamVRScreenshotType__Mono                                                     = 1,
	ESteamVRScreenshotType__Stereo                                                   = 2,
	ESteamVRScreenshotType__MonoCubemap                                              = 3,
	ESteamVRScreenshotType__MonoPanorama                                             = 4,
	ESteamVRScreenshotType__StereoPanorama                                           = 5
};

/// Enum /Script/SteamCore.ESteamAccountType
/// Size: 0x01 (1 bytes)
enum class ESteamAccountType : uint8_t
{
	ESteamAccountType__Invalid                                                       = 0,
	ESteamAccountType__Individual                                                    = 1,
	ESteamAccountType__Multiseat                                                     = 2,
	ESteamAccountType__GameServer                                                    = 3,
	ESteamAccountType__AnonGameServer                                                = 4,
	ESteamAccountType__Pending                                                       = 5,
	ESteamAccountType__ContentServer                                                 = 6,
	ESteamAccountType__Clan                                                          = 7,
	ESteamAccountType__Chat                                                          = 8,
	ESteamAccountType__ConsoleUser                                                   = 9,
	ESteamAccountType__AnonUser                                                      = 10,
	ESteamAccountType__Max                                                           = 11
};

/// Enum /Script/SteamCore.ESteamBeginAuthSessionResult
/// Size: 0x01 (1 bytes)
enum class ESteamBeginAuthSessionResult : uint8_t
{
	ESteamBeginAuthSessionResult__OK                                                 = 0,
	ESteamBeginAuthSessionResult__InvalidTicket                                      = 1,
	ESteamBeginAuthSessionResult__DuplicateRequest                                   = 2,
	ESteamBeginAuthSessionResult__InvalidVersion                                     = 3,
	ESteamBeginAuthSessionResult__GameMismatch                                       = 4,
	ESteamBeginAuthSessionResult__ExpiredTicket                                      = 5
};

/// Enum /Script/SteamCore.ESteamUserHasLicenseForAppResult
/// Size: 0x01 (1 bytes)
enum class ESteamUserHasLicenseForAppResult : uint8_t
{
	ESteamUserHasLicenseForAppResult__HasLicense                                     = 0,
	ESteamUserHasLicenseForAppResult__DoesNotHaveLicense                             = 1,
	ESteamUserHasLicenseForAppResult__NoAuth                                         = 2
};

/// Enum /Script/SteamCore.EOnlineComparison
/// Size: 0x01 (1 bytes)
enum class EOnlineComparison : uint8_t
{
	EOnlineComparison__Equals                                                        = 0,
	EOnlineComparison__NotEquals                                                     = 1,
	EOnlineComparison__GreaterThan                                                   = 2,
	EOnlineComparison__GreaterThanEquals                                             = 3,
	EOnlineComparison__LessThan                                                      = 4,
	EOnlineComparison__LessThanEquals                                                = 5
};

/// Enum /Script/SteamCore.ESteamComparisonOp
/// Size: 0x01 (1 bytes)
enum class ESteamComparisonOp : uint8_t
{
	ESteamComparisonOp__Equals                                                       = 0,
	ESteamComparisonOp__NotEquals                                                    = 1,
	ESteamComparisonOp__GreaterThan                                                  = 2,
	ESteamComparisonOp__GreaterThanEquals                                            = 3,
	ESteamComparisonOp__LessThan                                                     = 4,
	ESteamComparisonOp__LessThanEquals                                               = 5,
	ESteamComparisonOp__Near                                                         = 6,
	ESteamComparisonOp__In                                                           = 7,
	ESteamComparisonOp__NotIn                                                        = 8
};

/// Enum /Script/SteamCore.ESteamRemoteStoragePublishedFileVisibility
/// Size: 0x01 (1 bytes)
enum class ESteamRemoteStoragePublishedFileVisibility : uint8_t
{
	ESteamRemoteStoragePublishedFileVisibility__Public                               = 0,
	ESteamRemoteStoragePublishedFileVisibility__FriendsOnly                          = 1,
	ESteamRemoteStoragePublishedFileVisibility__Private                              = 2
};

/// Enum /Script/SteamCore.ESteamWorkshopFileType
/// Size: 0x01 (1 bytes)
enum class ESteamWorkshopFileType : uint8_t
{
	ESteamWorkshopFileType__First                                                    = 0,
	ESteamWorkshopFileType__Community                                                = 0,
	ESteamWorkshopFileType__Microtransaction                                         = 1,
	ESteamWorkshopFileType__Collection                                               = 2,
	ESteamWorkshopFileType__Art                                                      = 3,
	ESteamWorkshopFileType__Video                                                    = 4,
	ESteamWorkshopFileType__Screenshot                                               = 5,
	ESteamWorkshopFileType__Game                                                     = 6,
	ESteamWorkshopFileType__Software                                                 = 7,
	ESteamWorkshopFileType__Concept                                                  = 8,
	ESteamWorkshopFileType__WebGuide                                                 = 9,
	ESteamWorkshopFileType__IntegratedGuide                                          = 10,
	ESteamWorkshopFileType__Merch                                                    = 11,
	ESteamWorkshopFileType__ControllerBinding                                        = 12,
	ESteamWorkshopFileType__SteamworksAccessInvite                                   = 13,
	ESteamWorkshopFileType__SteamVideo                                               = 14,
	ESteamWorkshopFileType__GameManagedItem                                          = 15,
	ESteamWorkshopFileType__Max                                                      = 16
};

/// Enum /Script/SteamCore.ESteamItemPreviewType
/// Size: 0x01 (1 bytes)
enum class ESteamItemPreviewType : uint8_t
{
	ESteamItemPreviewType__Image                                                     = 0,
	ESteamItemPreviewType__YouTubeVideo                                              = 1,
	ESteamItemPreviewType__Sketchfab                                                 = 2,
	ESteamItemPreviewType__EnvironmentMap_HorizontalCross                            = 3,
	ESteamItemPreviewType__EnvironmentMap_LatLong                                    = 4,
	ESteamItemPreviewType__ReservedMax                                               = 254
};

/// Enum /Script/SteamCore.ESteamItemStatistic
/// Size: 0x01 (1 bytes)
enum class ESteamItemStatistic : uint8_t
{
	ESteamItemStatistic__NumSubscriptions                                            = 0,
	ESteamItemStatistic__NumFavorites                                                = 1,
	ESteamItemStatistic__NumFollowers                                                = 2,
	ESteamItemStatistic__NumUniqueSubscriptions                                      = 3,
	ESteamItemStatistic__NumUniqueFavorites                                          = 4,
	ESteamItemStatistic__NumUniqueFollowers                                          = 5,
	ESteamItemStatistic__NumUniqueWebsiteViews                                       = 6,
	ESteamItemStatistic__ReportScore                                                 = 7,
	ESteamItemStatistic__NumSecondsPlayed                                            = 8,
	ESteamItemStatistic__NumPlaytimeSessions                                         = 9,
	ESteamItemStatistic__NumComments                                                 = 10,
	ESteamItemStatistic__NumSecondsPlayedDuringTimePeriod                            = 11,
	ESteamItemStatistic__NumPlaytimeSessionsDuringTimePeriod                         = 12
};

/// Enum /Script/SteamCore.ESteamItemState
/// Size: 0x01 (1 bytes)
enum class ESteamItemState : uint8_t
{
	ESteamItemState__None                                                            = 0,
	ESteamItemState__Subscribed                                                      = 1,
	ESteamItemState__LegacyItem                                                      = 2,
	ESteamItemState__Installed                                                       = 4,
	ESteamItemState__NeedsUpdate                                                     = 8,
	ESteamItemState__Downloading                                                     = 16,
	ESteamItemState__DownloadPending                                                 = 32
};

/// Enum /Script/SteamCore.ESteamItemUpdateStatus
/// Size: 0x01 (1 bytes)
enum class ESteamItemUpdateStatus : uint8_t
{
	ESteamItemUpdateStatus__Invalid                                                  = 0,
	ESteamItemUpdateStatus__PreparingConfig                                          = 1,
	ESteamItemUpdateStatus__PreparingContent                                         = 2,
	ESteamItemUpdateStatus__UploadingContent                                         = 3,
	ESteamItemUpdateStatus__UploadingPreviewFile                                     = 4,
	ESteamItemUpdateStatus__CommittingChanges                                        = 5
};

/// Enum /Script/SteamCore.ESteamUGCQuery
/// Size: 0x01 (1 bytes)
enum class ESteamUGCQuery : uint8_t
{
	ESteamUGCQuery__RankedByVote                                                     = 0,
	ESteamUGCQuery__RankedByPublicationDate                                          = 1,
	ESteamUGCQuery__AcceptedForGameRankedByAcceptanceDate                            = 2,
	ESteamUGCQuery__RankedByTrend                                                    = 3,
	ESteamUGCQuery__FavoritedByFriendsRankedByPublicationDate                        = 4,
	ESteamUGCQuery__CreatedByFriendsRankedByPublicationDate                          = 5,
	ESteamUGCQuery__RankedByNumTimesReported                                         = 6,
	ESteamUGCQuery__CreatedByFollowedUsersRankedByPublicationDate                    = 7,
	ESteamUGCQuery__NotYetRated                                                      = 8,
	ESteamUGCQuery__RankedByTotalVotesAsc                                            = 9,
	ESteamUGCQuery__RankedByVotesUp                                                  = 10,
	ESteamUGCQuery__RankedByTextSearch                                               = 11,
	ESteamUGCQuery__RankedByTotalUniqueSubscriptions                                 = 12,
	ESteamUGCQuery__RankedByPlaytimeTrend                                            = 13,
	ESteamUGCQuery__RankedByTotalPlaytime                                            = 14,
	ESteamUGCQuery__RankedByAveragePlaytimeTrend                                     = 15,
	ESteamUGCQuery__RankedByLifetimeAveragePlaytime                                  = 16,
	ESteamUGCQuery__RankedByPlaytimeSessionsTrend                                    = 17,
	ESteamUGCQuery__RankedByLifetimePlaytimeSessions                                 = 18
};

/// Enum /Script/SteamCore.ESteamUserUGCListSortOrder
/// Size: 0x01 (1 bytes)
enum class ESteamUserUGCListSortOrder : uint8_t
{
	ESteamUserUGCListSortOrder__CreationOrderDesc                                    = 0,
	ESteamUserUGCListSortOrder__CreationOrderAsc                                     = 1,
	ESteamUserUGCListSortOrder__TitleAsc                                             = 2,
	ESteamUserUGCListSortOrder__LastUpdatedDesc                                      = 3,
	ESteamUserUGCListSortOrder__SubscriptionDateDesc                                 = 4,
	ESteamUserUGCListSortOrder__VoteScoreDesc                                        = 5,
	ESteamUserUGCListSortOrder__ForModeration                                        = 6
};

/// Enum /Script/SteamCore.ESteamUserUGCList
/// Size: 0x01 (1 bytes)
enum class ESteamUserUGCList : uint8_t
{
	ESteamUserUGCList__Published                                                     = 0,
	ESteamUserUGCList__VotedOn                                                       = 1,
	ESteamUserUGCList__VotedUp                                                       = 2,
	ESteamUserUGCList__VotedDown                                                     = 3,
	ESteamUserUGCList__WillVoteLater                                                 = 4,
	ESteamUserUGCList__Favorited                                                     = 5,
	ESteamUserUGCList__Subscribed                                                    = 6,
	ESteamUserUGCList__UsedOrPlayed                                                  = 7,
	ESteamUserUGCList__Followed                                                      = 8
};

/// Enum /Script/SteamCore.ESteamUGCMatchingUGCType
/// Size: 0x01 (1 bytes)
enum class ESteamUGCMatchingUGCType : uint8_t
{
	ESteamUGCMatchingUGCType__Items                                                  = 0,
	ESteamUGCMatchingUGCType__Items_Mtx                                              = 1,
	ESteamUGCMatchingUGCType__Items_ReadyToUse                                       = 2,
	ESteamUGCMatchingUGCType__Collections                                            = 3,
	ESteamUGCMatchingUGCType__Artwork                                                = 4,
	ESteamUGCMatchingUGCType__Videos                                                 = 5,
	ESteamUGCMatchingUGCType__Screenshots                                            = 6,
	ESteamUGCMatchingUGCType__AllGuides                                              = 7,
	ESteamUGCMatchingUGCType__WebGuides                                              = 8,
	ESteamUGCMatchingUGCType__IntegratedGuides                                       = 9,
	ESteamUGCMatchingUGCType__UsableInGame                                           = 10,
	ESteamUGCMatchingUGCType__ControllerBindings                                     = 11,
	ESteamUGCMatchingUGCType__GameManagedItems                                       = 12,
	ESteamUGCMatchingUGCType__All                                                    = 13
};

/// Enum /Script/SteamCore.ESteamLeaderboardUploadScoreMethod
/// Size: 0x01 (1 bytes)
enum class ESteamLeaderboardUploadScoreMethod : uint8_t
{
	ESteamLeaderboardUploadScoreMethod__None                                         = 0,
	ESteamLeaderboardUploadScoreMethod__KeepBest                                     = 1,
	ESteamLeaderboardUploadScoreMethod__ForceUpdate                                  = 2
};

/// Enum /Script/SteamCore.ESteamLeaderboardDisplayType
/// Size: 0x01 (1 bytes)
enum class ESteamLeaderboardDisplayType : uint8_t
{
	ESteamLeaderboardDisplayType__None                                               = 0,
	ESteamLeaderboardDisplayType__Numeric                                            = 1,
	ESteamLeaderboardDisplayType__TimeSeconds                                        = 2,
	ESteamLeaderboardDisplayType__TimeMilliSeconds                                   = 3
};

/// Enum /Script/SteamCore.ESteamLeaderboardSortMethod
/// Size: 0x01 (1 bytes)
enum class ESteamLeaderboardSortMethod : uint8_t
{
	ESteamLeaderboardSortMethod__None                                                = 0,
	ESteamLeaderboardSortMethod__Ascending                                           = 1,
	ESteamLeaderboardSortMethod__Descending                                          = 2
};

/// Enum /Script/SteamCore.ESteamLeaderboardDataRequest
/// Size: 0x01 (1 bytes)
enum class ESteamLeaderboardDataRequest : uint8_t
{
	ESteamLeaderboardDataRequest__Global                                             = 0,
	ESteamLeaderboardDataRequest__GlobalAroundUser                                   = 1,
	ESteamLeaderboardDataRequest__Friends                                            = 2,
	ESteamLeaderboardDataRequest__Users                                              = 3
};

/// Enum /Script/SteamCore.ESteamVoiceResult
/// Size: 0x01 (1 bytes)
enum class ESteamVoiceResult : uint8_t
{
	ESteamVoiceResult__OK                                                            = 0,
	ESteamVoiceResult__NotInitialized                                                = 1,
	ESteamVoiceResult__NotRecording                                                  = 2,
	ESteamVoiceResult__NoData                                                        = 3,
	ESteamVoiceResult__BufferTooSmall                                                = 4,
	ESteamVoiceResult__DataCorrupted                                                 = 5,
	ESteamVoiceResult__Restricted                                                    = 6,
	ESteamVoiceResult__UnsupportedCodec                                              = 7,
	ESteamVoiceResult__ReceiverOutOfDate                                             = 8,
	ESteamVoiceResult__ReceiverDidNotAnswer                                          = 9
};

/// Enum /Script/SteamCore.ESteamCoreIdentical
/// Size: 0x01 (1 bytes)
enum class ESteamCoreIdentical : uint8_t
{
	ESteamCoreIdentical__Identical                                                   = 0,
	ESteamCoreIdentical__NotIdentical                                                = 1
};

/// Enum /Script/SteamCore.ESteamCoreValid
/// Size: 0x01 (1 bytes)
enum class ESteamCoreValid : uint8_t
{
	ESteamCoreValid__Valid                                                           = 0,
	ESteamCoreValid__NotValid                                                        = 1
};

/// Enum /Script/SteamCore.ESteamUniverse
/// Size: 0x01 (1 bytes)
enum class ESteamUniverse : uint8_t
{
	ESteamUniverse__Invalid                                                          = 0,
	ESteamUniverse__Public                                                           = 1,
	ESteamUniverse__Beta                                                             = 2,
	ESteamUniverse__Internal                                                         = 3,
	ESteamUniverse__Dev                                                              = 4,
	ESteamUniverse__Max                                                              = 5
};

/// Enum /Script/SteamCore.ESteamNotificationPosition
/// Size: 0x01 (1 bytes)
enum class ESteamNotificationPosition : uint8_t
{
	ESteamNotificationPosition__TopLeft                                              = 0,
	ESteamNotificationPosition__TopRight                                             = 1,
	ESteamNotificationPosition__BottomLeft                                           = 2,
	ESteamNotificationPosition__BottomRight                                          = 3
};

/// Enum /Script/SteamCore.ESteamGamepadTextInputMode
/// Size: 0x01 (1 bytes)
enum class ESteamGamepadTextInputMode : uint8_t
{
	ESteamGamepadTextInputMode__Normal                                               = 0,
	ESteamGamepadTextInputMode__Password                                             = 1
};

/// Enum /Script/SteamCore.ESteamGamepadTextInputLineMode
/// Size: 0x01 (1 bytes)
enum class ESteamGamepadTextInputLineMode : uint8_t
{
	ESteamGamepadTextInputLineMode__SingleLine                                       = 0,
	ESteamGamepadTextInputLineMode__MultipleLines                                    = 1
};

/// Enum /Script/SteamCore.ESteamTextFilteringContext
/// Size: 0x01 (1 bytes)
enum class ESteamTextFilteringContext : uint8_t
{
	ESteamTextFilteringContext__k_ETextFilteringContextUnknown                       = 0,
	ESteamTextFilteringContext__k_ETextFilteringContextGameContent                   = 1,
	ESteamTextFilteringContext__k_ETextFilteringContextChat                          = 2,
	ESteamTextFilteringContext__k_ETextFilteringContextName                          = 3
};

/// Enum /Script/SteamCore.ESteamBroadcastUploadResult
/// Size: 0x01 (1 bytes)
enum class ESteamBroadcastUploadResult : uint8_t
{
	ESteamBroadcastUploadResult__None                                                = 0,
	ESteamBroadcastUploadResult__OK                                                  = 1,
	ESteamBroadcastUploadResult__InitFailed                                          = 2,
	ESteamBroadcastUploadResult__FrameFailed                                         = 3,
	ESteamBroadcastUploadResult__Timeout                                             = 4,
	ESteamBroadcastUploadResult__BandwidthExceeded                                   = 5,
	ESteamBroadcastUploadResult__LowFPS                                              = 6,
	ESteamBroadcastUploadResult__MissingKeyFrames                                    = 7,
	ESteamBroadcastUploadResult__NoConnection                                        = 8,
	ESteamBroadcastUploadResult__RelayFailed                                         = 9,
	ESteamBroadcastUploadResult__SettingsChanged                                     = 10,
	ESteamBroadcastUploadResult__MissingAudio                                        = 11,
	ESteamBroadcastUploadResult__TooFarBehind                                        = 12,
	ESteamBroadcastUploadResult__TranscodeBehind                                     = 13
};

/// Struct /Script/SteamCore.SteamInventoryResult
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FSteamInventoryResult
{ 
	int32_t                                            Value;                                                      // 0x0000   (0x0004)  
};

/// Struct /Script/SteamCore.SteamInventoryResultReady
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 MaxSize: 0x0008
struct FSteamInventoryResultReady
{ 
	FSteamInventoryResult                              Handle;                                                     // 0x0000   (0x0004)  
	ESteamResult                                       Result;                                                     // 0x0004   (0x0001)  
	unsigned char                                      UnknownData00_7[0x3];                                       // 0x0005   (0x0003)  MISSED
};

/// Struct /Script/SteamCore.SteamInventoryFullUpdate
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FSteamInventoryFullUpdate
{ 
	FSteamInventoryResult                              Handle;                                                     // 0x0000   (0x0004)  
};

/// Struct /Script/SteamCore.SteamInventoryStartPurchaseResult
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FSteamInventoryStartPurchaseResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FString                                            OrderId;                                                    // 0x0008   (0x0010)  
	FString                                            TransactionId;                                              // 0x0018   (0x0010)  
};

/// Struct /Script/SteamCore.SteamInventoryRequestPricesResult
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FSteamInventoryRequestPricesResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FString                                            Currency;                                                   // 0x0008   (0x0010)  
};

/// Struct /Script/SteamCore.SteamID
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FSteamID
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.SteamInventoryEligiblePromoItemDefIDs
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FSteamInventoryEligiblePromoItemDefIDs
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FSteamID                                           SteamID;                                                    // 0x0008   (0x0008)  
	int32_t                                            NumEligiblePromoItemDefs;                                   // 0x0010   (0x0004)  
	bool                                               bCachedData;                                                // 0x0014   (0x0001)  
	unsigned char                                      UnknownData01_7[0x3];                                       // 0x0015   (0x0003)  MISSED
};

/// Struct /Script/SteamCore.SteamAppInstalled
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FSteamAppInstalled
{ 
	int32_t                                            AppID;                                                      // 0x0000   (0x0004)  
};

/// Struct /Script/SteamCore.SteamAppUninstalled
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FSteamAppUninstalled
{ 
	int32_t                                            AppID;                                                      // 0x0000   (0x0004)  
};

/// Struct /Script/SteamCore.FileDetailsResult
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FFileDetailsResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            FileSize;                                                   // 0x0004   (0x0004)  
	FString                                            SHA;                                                        // 0x0008   (0x0010)  
	TArray<int32_t>                                    Flags;                                                      // 0x0018   (0x0010)  
};

/// Struct /Script/SteamCore.DLCInstalled
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FDLCInstalled
{ 
	int32_t                                            AppID;                                                      // 0x0000   (0x0004)  
};

/// Struct /Script/SteamCore.GameOverlayActivated
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FGameOverlayActivated
{ 
	bool                                               bActive;                                                    // 0x0000   (0x0001)  
};

/// Struct /Script/SteamCore.AvatarImageLoaded
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FAvatarImageLoaded
{ 
	FSteamID                                           SteamID;                                                    // 0x0000   (0x0008)  
	class UTexture2D*                                  Image;                                                      // 0x0008   (0x0008)  
	unsigned char                                      UnknownData00_7[0x10];                                      // 0x0010   (0x0010)  MISSED
};

/// Struct /Script/SteamCore.GameServerChangeRequested
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FGameServerChangeRequested
{ 
	FString                                            Server;                                                     // 0x0000   (0x0010)  
	FString                                            Password;                                                   // 0x0010   (0x0010)  
};

/// Struct /Script/SteamCore.GameConnectedFriendChatMsg
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FGameConnectedFriendChatMsg
{ 
	FSteamID                                           SteamIDUser;                                                // 0x0000   (0x0008)  
	int32_t                                            MessageID;                                                  // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.GameLobbyJoinRequested
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FGameLobbyJoinRequested
{ 
	FSteamID                                           SteamIDLobby;                                               // 0x0000   (0x0008)  
	FSteamID                                           SteamIDFriend;                                              // 0x0008   (0x0008)  
};

/// Struct /Script/SteamCore.GameRichPresenceJoinRequested
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FGameRichPresenceJoinRequested
{ 
	FSteamID                                           SteamIDFriend;                                              // 0x0000   (0x0008)  
	FString                                            Connect;                                                    // 0x0008   (0x0010)  
};

/// Struct /Script/SteamCore.PersonaStateChange
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FPersonaStateChange
{ 
	FSteamID                                           SteamID;                                                    // 0x0000   (0x0008)  
	TArray<ESteamPersonaChange>                        Flags;                                                      // 0x0008   (0x0010)  
};

/// Struct /Script/SteamCore.ClanOfficerListResponse
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FClanOfficerListResponse
{ 
	FSteamID                                           SteamIDClan;                                                // 0x0000   (0x0008)  
	int32_t                                            Officers;                                                   // 0x0008   (0x0004)  
	bool                                               bSuccess;                                                   // 0x000C   (0x0001)  
	unsigned char                                      UnknownData00_7[0x3];                                       // 0x000D   (0x0003)  MISSED
};

/// Struct /Script/SteamCore.FriendRichPresenceUpdate
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FFriendRichPresenceUpdate
{ 
	FSteamID                                           SteamIDFriend;                                              // 0x0000   (0x0008)  
	int32_t                                            AppID;                                                      // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.GameConnectedClanChatMsg
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FGameConnectedClanChatMsg
{ 
	FSteamID                                           SteamIDUser;                                                // 0x0000   (0x0008)  
	FSteamID                                           SteamIDClanChat;                                            // 0x0008   (0x0008)  
	int32_t                                            MessageID;                                                  // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.GameConnectedChatJoin
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FGameConnectedChatJoin
{ 
	FSteamID                                           SteamIDClanChat;                                            // 0x0000   (0x0008)  
	FSteamID                                           SteamIDUser;                                                // 0x0008   (0x0008)  
};

/// Struct /Script/SteamCore.GameConnectedChatLeave
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FGameConnectedChatLeave
{ 
	FSteamID                                           SteamIDClanChat;                                            // 0x0000   (0x0008)  
	FSteamID                                           SteamIDUser;                                                // 0x0008   (0x0008)  
	bool                                               bKicked;                                                    // 0x0010   (0x0001)  
	bool                                               bDropped;                                                   // 0x0011   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x0012   (0x0006)  MISSED
};

/// Struct /Script/SteamCore.DownloadClanActivityCountsResult
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FDownloadClanActivityCountsResult
{ 
	bool                                               bSuccess;                                                   // 0x0000   (0x0001)  
};

/// Struct /Script/SteamCore.JoinClanChatRoomCompletionResult
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FJoinClanChatRoomCompletionResult
{ 
	FSteamID                                           SteamIDClanChat;                                            // 0x0000   (0x0008)  
	ESteamChatRoomEnterResponse                        ChatRoomEnterResponse;                                      // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.SetPersonaNameResponse
/// Size: 0x0003 (3 bytes) (0x000000 - 0x000003) align 1 MaxSize: 0x0003
struct FSetPersonaNameResponse
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	bool                                               bSuccess;                                                   // 0x0001   (0x0001)  
	bool                                               bLocalSuccess;                                              // 0x0002   (0x0001)  
};

/// Struct /Script/SteamCore.FriendsGetFollowerCount
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FFriendsGetFollowerCount
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FSteamID                                           SteamID;                                                    // 0x0008   (0x0008)  
	int32_t                                            Count;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.FriendsIsFollowing
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FFriendsIsFollowing
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FSteamID                                           SteamID;                                                    // 0x0008   (0x0008)  
	bool                                               bIsFollowing;                                               // 0x0010   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.FriendsEnumerateFollowingList
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FFriendsEnumerateFollowingList
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	TArray<FSteamID>                                   SteamIDs;                                                   // 0x0008   (0x0010)  
	int32_t                                            Results;                                                    // 0x0018   (0x0004)  
	int32_t                                            TotalResult;                                                // 0x001C   (0x0004)  
};

/// Struct /Script/SteamCore.SearchForGameProgressCallback
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 MaxSize: 0x0030
struct FSearchForGameProgressCallback
{ 
	FString                                            SearchID;                                                   // 0x0000   (0x0010)  
	ESteamResult                                       Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
	FSteamID                                           LobbyID;                                                    // 0x0018   (0x0008)  
	FSteamID                                           SteamIDEndedSearch;                                         // 0x0020   (0x0008)  
	int32_t                                            SecondsRemainingEstimate;                                   // 0x0028   (0x0004)  
	int32_t                                            PlayersSearching;                                           // 0x002C   (0x0004)  
};

/// Struct /Script/SteamCore.SearchForGameResultCallback
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 MaxSize: 0x0030
struct FSearchForGameResultCallback
{ 
	FString                                            SearchID;                                                   // 0x0000   (0x0010)  
	ESteamResult                                       Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0011   (0x0003)  MISSED
	int32_t                                            CountPlayersInGame;                                         // 0x0014   (0x0004)  
	int32_t                                            CountAcceptedGame;                                          // 0x0018   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	FSteamID                                           SteamIDHost;                                                // 0x0020   (0x0008)  
	bool                                               bFinalCallback;                                             // 0x0028   (0x0001)  
	unsigned char                                      UnknownData02_7[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.RequestPlayersForGameProgressCallback
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FRequestPlayersForGameProgressCallback
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FString                                            SearchID;                                                   // 0x0008   (0x0010)  
};

/// Struct /Script/SteamCore.RequestPlayersForGameResultCallback
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 MaxSize: 0x0050
struct FRequestPlayersForGameResultCallback
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FString                                            SearchID;                                                   // 0x0008   (0x0010)  
	FSteamID                                           SteamIDPlayerFound;                                         // 0x0018   (0x0008)  
	FSteamID                                           SteamIDLobby;                                               // 0x0020   (0x0008)  
	ESteamPlayerAcceptState                            PlayerAcceptState;                                          // 0x0028   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0029   (0x0003)  MISSED
	int32_t                                            PlayerIndex;                                                // 0x002C   (0x0004)  
	int32_t                                            TotalPlayersFound;                                          // 0x0030   (0x0004)  
	int32_t                                            TotalPlayersAcceptedGame;                                   // 0x0034   (0x0004)  
	int32_t                                            SuggestedTeamIndex;                                         // 0x0038   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x003C   (0x0004)  MISSED
	FString                                            UniqueGameID;                                               // 0x0040   (0x0010)  
};

/// Struct /Script/SteamCore.RequestPlayersForGameFinalResultCallback
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FRequestPlayersForGameFinalResultCallback
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FString                                            SearchID;                                                   // 0x0008   (0x0010)  
	FString                                            UniqueGameID;                                               // 0x0018   (0x0010)  
};

/// Struct /Script/SteamCore.SubmitPlayerResultResultCallback
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FSubmitPlayerResultResultCallback
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FString                                            UniqueGameID;                                               // 0x0008   (0x0010)  
	FSteamID                                           SteamIDPlayer;                                              // 0x0018   (0x0008)  
};

/// Struct /Script/SteamCore.EndGameResultCallback
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FEndGameResultCallback
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FString                                            UniqueGameID;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/SteamCore.AssociateWithClanResult
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FAssociateWithClanResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
};

/// Struct /Script/SteamCore.ComputeNewPlayerCompatibilityResult
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FComputeNewPlayerCompatibilityResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            PlayersThatDontLikeCandidate;                               // 0x0004   (0x0004)  
	int32_t                                            PlayersThatCandidateDoesntLike;                             // 0x0008   (0x0004)  
	int32_t                                            ClanPlayersThatDontLikeCandidate;                           // 0x000C   (0x0004)  
	FSteamID                                           SteamIDCandidate;                                           // 0x0010   (0x0008)  
};

/// Struct /Script/SteamCore.GSPolicyResponse
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FGSPolicyResponse
{ 
	bool                                               BSecure;                                                    // 0x0000   (0x0001)  
};

/// Struct /Script/SteamCore.GSClientGroupStatus
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FGSClientGroupStatus
{ 
	FSteamID                                           SteamIDUser;                                                // 0x0000   (0x0008)  
	FSteamID                                           SteamIDGroup;                                               // 0x0008   (0x0008)  
	bool                                               bMember;                                                    // 0x0010   (0x0001)  
	bool                                               bOfficer;                                                   // 0x0011   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x0012   (0x0006)  MISSED
};

/// Struct /Script/SteamCore.ValidateAuthTicketResponse
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FValidateAuthTicketResponse
{ 
	FSteamID                                           SteamID;                                                    // 0x0000   (0x0008)  
	ESteamAuthSessionResponse                          AuthSessionResponse;                                        // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
	FSteamID                                           OwnerSteamID;                                               // 0x0010   (0x0008)  
};

/// Struct /Script/SteamCore.GSClientApprove
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FGSClientApprove
{ 
	FSteamID                                           SteamID;                                                    // 0x0000   (0x0008)  
	FSteamID                                           OwnerSteamID;                                               // 0x0008   (0x0008)  
};

/// Struct /Script/SteamCore.GSClientDeny
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FGSClientDeny
{ 
	FSteamID                                           SteamID;                                                    // 0x0000   (0x0008)  
	ESteamDenyReason                                   DenyReason;                                                 // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
	FString                                            OptionalText;                                               // 0x0010   (0x0010)  
};

/// Struct /Script/SteamCore.GSStatsReceived
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FGSStatsReceived
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FSteamID                                           SteamIDUser;                                                // 0x0008   (0x0008)  
};

/// Struct /Script/SteamCore.GSStatsStored
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FGSStatsStored
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FSteamID                                           SteamIDUser;                                                // 0x0008   (0x0008)  
};

/// Struct /Script/SteamCore.GSStatsUnloaded
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FGSStatsUnloaded
{ 
	FSteamID                                           SteamIDUser;                                                // 0x0000   (0x0008)  
};

/// Struct /Script/SteamCore.FavoritesListAccountsUpdated
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FFavoritesListAccountsUpdated
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
};

/// Struct /Script/SteamCore.FavoritesListChanged
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 MaxSize: 0x0040
struct FFavoritesListChanged
{ 
	FString                                            IP;                                                         // 0x0000   (0x0010)  
	int32_t                                            QueryPort;                                                  // 0x0010   (0x0004)  
	int32_t                                            ConnectionPort;                                             // 0x0014   (0x0004)  
	int32_t                                            AppID;                                                      // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	TArray<ESteamFavoriteFlags>                        Flags;                                                      // 0x0020   (0x0010)  
	bool                                               bAdd;                                                       // 0x0030   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0031   (0x0007)  MISSED
	FSteamID                                           SteamID;                                                    // 0x0038   (0x0008)  
};

/// Struct /Script/SteamCore.LobbyChatMsg
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FLobbyChatMsg
{ 
	FSteamID                                           SteamIDLobby;                                               // 0x0000   (0x0008)  
	FSteamID                                           SteamIDUser;                                                // 0x0008   (0x0008)  
	ESteamChatEntryType                                ChatEntryType;                                              // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0011   (0x0003)  MISSED
	int32_t                                            ChatID;                                                     // 0x0014   (0x0004)  
};

/// Struct /Script/SteamCore.LobbyChatUpdate
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FLobbyChatUpdate
{ 
	FSteamID                                           SteamIDLobby;                                               // 0x0000   (0x0008)  
	FSteamID                                           SteamIDUserChanged;                                         // 0x0008   (0x0008)  
	FSteamID                                           SteamIDMakingChange;                                        // 0x0010   (0x0008)  
	TArray<ESteamChatMemberStateChange>                ChatMemberStateChange;                                      // 0x0018   (0x0010)  
};

/// Struct /Script/SteamCore.LobbyDataUpdate
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FLobbyDataUpdate
{ 
	FSteamID                                           SteamIDLobby;                                               // 0x0000   (0x0008)  
	FSteamID                                           SteamIDMember;                                              // 0x0008   (0x0008)  
	bool                                               bSuccess;                                                   // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.LobbyEnterData
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FLobbyEnterData
{ 
	FSteamID                                           SteamIDLobby;                                               // 0x0000   (0x0008)  
	bool                                               bLocked;                                                    // 0x0008   (0x0001)  
	ESteamChatRoomEnterResponse                        ChatRoomEnterResponse;                                      // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x000A   (0x0006)  MISSED
};

/// Struct /Script/SteamCore.LobbyGameCreated
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FLobbyGameCreated
{ 
	FSteamID                                           SteamIDLobby;                                               // 0x0000   (0x0008)  
	FSteamID                                           SteamIDGameServer;                                          // 0x0008   (0x0008)  
	FString                                            IP;                                                         // 0x0010   (0x0010)  
	int32_t                                            Port;                                                       // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.SteamGameID
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FSteamGameID
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.LobbyInviteData
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FLobbyInviteData
{ 
	FSteamID                                           SteamIDUser;                                                // 0x0000   (0x0008)  
	FSteamID                                           SteamIDLobby;                                               // 0x0008   (0x0008)  
	FSteamGameID                                       GameID;                                                     // 0x0010   (0x0008)  
};

/// Struct /Script/SteamCore.LobbyKickedData
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FLobbyKickedData
{ 
	FSteamID                                           SteamIDLobby;                                               // 0x0000   (0x0008)  
	FSteamID                                           SteamIDAdmin;                                               // 0x0008   (0x0008)  
	bool                                               bKickedDueToDisconnect;                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.LobbyMatchList
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FLobbyMatchList
{ 
	int32_t                                            LobbiesMatching;                                            // 0x0000   (0x0004)  
};

/// Struct /Script/SteamCore.CreateLobbyData
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FCreateLobbyData
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FSteamID                                           SteamIDLobby;                                               // 0x0008   (0x0008)  
};

/// Struct /Script/SteamCore.JoinLobbyData
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FJoinLobbyData
{ 
	FSteamID                                           SteamIDLobby;                                               // 0x0000   (0x0008)  
	bool                                               bLocked;                                                    // 0x0008   (0x0001)  
	ESteamChatRoomEnterResponse                        ChatRoomEnterResponse;                                      // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x000A   (0x0006)  MISSED
};

/// Struct /Script/SteamCore.SteamSessionSetting
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FSteamSessionSetting
{ 
	unsigned char                                      UnknownData00_2[0x28];                                      // 0x0000   (0x0028)  MISSED
};

/// Struct /Script/SteamCore.SteamSessionResult
/// Size: 0x0118 (280 bytes) (0x000000 - 0x000118) align 8 MaxSize: 0x0118
struct FSteamSessionResult
{ 
	FBlueprintSessionResult                            Result;                                                     // 0x0000   (0x0108)  
	TArray<FSteamSessionSetting>                       SessionSettings;                                            // 0x0108   (0x0010)  
};

/// Struct /Script/SteamCore.SteamServerAddr
/// Size: 0x0038 (56 bytes) (0x000000 - 0x000038) align 8 MaxSize: 0x0038
struct FSteamServerAddr
{ 
	FString                                            IP;                                                         // 0x0000   (0x0010)  
	int32_t                                            Port;                                                       // 0x0010   (0x0004)  
	int32_t                                            QueryPort;                                                  // 0x0014   (0x0004)  
	FString                                            ConnectionAddressString;                                    // 0x0018   (0x0010)  
	FString                                            SteamP2PAddr;                                               // 0x0028   (0x0010)  
};

/// Struct /Script/SteamCore.GameServerItem
/// Size: 0x00B0 (176 bytes) (0x000000 - 0x0000B0) align 8 MaxSize: 0x00B0
struct FGameServerItem
{ 
	FString                                            ServerName;                                                 // 0x0000   (0x0010)  
	FString                                            MapName;                                                    // 0x0010   (0x0010)  
	FString                                            GameDescription;                                            // 0x0020   (0x0010)  
	FString                                            GameTags;                                                   // 0x0030   (0x0010)  
	FSteamServerAddr                                   SteamServerAddr;                                            // 0x0040   (0x0038)  
	int32_t                                            Ping;                                                       // 0x0078   (0x0004)  
	int32_t                                            Players;                                                    // 0x007C   (0x0004)  
	int32_t                                            MaxPlayers;                                                 // 0x0080   (0x0004)  
	int32_t                                            BotPlayers;                                                 // 0x0084   (0x0004)  
	int32_t                                            ServerVersion;                                              // 0x0088   (0x0004)  
	bool                                               bPassword;                                                  // 0x008C   (0x0001)  
	bool                                               BSecure;                                                    // 0x008D   (0x0001)  
	unsigned char                                      UnknownData00_7[0x22];                                      // 0x008E   (0x0022)  MISSED
};

/// Struct /Script/SteamCore.GameServerRule
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FGameServerRule
{ 
	FString                                            Name;                                                       // 0x0000   (0x0010)  
	FString                                            Value;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/SteamCore.PlaybackStatusHasChanged
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FPlaybackStatusHasChanged
{ 
	unsigned char                                      UnknownData00_2[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/SteamCore.VolumeHasChanged
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FVolumeHasChanged
{ 
	float                                              Volume;                                                     // 0x0000   (0x0004)  
};

/// Struct /Script/SteamCore.P2PSessionRequest
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FP2PSessionRequest
{ 
	FSteamID                                           SteamIDRemote;                                              // 0x0000   (0x0008)  
};

/// Struct /Script/SteamCore.P2PSessionConnectFail
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FP2PSessionConnectFail
{ 
	FSteamID                                           SteamIDRemote;                                              // 0x0000   (0x0008)  
	ESteamP2PSessionError                              P2PSessionError;                                            // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.PartyBeaconID
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FPartyBeaconID
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.JoinPartyData
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FJoinPartyData
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FPartyBeaconID                                     BeaconID;                                                   // 0x0008   (0x0008)  
	FSteamID                                           SteamIDBeaconOwner;                                         // 0x0010   (0x0008)  
	FString                                            ConnectString;                                              // 0x0018   (0x0010)  
};

/// Struct /Script/SteamCore.CreateBeaconData
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FCreateBeaconData
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FPartyBeaconID                                     BeaconID;                                                   // 0x0008   (0x0008)  
};

/// Struct /Script/SteamCore.ReservationNotificationData
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FReservationNotificationData
{ 
	FPartyBeaconID                                     BeaconID;                                                   // 0x0000   (0x0008)  
	FSteamID                                           SteamIDJoiner;                                              // 0x0008   (0x0008)  
};

/// Struct /Script/SteamCore.ChangeNumOpenSlotsData
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FChangeNumOpenSlotsData
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
};

/// Struct /Script/SteamCore.SteamRemotePlaySessionConnected
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FSteamRemotePlaySessionConnected
{ 
	int32_t                                            SessionID;                                                  // 0x0000   (0x0004)  
};

/// Struct /Script/SteamCore.SteamRemotePlaySessionDisconnected
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FSteamRemotePlaySessionDisconnected
{ 
	int32_t                                            SessionID;                                                  // 0x0000   (0x0004)  
};

/// Struct /Script/SteamCore.PublishedFileID
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FPublishedFileID
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.RemoteStorageUnsubscribePublishedFileResult
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FRemoteStorageUnsubscribePublishedFileResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FPublishedFileID                                   PublishedFileID;                                            // 0x0008   (0x0008)  
};

/// Struct /Script/SteamCore.RemoteStorageSubscribePublishedFileResult
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FRemoteStorageSubscribePublishedFileResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FPublishedFileID                                   PublishedFileID;                                            // 0x0008   (0x0008)  
};

/// Struct /Script/SteamCore.RemoteStoragePublishedFileUnsubscribed
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FRemoteStoragePublishedFileUnsubscribed
{ 
	FPublishedFileID                                   PublishedFileID;                                            // 0x0000   (0x0008)  
	int32_t                                            AppID;                                                      // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.RemoteStoragePublishedFileSubscribed
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FRemoteStoragePublishedFileSubscribed
{ 
	FPublishedFileID                                   PublishedFileID;                                            // 0x0000   (0x0008)  
	int32_t                                            AppID;                                                      // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.RemoteStorageFileWriteAsyncComplete
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FRemoteStorageFileWriteAsyncComplete
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
};

/// Struct /Script/SteamCore.RemoteStorageFileReadAsyncComplete
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FRemoteStorageFileReadAsyncComplete
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            Offset;                                                     // 0x0004   (0x0004)  
	int32_t                                            Read;                                                       // 0x0008   (0x0004)  
	unsigned char                                      UnknownData01_7[0xC];                                       // 0x000C   (0x000C)  MISSED
};

/// Struct /Script/SteamCore.SteamUGCHandle
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FSteamUGCHandle
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.RemoteStorageDownloadUGCResult
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 MaxSize: 0x0030
struct FRemoteStorageDownloadUGCResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FSteamUGCHandle                                    FileHandle;                                                 // 0x0008   (0x0008)  
	int32_t                                            AppID;                                                      // 0x0010   (0x0004)  
	int32_t                                            SizeInBytes;                                                // 0x0014   (0x0004)  
	FString                                            Filename;                                                   // 0x0018   (0x0010)  
	FSteamID                                           SteamIDOwner;                                               // 0x0028   (0x0008)  
};

/// Struct /Script/SteamCore.RemoteStorageFileShareResult
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FRemoteStorageFileShareResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FSteamUGCHandle                                    File;                                                       // 0x0008   (0x0008)  
	FString                                            Filename;                                                   // 0x0010   (0x0010)  
};

/// Struct /Script/SteamCore.ScreenshotHandle
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FScreenshotHandle
{ 
	unsigned char                                      UnknownData00_2[0x4];                                       // 0x0000   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.ScreenshotReady
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 MaxSize: 0x0008
struct FScreenshotReady
{ 
	FScreenshotHandle                                  Handle;                                                     // 0x0000   (0x0004)  
	ESteamResult                                       Result;                                                     // 0x0004   (0x0001)  
	unsigned char                                      UnknownData00_7[0x3];                                       // 0x0005   (0x0003)  MISSED
};

/// Struct /Script/SteamCore.ScreenshotRequested
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FScreenshotRequested
{ 
	unsigned char                                      UnknownData00_2[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/SteamCore.UserFavoriteItemsListChanged
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FUserFavoriteItemsListChanged
{ 
	FPublishedFileID                                   PublishedFileID;                                            // 0x0000   (0x0008)  
	ESteamResult                                       Result;                                                     // 0x0008   (0x0001)  
	bool                                               bWasAddRequest;                                             // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x000A   (0x0006)  MISSED
};

/// Struct /Script/SteamCore.CreateItemResult
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FCreateItemResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FPublishedFileID                                   PublishedFileID;                                            // 0x0008   (0x0008)  
	bool                                               bUserNeedsToAcceptWorkshopLegalAgreement;                   // 0x0010   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.SetUserItemVoteResult
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FSetUserItemVoteResult
{ 
	FPublishedFileID                                   PublishedFileID;                                            // 0x0000   (0x0008)  
	ESteamResult                                       Result;                                                     // 0x0008   (0x0001)  
	bool                                               bVoteUp;                                                    // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x000A   (0x0006)  MISSED
};

/// Struct /Script/SteamCore.GetUserItemVoteResult
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FGetUserItemVoteResult
{ 
	FPublishedFileID                                   PublishedFileID;                                            // 0x0000   (0x0008)  
	ESteamResult                                       Result;                                                     // 0x0008   (0x0001)  
	bool                                               bVotedUp;                                                   // 0x0009   (0x0001)  
	bool                                               bVotedDown;                                                 // 0x000A   (0x0001)  
	bool                                               bVoteSkipped;                                               // 0x000B   (0x0001)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.UGCQueryHandle
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FUGCQueryHandle
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.SteamUGCQueryCompleted
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FSteamUGCQueryCompleted
{ 
	FUGCQueryHandle                                    Handle;                                                     // 0x0000   (0x0008)  
	ESteamResult                                       Result;                                                     // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0009   (0x0003)  MISSED
	int32_t                                            NumResultsReturned;                                         // 0x000C   (0x0004)  
	int32_t                                            TotalMatchingResults;                                       // 0x0010   (0x0004)  
	bool                                               bCachedData;                                                // 0x0014   (0x0001)  
	unsigned char                                      UnknownData01_7[0x3];                                       // 0x0015   (0x0003)  MISSED
};

/// Struct /Script/SteamCore.AddAppDependencyResult
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FAddAppDependencyResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FPublishedFileID                                   PublishedFileID;                                            // 0x0008   (0x0008)  
	int32_t                                            AppID;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.RemoveAppDependencyResult
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FRemoveAppDependencyResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FPublishedFileID                                   PublishedFileID;                                            // 0x0008   (0x0008)  
	int32_t                                            AppID;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.AddUGCDependencyResult
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FAddUGCDependencyResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FPublishedFileID                                   PublishedFileID;                                            // 0x0008   (0x0008)  
	FPublishedFileID                                   ChildPublishedFileId;                                       // 0x0010   (0x0008)  
};

/// Struct /Script/SteamCore.RemoveUGCDependencyResult
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FRemoveUGCDependencyResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FPublishedFileID                                   PublishedFileID;                                            // 0x0008   (0x0008)  
	FPublishedFileID                                   ChildPublishedFileId;                                       // 0x0010   (0x0008)  
};

/// Struct /Script/SteamCore.UGCDeleteItemResult
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FUGCDeleteItemResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FPublishedFileID                                   PublishedFileID;                                            // 0x0008   (0x0008)  
};

/// Struct /Script/SteamCore.GetAppDependenciesResult
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FGetAppDependenciesResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FPublishedFileID                                   PublishedFileID;                                            // 0x0008   (0x0008)  
	TArray<int32_t>                                    AppIDs;                                                     // 0x0010   (0x0010)  
	int32_t                                            NumAppDependencies;                                         // 0x0020   (0x0004)  
	int32_t                                            TotalNumAppDependencies;                                    // 0x0024   (0x0004)  
};

/// Struct /Script/SteamCore.SubmitItemUpdateResult
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FSubmitItemUpdateResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	bool                                               bUserNeedsToAcceptWorkshopLegalAgreement;                   // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0002   (0x0006)  MISSED
	FPublishedFileID                                   PublishedFileID;                                            // 0x0008   (0x0008)  
};

/// Struct /Script/SteamCore.StartPlaytimeTrackingResult
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FStartPlaytimeTrackingResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
};

/// Struct /Script/SteamCore.StopPlaytimeTrackingResult
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FStopPlaytimeTrackingResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
};

/// Struct /Script/SteamCore.DownloadItemResult
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FDownloadItemResult
{ 
	int32_t                                            AppID;                                                      // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	FPublishedFileID                                   PublishedFileID;                                            // 0x0008   (0x0008)  
	ESteamResult                                       Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.ItemInstalled
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FItemInstalled
{ 
	int32_t                                            AppID;                                                      // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	FPublishedFileID                                   PublishedFileID;                                            // 0x0008   (0x0008)  
};

/// Struct /Script/SteamCore.ClientGameServerDeny
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FClientGameServerDeny
{ 
	int32_t                                            AppID;                                                      // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	FString                                            GameServerIP;                                               // 0x0008   (0x0010)  
	int32_t                                            GameServerPort;                                             // 0x0018   (0x0004)  
	bool                                               BSecure;                                                    // 0x001C   (0x0001)  
	ESteamDenyReason                                   Reason;                                                     // 0x001D   (0x0001)  
	unsigned char                                      UnknownData01_7[0x2];                                       // 0x001E   (0x0002)  MISSED
};

/// Struct /Script/SteamCore.GameWebCallback
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FGameWebCallback
{ 
	FString                                            URL;                                                        // 0x0000   (0x0010)  
};

/// Struct /Script/SteamCore.SteamTicketHandle
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FSteamTicketHandle
{ 
	unsigned char                                      UnknownData00_2[0x4];                                       // 0x0000   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.GetAuthSessionTicketResponse
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 MaxSize: 0x0008
struct FGetAuthSessionTicketResponse
{ 
	FSteamTicketHandle                                 AuthTicket;                                                 // 0x0000   (0x0004)  
	ESteamResult                                       Result;                                                     // 0x0004   (0x0001)  
	unsigned char                                      UnknownData00_7[0x3];                                       // 0x0005   (0x0003)  MISSED
};

/// Struct /Script/SteamCore.IPCFailure
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FIPCFailure
{ 
	ESteamFailureType                                  FailureType;                                                // 0x0000   (0x0001)  
};

/// Struct /Script/SteamCore.LicensesUpdated
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FLicensesUpdated
{ 
	unsigned char                                      UnknownData00_2[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/SteamCore.MicroTxnAuthorizationResponse
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FMicroTxnAuthorizationResponse
{ 
	int32_t                                            AppID;                                                      // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	FString                                            OrderId;                                                    // 0x0008   (0x0010)  
	bool                                               bAuthorized;                                                // 0x0018   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0019   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.SteamServersConnected
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FSteamServersConnected
{ 
	unsigned char                                      UnknownData00_2[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/SteamCore.SteamServerConnectFailure
/// Size: 0x0002 (2 bytes) (0x000000 - 0x000002) align 1 MaxSize: 0x0002
struct FSteamServerConnectFailure
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	bool                                               bStillRetrying;                                             // 0x0001   (0x0001)  
};

/// Struct /Script/SteamCore.SteamServersDisconnected
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FSteamServersDisconnected
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
};

/// Struct /Script/SteamCore.EncryptedAppTicketResponse
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FEncryptedAppTicketResponse
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
};

/// Struct /Script/SteamCore.StoreAuthURLResponse
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FStoreAuthURLResponse
{ 
	FString                                            URL;                                                        // 0x0000   (0x0010)  
};

/// Struct /Script/SteamCore.UserAchievementIconFetched
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 MaxSize: 0x0030
struct FUserAchievementIconFetched
{ 
	FSteamGameID                                       GameID;                                                     // 0x0000   (0x0008)  
	FString                                            AchievementName;                                            // 0x0008   (0x0010)  
	bool                                               bAchieved;                                                  // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0019   (0x0007)  MISSED
	class UTexture2D*                                  Icon;                                                       // 0x0020   (0x0008)  
	unsigned char                                      UnknownData01_7[0x8];                                       // 0x0028   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.UserAchievementStored
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FUserAchievementStored
{ 
	FSteamGameID                                       GameID;                                                     // 0x0000   (0x0008)  
	bool                                               bGroupAchievement;                                          // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
	FString                                            AchievementName;                                            // 0x0010   (0x0010)  
	int32_t                                            CurrentProgress;                                            // 0x0020   (0x0004)  
	int32_t                                            MaxProgress;                                                // 0x0024   (0x0004)  
};

/// Struct /Script/SteamCore.UserStatsReceived
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FUserStatsReceived
{ 
	FSteamID                                           GameID;                                                     // 0x0000   (0x0008)  
	ESteamResult                                       Result;                                                     // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
	FSteamID                                           SteamID;                                                    // 0x0010   (0x0008)  
};

/// Struct /Script/SteamCore.UserStatsStored
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FUserStatsStored
{ 
	FSteamGameID                                       GameID;                                                     // 0x0000   (0x0008)  
	ESteamResult                                       Result;                                                     // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.UserStatsUnloaded
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FUserStatsUnloaded
{ 
	FSteamID                                           SteamIDUser;                                                // 0x0000   (0x0008)  
};

/// Struct /Script/SteamCore.SteamLeaderboard
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FSteamLeaderboard
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.SteamLeaderboardEntries
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FSteamLeaderboardEntries
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.LeaderboardScoresDownloaded
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FLeaderboardScoresDownloaded
{ 
	FSteamLeaderboard                                  SteamLeaderboard;                                           // 0x0000   (0x0008)  
	FSteamLeaderboardEntries                           SteamLeaderboardEntries;                                    // 0x0008   (0x0008)  
	int32_t                                            EntryCount;                                                 // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.LeaderboardScoresDownloadedForUsers
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FLeaderboardScoresDownloadedForUsers
{ 
	FSteamLeaderboard                                  SteamLeaderboard;                                           // 0x0000   (0x0008)  
	FSteamLeaderboardEntries                           SteamLeaderboardEntries;                                    // 0x0008   (0x0008)  
	int32_t                                            EntryCount;                                                 // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.RequestUserStatsData
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FRequestUserStatsData
{ 
	FSteamGameID                                       GameID;                                                     // 0x0000   (0x0008)  
	ESteamResult                                       Result;                                                     // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
	FSteamID                                           SteamIDUser;                                                // 0x0010   (0x0008)  
};

/// Struct /Script/SteamCore.LeaderboardScoreUploaded
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FLeaderboardScoreUploaded
{ 
	bool                                               bSuccess;                                                   // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FSteamLeaderboard                                  SteamLeaderboard;                                           // 0x0008   (0x0008)  
	int32_t                                            Score;                                                      // 0x0010   (0x0004)  
	bool                                               bScoreChanged;                                              // 0x0014   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0015   (0x0003)  MISSED
	int32_t                                            GlobalRankNew;                                              // 0x0018   (0x0004)  
	int32_t                                            GlobalRankPrevious;                                         // 0x001C   (0x0004)  
};

/// Struct /Script/SteamCore.AttachLeaderboardUGCData
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FAttachLeaderboardUGCData
{ 
	FSteamLeaderboard                                  SteamLeaderboard;                                           // 0x0000   (0x0008)  
	ESteamResult                                       Result;                                                     // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.LeaderboardFindResult
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FLeaderboardFindResult
{ 
	FSteamLeaderboard                                  SteamLeaderboard;                                           // 0x0000   (0x0008)  
	bool                                               bLeaderboardFound;                                          // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.FindOrCreateLeaderboardData
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FFindOrCreateLeaderboardData
{ 
	FSteamLeaderboard                                  SteamLeaderboard;                                           // 0x0000   (0x0008)  
	bool                                               bLeaderboardFound;                                          // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.NumberOfCurrentPlayers
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 MaxSize: 0x0008
struct FNumberOfCurrentPlayers
{ 
	bool                                               bSuccess;                                                   // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            Players;                                                    // 0x0004   (0x0004)  
};

/// Struct /Script/SteamCore.GlobalAchievementPercentagesReady
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FGlobalAchievementPercentagesReady
{ 
	FSteamGameID                                       GameID;                                                     // 0x0000   (0x0008)  
	ESteamResult                                       Result;                                                     // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.GlobalStatsReceived
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FGlobalStatsReceived
{ 
	FSteamGameID                                       GameID;                                                     // 0x0000   (0x0008)  
	ESteamResult                                       Result;                                                     // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/SteamCore.CheckFileSignature
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FCheckFileSignature
{ 
	ESteamCheckFileSignature                           CheckFileSignature;                                         // 0x0000   (0x0001)  
};

/// Struct /Script/SteamCore.GamepadTextInputDismissed
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 MaxSize: 0x0008
struct FGamepadTextInputDismissed
{ 
	bool                                               bSubmitted;                                                 // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            SubmittedText;                                              // 0x0004   (0x0004)  
};

/// Struct /Script/SteamCore.IPCountry
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FIPCountry
{ 
	unsigned char                                      UnknownData00_2[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/SteamCore.LowBatteryPower
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FLowBatteryPower
{ 
	int32_t                                            MinutesBatteryLeft;                                         // 0x0000   (0x0004)  
};

/// Struct /Script/SteamCore.SteamShutdown
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FSteamShutdown
{ 
	unsigned char                                      UnknownData00_2[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/SteamCore.GetOPFSettingsResult
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 MaxSize: 0x0008
struct FGetOPFSettingsResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            AppID;                                                      // 0x0004   (0x0004)  
};

/// Struct /Script/SteamCore.GetVideoURLResult
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FGetVideoURLResult
{ 
	ESteamResult                                       Result;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            AppID;                                                      // 0x0004   (0x0004)  
	FString                                            URL;                                                        // 0x0008   (0x0010)  
};

/// Struct /Script/SteamCore.SteamFriendsGroupID
/// Size: 0x0002 (2 bytes) (0x000000 - 0x000002) align 2 MaxSize: 0x0002
struct FSteamFriendsGroupID
{ 
	unsigned char                                      UnknownData00_2[0x2];                                       // 0x0000   (0x0002)  MISSED
};

/// Struct /Script/SteamCore.InputAnalogActionHandle
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FInputAnalogActionHandle
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.InputDigitalActionHandle
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FInputDigitalActionHandle
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.InputActionSetHandle
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FInputActionSetHandle
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.InputHandle
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FInputHandle
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.InputMotionData
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 4 MaxSize: 0x0028
struct FInputMotionData
{ 
	float                                              RotQuatX;                                                   // 0x0000   (0x0004)  
	float                                              RotQuatY;                                                   // 0x0004   (0x0004)  
	float                                              RotQuatZ;                                                   // 0x0008   (0x0004)  
	float                                              RotQuatW;                                                   // 0x000C   (0x0004)  
	float                                              PosAccelX;                                                  // 0x0010   (0x0004)  
	float                                              PosAccelY;                                                  // 0x0014   (0x0004)  
	float                                              PosAccelZ;                                                  // 0x0018   (0x0004)  
	float                                              RotVelX;                                                    // 0x001C   (0x0004)  
	float                                              RotVelY;                                                    // 0x0020   (0x0004)  
	float                                              RotVelZ;                                                    // 0x0024   (0x0004)  
};

/// Struct /Script/SteamCore.InputDigitalActionData
/// Size: 0x0002 (2 bytes) (0x000000 - 0x000002) align 1 MaxSize: 0x0002
struct FInputDigitalActionData
{ 
	bool                                               bState;                                                     // 0x0000   (0x0001)  
	bool                                               bActive;                                                    // 0x0001   (0x0001)  
};

/// Struct /Script/SteamCore.InputAnalogActionData
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 4 MaxSize: 0x0010
struct FInputAnalogActionData
{ 
	ESteamCoreInputSourceMode                          Mode;                                                       // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              X;                                                          // 0x0004   (0x0004)  
	float                                              Y;                                                          // 0x0008   (0x0004)  
	bool                                               bActive;                                                    // 0x000C   (0x0001)  
	unsigned char                                      UnknownData01_7[0x3];                                       // 0x000D   (0x0003)  MISSED
};

/// Struct /Script/SteamCore.SteamItemInstanceID
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FSteamItemInstanceID
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.SteamItemDef
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FSteamItemDef
{ 
	int32_t                                            Value;                                                      // 0x0000   (0x0004)  
};

/// Struct /Script/SteamCore.SteamItemDetails
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FSteamItemDetails
{ 
	FSteamItemInstanceID                               InstanceID;                                                 // 0x0000   (0x0008)  
	FSteamItemDef                                      Definition;                                                 // 0x0008   (0x0004)  
	int32_t                                            Quantity;                                                   // 0x000C   (0x0004)  
	SDK_UNDEFINED(16,403) /* TArray<TEnumAsByte<ESteamCoreItemFlags>> */ __um(Flags);                              // 0x0010   (0x0010)  
};

/// Struct /Script/SteamCore.SteamP2PSessionState
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FSteamP2PSessionState
{ 
	bool                                               bConnectionActive;                                          // 0x0000   (0x0001)  
	bool                                               bConnecting;                                                // 0x0001   (0x0001)  
	ESteamP2PSessionError                              P2PSessionError;                                            // 0x0002   (0x0001)  
	bool                                               bUsingRelay;                                                // 0x0003   (0x0001)  
	int32_t                                            BytesQueuedForSend;                                         // 0x0004   (0x0004)  
	int32_t                                            PacketsQueuedForSend;                                       // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            RemoteIP;                                                   // 0x0010   (0x0010)  
	int32_t                                            RemotePort;                                                 // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/SteamCore.SteamNetworkPingLocation
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FSteamNetworkPingLocation
{ 
	FString                                            Location;                                                   // 0x0000   (0x0010)  
};

/// Struct /Script/SteamCore.SteamParentalSettingsChanged
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 MaxSize: 0x0001
struct FSteamParentalSettingsChanged
{ 
	unsigned char                                      UnknownData00_2[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/SteamCore.SteamPartyBeaconLocation
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FSteamPartyBeaconLocation
{ 
	ESteamPartiesBeaconLocationType                    Type;                                                       // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FString                                            LocationId;                                                 // 0x0008   (0x0010)  
};

/// Struct /Script/SteamCore.UGCFileWriteStreamHandle
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FUGCFileWriteStreamHandle
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.SteamSessionSearchSetting
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FSteamSessionSearchSetting
{ 
	unsigned char                                      UnknownData00_2[0x20];                                      // 0x0000   (0x0020)  MISSED
};

/// Struct /Script/SteamCore.HostPingData
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FHostPingData
{ 
	FString                                            HostString;                                                 // 0x0000   (0x0010)  
};

/// Struct /Script/SteamCore.SteamInventoryUpdateHandle
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FSteamInventoryUpdateHandle
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.UGCUpdateHandle
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FUGCUpdateHandle
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/SteamCore.SteamUGCDetails
/// Size: 0x00A8 (168 bytes) (0x000000 - 0x0000A8) align 8 MaxSize: 0x00A8
struct FSteamUGCDetails
{ 
	FPublishedFileID                                   PublishedFileID;                                            // 0x0000   (0x0008)  
	ESteamResult                                       Result;                                                     // 0x0008   (0x0001)  
	ESteamWorkshopFileType                             FileType;                                                   // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x000A   (0x0002)  MISSED
	int32_t                                            CreatorAppID;                                               // 0x000C   (0x0004)  
	int32_t                                            ConsumerAppID;                                              // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FString                                            Title;                                                      // 0x0018   (0x0010)  
	FString                                            Description;                                                // 0x0028   (0x0010)  
	FSteamID                                           SteamIDOwner;                                               // 0x0038   (0x0008)  
	int32_t                                            TimeCreated;                                                // 0x0040   (0x0004)  
	int32_t                                            TimeUpdated;                                                // 0x0044   (0x0004)  
	int32_t                                            TimeAddedToUserList;                                        // 0x0048   (0x0004)  
	ESteamRemoteStoragePublishedFileVisibility         Visibility;                                                 // 0x004C   (0x0001)  
	bool                                               bBanned;                                                    // 0x004D   (0x0001)  
	bool                                               bAcceptedForUse;                                            // 0x004E   (0x0001)  
	bool                                               bTagsTruncated;                                             // 0x004F   (0x0001)  
	TArray<FString>                                    Tags;                                                       // 0x0050   (0x0010)  
	FSteamUGCHandle                                    File;                                                       // 0x0060   (0x0008)  
	FSteamUGCHandle                                    PreviewFile;                                                // 0x0068   (0x0008)  
	FString                                            Filename;                                                   // 0x0070   (0x0010)  
	int32_t                                            FileSize;                                                   // 0x0080   (0x0004)  
	int32_t                                            PreviewFileSize;                                            // 0x0084   (0x0004)  
	FString                                            URL;                                                        // 0x0088   (0x0010)  
	int32_t                                            VotesUp;                                                    // 0x0098   (0x0004)  
	int32_t                                            VotesDown;                                                  // 0x009C   (0x0004)  
	float                                              Score;                                                      // 0x00A0   (0x0004)  
	int32_t                                            NumChildren;                                                // 0x00A4   (0x0004)  
};

/// Struct /Script/SteamCore.SteamLeaderboardEntry
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FSteamLeaderboardEntry
{ 
	FSteamID                                           SteamID;                                                    // 0x0000   (0x0008)  
	int32_t                                            GlobalRank;                                                 // 0x0008   (0x0004)  
	int32_t                                            Score;                                                      // 0x000C   (0x0004)  
	int32_t                                            Details;                                                    // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FSteamUGCHandle                                    UGCHandle;                                                  // 0x0018   (0x0008)  
};

/// Class /Script/SteamCore.SteamCoreSubsystem
/// Size: 0x0048 (72 bytes) (0x000030 - 0x000048) align 8 MaxSize: 0x0048
class USteamCoreSubsystem : public UGameInstanceSubsystem
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0030   (0x0018)  MISSED
};

/// Class /Script/SteamCore.AppList
/// Size: 0x00A8 (168 bytes) (0x000048 - 0x0000A8) align 8 MaxSize: 0x00A8
class UAppList : public USteamCoreSubsystem
{ 
public:
	SDK_UNDEFINED(16,404) /* FMulticastInlineDelegate */ __um(SteamAppInstalled);                                  // 0x0048   (0x0010)  
	SDK_UNDEFINED(16,405) /* FMulticastInlineDelegate */ __um(SteamAppUninstalled);                                // 0x0058   (0x0010)  
	unsigned char                                      UnknownData00_7[0x40];                                      // 0x0068   (0x0040)  MISSED


	/// Functions
	// Function /Script/SteamCore.AppList.GetNumInstalledApps
	int32_t GetNumInstalledApps() // [0x8dbe80] Final|Native|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func();
	}
	// Function /Script/SteamCore.AppList.GetInstalledApps
	int32_t GetInstalledApps(TArray<int32_t>& AppIDs, int32_t MaxAppIDs) // [0x8db950] Final|Native|Public|HasOutParms|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(TArray<int32_t>&, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func(AppIDs, MaxAppIDs);
	}
	// Function /Script/SteamCore.AppList.GetAppName
	int32_t GetAppName(int32_t AppID, FString& Name) // [0x8d94c0] Final|Native|Public|HasOutParms|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(int32_t, FString&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func(AppID, Name);
	}
	// Function /Script/SteamCore.AppList.GetAppInstallDir
	int32_t GetAppInstallDir(int32_t AppID, FString& Directory) // [0x8d92d0] Final|Native|Public|HasOutParms|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(int32_t, FString&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func(AppID, Directory);
	}
	// Function /Script/SteamCore.AppList.GetAppBuildId
	int32_t GetAppBuildId(int32_t AppID) // [0x8d9200] Final|Native|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		return func(AppID);
	}
};

/// Class /Script/SteamCore.Apps
/// Size: 0x00A8 (168 bytes) (0x000048 - 0x0000A8) align 8 MaxSize: 0x00A8
class UApps : public USteamCoreSubsystem
{ 
public:
	SDK_UNDEFINED(16,406) /* FMulticastInlineDelegate */ __um(DLCInstalled);                                       // 0x0048   (0x0010)  
	SDK_UNDEFINED(16,407) /* FMulticastInlineDelegate */ __um(FileDetailsResultDelegate);                          // 0x0058   (0x0010)  
	unsigned char                                      UnknownData00_7[0x40];                                      // 0x0068   (0x0040)  MISSED


	/// Functions
	// Function /Script/SteamCore.Apps.UninstallDLC
	void UninstallDLC(int32_t AppID) // [0x8dd7d0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(AppID);
	}
	// Function /Script/SteamCore.Apps.MarkContentCorrupt
	bool MarkContentCorrupt(bool bMissingFilesOnly) // [0x8dcc70] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func(bMissingFilesOnly);
	}
	// Function /Script/SteamCore.Apps.InstallDLC
	void InstallDLC(int32_t AppID) // [0x8dc4e0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(AppID);
	}
	// Function /Script/SteamCore.Apps.GetLaunchQueryParam
	FString GetLaunchQueryParam(FString Key) // [0x8dbcc0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func(Key);
	}
	// Function /Script/SteamCore.Apps.GetLaunchCommandLine
	int32_t GetLaunchCommandLine(FString& CommandLine) // [0x8dbc10] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(FString&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		return func(CommandLine);
	}
	// Function /Script/SteamCore.Apps.GetInstalledDepots
	int32_t GetInstalledDepots(int32_t AppID, int32_t MaxDepots, TArray<int32_t>& Depots) // [0x8dba50] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(int32_t, int32_t, TArray<int32_t>&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		return func(AppID, MaxDepots, Depots);
	}
	// Function /Script/SteamCore.Apps.GetFileDetails
	// void GetFileDetails(FDelegateProperty& Callback, FString Filename);                                                      // [0x8da360] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Apps.GetEarliestPurchaseUnixTime
	int32_t GetEarliestPurchaseUnixTime(int32_t AppID) // [0x8da2d0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		return func(AppID);
	}
	// Function /Script/SteamCore.Apps.GetDlcDownloadProgress
	bool GetDlcDownloadProgress(int32_t AppID, int32_t& BytesDownloaded, int32_t& BytesTotal) // [0x8da1b0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(int32_t, int32_t&, int32_t&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		return func(AppID, BytesDownloaded, BytesTotal);
	}
	// Function /Script/SteamCore.Apps.GetDLCCount
	int32_t GetDLCCount() // [0x8da180] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func();
	}
	// Function /Script/SteamCore.Apps.GetCurrentGameLanguage
	FString GetCurrentGameLanguage() // [0x8da100] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		return func();
	}
	// Function /Script/SteamCore.Apps.GetCurrentBetaName
	bool GetCurrentBetaName(FString& Name) // [0x8da050] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FString&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		return func(Name);
	}
	// Function /Script/SteamCore.Apps.GetAvailableGameLanguages
	FString GetAvailableGameLanguages() // [0x8d9600] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		return func();
	}
	// Function /Script/SteamCore.Apps.GetAppOwner
	FSteamID GetAppOwner() // [0x8d95c0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FSteamID (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		return func();
	}
	// Function /Script/SteamCore.Apps.GetAppInstallDir
	int32_t GetAppInstallDir(int32_t AppID, FString& Folder) // [0x8d93d0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(int32_t, FString&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		return func(AppID, Folder);
	}
	// Function /Script/SteamCore.Apps.GetAppBuildId
	int32_t GetAppBuildId() // [0x8d92a0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		return func();
	}
	// Function /Script/SteamCore.Apps.BIsVACBanned
	bool BIsVACBanned() // [0x8d8ec0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		return func();
	}
	// Function /Script/SteamCore.Apps.BIsTimedTrial
	bool BIsTimedTrial(int32_t& SecondsAllowed, int32_t& SecondsPlayed) // [0x8d8de0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(int32_t&, int32_t&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		return func(SecondsAllowed, SecondsPlayed);
	}
	// Function /Script/SteamCore.Apps.BIsSubscribedFromFreeWeekend
	bool BIsSubscribedFromFreeWeekend() // [0x8d8db0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		return func();
	}
	// Function /Script/SteamCore.Apps.BIsSubscribedFromFamilySharing
	bool BIsSubscribedFromFamilySharing() // [0x8d8d80] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		return func();
	}
	// Function /Script/SteamCore.Apps.BIsSubscribedApp
	bool BIsSubscribedApp(int32_t AppID) // [0x8d8cf0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		return func(AppID);
	}
	// Function /Script/SteamCore.Apps.BIsSubscribed
	bool BIsSubscribed() // [0x8d8cc0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[21]);
		return func();
	}
	// Function /Script/SteamCore.Apps.BIsLowViolence
	bool BIsLowViolence() // [0x8d8c90] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		return func();
	}
	// Function /Script/SteamCore.Apps.BIsDlcInstalled
	bool BIsDlcInstalled(int32_t AppID) // [0x8d8c00] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		return func(AppID);
	}
	// Function /Script/SteamCore.Apps.BIsCybercafe
	bool BIsCybercafe() // [0x8d8bd0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[24]);
		return func();
	}
	// Function /Script/SteamCore.Apps.BIsAppInstalled
	bool BIsAppInstalled(int32_t AppID) // [0x8d8b40] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[25]);
		return func(AppID);
	}
	// Function /Script/SteamCore.Apps.BGetDLCDataByIndex
	bool BGetDLCDataByIndex(int32_t DLC, int32_t& AppID, bool& bAvailable, FString& Name) // [0x8d89c0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(int32_t, int32_t&, bool&, FString&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[26]);
		return func(DLC, AppID, bAvailable, Name);
	}
};

/// Class /Script/SteamCore.SteamCoreAsyncAction
/// Size: 0x0038 (56 bytes) (0x000030 - 0x000038) align 8 MaxSize: 0x0038
class USteamCoreAsyncAction : public UBlueprintAsyncActionBase
{ 
public:
	TWeakObjectPtr<class UObject*>                     m_WorldContextObject;                                       // 0x0030   (0x0008)  
};

/// Class /Script/SteamCore.SteamCoreAppsAsyncActionGetFileDetails
/// Size: 0x0048 (72 bytes) (0x000038 - 0x000048) align 8 MaxSize: 0x0048
class USteamCoreAppsAsyncActionGetFileDetails : public USteamCoreAsyncAction
{ 
public:
	SDK_UNDEFINED(16,408) /* FMulticastInlineDelegate */ __um(OnCallback);                                         // 0x0038   (0x0010)  


	/// Functions
	// Function /Script/SteamCore.SteamCoreAppsAsyncActionGetFileDetails.HandleCallback
	void HandleCallback(FFileDetailsResult& Data, bool bWasSuccessful) // [0x8dc290] Final|Native|Public|HasOutParms 
	{
		typedef void (*FuncPtr)(FFileDetailsResult&, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Data, bWasSuccessful);
	}
	// Function /Script/SteamCore.SteamCoreAppsAsyncActionGetFileDetails.GetFileDetailsAsync
	USteamCoreAppsAsyncActionGetFileDetails* GetFileDetailsAsync(UObject* WorldContextObject, FString Filename, float Timeout) // [0x8da4c0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef class USteamCoreAppsAsyncActionGetFileDetails* (*FuncPtr)(UObject*, FString, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func(WorldContextObject, Filename, Timeout);
	}
};

/// Class /Script/SteamCore.SteamCoreGameMode
/// Size: 0x0308 (776 bytes) (0x000308 - 0x000308) align 8 MaxSize: 0x0308
class ASteamCoreGameMode : public AGameMode
{ 
public:
};

/// Class /Script/SteamCore.SteamCore
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class USteamCore : public UObject
{ 
public:
};

/// Class /Script/SteamCore.SteamCoreSettings
/// Size: 0x0068 (104 bytes) (0x000038 - 0x000068) align 8 MaxSize: 0x0068
class USteamCoreSettings : public UDeveloperSettings
{ 
public:
	int32_t                                            DisabledSubsystems;                                         // 0x0038   (0x0004)  
	bool                                               bEnabled;                                                   // 0x003C   (0x0001)  
	bool                                               bRelaunchInSteam;                                           // 0x003D   (0x0001)  
	bool                                               bVACEnabled;                                                // 0x003E   (0x0001)  
	bool                                               bAllowP2PPacketRelay;                                       // 0x003F   (0x0001)  
	int32_t                                            P2PConnectionTimeout;                                       // 0x0040   (0x0004)  
	int32_t                                            SteamAppId;                                                 // 0x0044   (0x0004)  
	int32_t                                            SteamDevAppId;                                              // 0x0048   (0x0004)  
	int32_t                                            Port;                                                       // 0x004C   (0x0004)  
	int32_t                                            GameServerQueryPort;                                        // 0x0050   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0054   (0x0004)  MISSED
	FString                                            GameVersion;                                                // 0x0058   (0x0010)  
};

/// Class /Script/SteamCore.Friends
/// Size: 0x0318 (792 bytes) (0x000048 - 0x000318) align 8 MaxSize: 0x0318
class UFriends : public USteamCoreSubsystem
{ 
public:
	SDK_UNDEFINED(16,409) /* FMulticastInlineDelegate */ __um(AvatarImageLoaded);                                  // 0x0048   (0x0010)  
	SDK_UNDEFINED(16,410) /* FMulticastInlineDelegate */ __um(FriendRichPresenceUpdate);                           // 0x0058   (0x0010)  
	SDK_UNDEFINED(16,411) /* FMulticastInlineDelegate */ __um(GameConnectedChatJoin);                              // 0x0068   (0x0010)  
	SDK_UNDEFINED(16,412) /* FMulticastInlineDelegate */ __um(GameConnectedChatLeave);                             // 0x0078   (0x0010)  
	SDK_UNDEFINED(16,413) /* FMulticastInlineDelegate */ __um(GameConnectedClanChatMsg);                           // 0x0088   (0x0010)  
	SDK_UNDEFINED(16,414) /* FMulticastInlineDelegate */ __um(GameConnectedFriendChatMsg);                         // 0x0098   (0x0010)  
	SDK_UNDEFINED(16,415) /* FMulticastInlineDelegate */ __um(GameLobbyJoinRequested);                             // 0x00A8   (0x0010)  
	SDK_UNDEFINED(16,416) /* FMulticastInlineDelegate */ __um(GameOverlayActivated);                               // 0x00B8   (0x0010)  
	SDK_UNDEFINED(16,417) /* FMulticastInlineDelegate */ __um(GameRichPresenceJoinRequested);                      // 0x00C8   (0x0010)  
	SDK_UNDEFINED(16,418) /* FMulticastInlineDelegate */ __um(GameServerChangeRequested);                          // 0x00D8   (0x0010)  
	SDK_UNDEFINED(16,419) /* FMulticastInlineDelegate */ __um(PersonaStateChange);                                 // 0x00E8   (0x0010)  
	SDK_UNDEFINED(16,420) /* FMulticastInlineDelegate */ __um(SetPersonaNameResponse);                             // 0x00F8   (0x0010)  
	SDK_UNDEFINED(16,421) /* FMulticastInlineDelegate */ __um(JoinClanChatRoomCompletionResult);                   // 0x0108   (0x0010)  
	SDK_UNDEFINED(16,422) /* FMulticastInlineDelegate */ __um(ClanOfficerListResponse);                            // 0x0118   (0x0010)  
	SDK_UNDEFINED(16,423) /* FMulticastInlineDelegate */ __um(DownloadClanActivityCountsResult);                   // 0x0128   (0x0010)  
	unsigned char                                      UnknownData00_7[0x1E0];                                     // 0x0138   (0x01E0)  MISSED


	/// Functions
	// Function /Script/SteamCore.Friends.SetRichPresence
	bool SetRichPresence(FString Key, FString Value) // [0x8dd660] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FString, FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Key, Value);
	}
	// Function /Script/SteamCore.Friends.SetPlayedWith
	void SetPlayedWith(FSteamID SteamIDUserPlayedWith) // [0x8dd5e0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(SteamIDUserPlayedWith);
	}
	// Function /Script/SteamCore.Friends.SetPersonaName
	// void SetPersonaName(FDelegateProperty& Callback, FString Name);                                                          // [0x8dd480] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Friends.SetListenForFriendsMessages
	bool SetListenForFriendsMessages(bool bInterceptEnabled) // [0x8dd3f0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func(bInterceptEnabled);
	}
	// Function /Script/SteamCore.Friends.SetInGameVoiceSpeaking
	void SetInGameVoiceSpeaking(FSteamID SteamIDUser, bool bSpeaking) // [0x8dd330] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FSteamID, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(SteamIDUser, bSpeaking);
	}
	// Function /Script/SteamCore.Friends.SendClanChatMessage
	bool SendClanChatMessage(FSteamID SteamIDClanChat, FString Text) // [0x8dd200] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		return func(SteamIDClanChat, Text);
	}
	// Function /Script/SteamCore.Friends.RequestUserInformation
	bool RequestUserInformation(FSteamID SteamIDUser, bool bRequireNameOnly) // [0x8dd130] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func(SteamIDUser, bRequireNameOnly);
	}
	// Function /Script/SteamCore.Friends.RequestFriendRichPresence
	void RequestFriendRichPresence(FSteamID SteamIDFriend) // [0x8dd0b0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(SteamIDFriend);
	}
	// Function /Script/SteamCore.Friends.RequestClanOfficerList
	// void RequestClanOfficerList(FDelegateProperty& Callback, FSteamID SteamIDClan);                                          // [0x8dcfb0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Friends.ReplyToFriendMessage
	bool ReplyToFriendMessage(FSteamID SteamIDFriend, FString MsgToSend) // [0x8dce80] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func(SteamIDFriend, MsgToSend);
	}
	// Function /Script/SteamCore.Friends.RegisterProtocolInOverlayBrowser
	bool RegisterProtocolInOverlayBrowser(FString Protocol) // [0x8dcd90] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		return func(Protocol);
	}
	// Function /Script/SteamCore.Friends.OpenClanChatWindowInSteam
	bool OpenClanChatWindowInSteam(FSteamID SteamIDClanChat) // [0x8dcd00] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		return func(SteamIDClanChat);
	}
	// Function /Script/SteamCore.Friends.LeaveClanChatRoom
	bool LeaveClanChatRoom(FSteamID SteamIDClan) // [0x8dcbe0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		return func(SteamIDClan);
	}
	// Function /Script/SteamCore.Friends.JoinClanChatRoom
	// void JoinClanChatRoom(FDelegateProperty& Callback, FSteamID SteamIDClan);                                                // [0x8dcae0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Friends.IsUserInSource
	bool IsUserInSource(FSteamID SteamIDUser, FSteamID SteamIDSource) // [0x8dca10] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		return func(SteamIDUser, SteamIDSource);
	}
	// Function /Script/SteamCore.Friends.IsFollowing
	// void IsFollowing(FDelegateProperty& Callback, FSteamID SteamID);                                                         // [0x8dc910] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Friends.IsClanPublic
	bool IsClanPublic(FSteamID SteamIDClan) // [0x8dc880] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		return func(SteamIDClan);
	}
	// Function /Script/SteamCore.Friends.IsClanOfficialGameGroup
	bool IsClanOfficialGameGroup(FSteamID SteamIDClan) // [0x8dc7f0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		return func(SteamIDClan);
	}
	// Function /Script/SteamCore.Friends.IsClanChatWindowOpenInSteam
	bool IsClanChatWindowOpenInSteam(FSteamID SteamIDClanChat) // [0x8dc760] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		return func(SteamIDClanChat);
	}
	// Function /Script/SteamCore.Friends.IsClanChatAdmin
	bool IsClanChatAdmin(FSteamID SteamIDClanChat, FSteamID SteamIDUser) // [0x8dc690] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		return func(SteamIDClanChat, SteamIDUser);
	}
	// Function /Script/SteamCore.Friends.InviteUserToGame
	bool InviteUserToGame(FSteamID SteamIDFriend, FString ConnectString) // [0x8dc560] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		return func(SteamIDFriend, ConnectString);
	}
	// Function /Script/SteamCore.Friends.HasFriend
	// bool HasFriend(FSteamID SteamIDFriend, TArray<ESteamFriendFlags> Flags);                                                 // [0x8dc3b0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/SteamCore.Friends.GetUserRestrictions
	// TArray<ESteamUserRestriction> GetUserRestrictions();                                                                     // [0x8dc210] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/SteamCore.Friends.GetSmallFriendAvatar
	UTexture2D* GetSmallFriendAvatar(FSteamID SteamIDFriend) // [0x8dc180] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef class UTexture2D* (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		return func(SteamIDFriend);
	}
	// Function /Script/SteamCore.Friends.GetPlayerNickname_Pure
	FString GetPlayerNickname_Pure(FSteamID SteamIDPlayer) // [0x8dc0a0] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	{
		typedef FString (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[24]);
		return func(SteamIDPlayer);
	}
	// Function /Script/SteamCore.Friends.GetPlayerNickname
	FString GetPlayerNickname(FSteamID SteamIDPlayer) // [0x8dbfd0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[25]);
		return func(SteamIDPlayer);
	}
	// Function /Script/SteamCore.Friends.GetPersonaState_Pure
	ESteamPersonaState GetPersonaState_Pure() // [0x8dbfa0] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	{
		typedef ESteamPersonaState (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[26]);
		return func();
	}
	// Function /Script/SteamCore.Friends.GetPersonaState
	ESteamPersonaState GetPersonaState() // [0x8dbfa0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef ESteamPersonaState (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[27]);
		return func();
	}
	// Function /Script/SteamCore.Friends.GetPersonaName_Pure
	FString GetPersonaName_Pure() // [0x8dbf30] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	{
		typedef FString (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[28]);
		return func();
	}
	// Function /Script/SteamCore.Friends.GetPersonaName
	FString GetPersonaName() // [0x8dbeb0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[29]);
		return func();
	}
	// Function /Script/SteamCore.Friends.GetMediumFriendAvatar
	UTexture2D* GetMediumFriendAvatar(FSteamID SteamIDFriend) // [0x8dbdf0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef class UTexture2D* (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[30]);
		return func(SteamIDFriend);
	}
	// Function /Script/SteamCore.Friends.GetLargeFriendAvatar
	UTexture2D* GetLargeFriendAvatar(FSteamID SteamIDFriend) // [0x8dbb80] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef class UTexture2D* (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[31]);
		return func(SteamIDFriend);
	}
	// Function /Script/SteamCore.Friends.GetFriendSteamLevel
	int32_t GetFriendSteamLevel(FSteamID SteamIDFriend) // [0x8db570] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[32]);
		return func(SteamIDFriend);
	}
	// Function /Script/SteamCore.Friends.GetFriendsGroupName
	FString GetFriendsGroupName(FSteamFriendsGroupID FriendsGroupID) // [0x8db880] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)(FSteamFriendsGroupID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[33]);
		return func(FriendsGroupID);
	}
	// Function /Script/SteamCore.Friends.GetFriendsGroupMembersList
	// void GetFriendsGroupMembersList(FSteamFriendsGroupID FriendsGroupID, TArray<FSteamID>& SteamIDMembers, int32_t MembersCount); // [0x8db750] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Friends.GetFriendsGroupMembersCount
	int32_t GetFriendsGroupMembersCount(FSteamFriendsGroupID FriendsGroupID) // [0x8db6c0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(FSteamFriendsGroupID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[35]);
		return func(FriendsGroupID);
	}
	// Function /Script/SteamCore.Friends.GetFriendsGroupIDByIndex
	FSteamFriendsGroupID GetFriendsGroupIDByIndex(int32_t FriendGroup) // [0x8db630] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FSteamFriendsGroupID (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[36]);
		return func(FriendGroup);
	}
	// Function /Script/SteamCore.Friends.GetFriendsGroupCount
	int32_t GetFriendsGroupCount() // [0x8db600] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[37]);
		return func();
	}
	// Function /Script/SteamCore.Friends.GetFriendRichPresenceKeyCount
	int32_t GetFriendRichPresenceKeyCount(FSteamID SteamIDFriend) // [0x8db4e0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[38]);
		return func(SteamIDFriend);
	}
	// Function /Script/SteamCore.Friends.GetFriendRichPresenceKeyByIndex
	FString GetFriendRichPresenceKeyByIndex(FSteamID SteamIDFriend, int32_t Key) // [0x8db3d0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)(FSteamID, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[39]);
		return func(SteamIDFriend, Key);
	}
	// Function /Script/SteamCore.Friends.GetFriendRichPresence
	FString GetFriendRichPresence(FSteamID SteamIDFriend, FString Key) // [0x8db260] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)(FSteamID, FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[40]);
		return func(SteamIDFriend, Key);
	}
	// Function /Script/SteamCore.Friends.GetFriendRelationship
	ESteamFriendRelationship GetFriendRelationship(FSteamID SteamIDFriend) // [0x8db1d0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef ESteamFriendRelationship (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[41]);
		return func(SteamIDFriend);
	}
	// Function /Script/SteamCore.Friends.GetFriendPersonaState
	ESteamPersonaState GetFriendPersonaState(FSteamID SteamIDFriend) // [0x8db140] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef ESteamPersonaState (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[42]);
		return func(SteamIDFriend);
	}
	// Function /Script/SteamCore.Friends.GetFriendPersonaNameHistory
	FString GetFriendPersonaNameHistory(FSteamID SteamIDFriend, int32_t PersonaName) // [0x8db030] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)(FSteamID, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[43]);
		return func(SteamIDFriend, PersonaName);
	}
	// Function /Script/SteamCore.Friends.GetFriendPersonaName
	FString GetFriendPersonaName(FSteamID SteamIDFriend) // [0x8daf60] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[44]);
		return func(SteamIDFriend);
	}
	// Function /Script/SteamCore.Friends.GetFriendMessage
	int32_t GetFriendMessage(FSteamID SteamIDFriend, int32_t MessageID, FString& Text, ESteamChatEntryType& ChatEntryType) // [0x8dade0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(FSteamID, int32_t, FString&, ESteamChatEntryType&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[45]);
		return func(SteamIDFriend, MessageID, Text, ChatEntryType);
	}
	// Function /Script/SteamCore.Friends.GetFriendGamePlayed
	bool GetFriendGamePlayed(FSteamID SteamIDFriend, FSteamGameID& GameID, FString& GameIP, int32_t& ConnectionPort, int32_t& QueryPort, FSteamID& SteamIDLobby) // [0x8dabb0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FSteamGameID&, FString&, int32_t&, int32_t&, FSteamID&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[46]);
		return func(SteamIDFriend, GameID, GameIP, ConnectionPort, QueryPort, SteamIDLobby);
	}
	// Function /Script/SteamCore.Friends.GetFriendFromSourceByIndex
	FSteamID GetFriendFromSourceByIndex(FSteamID SteamIDSource, int32_t Ifriend) // [0x8daae0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FSteamID (*FuncPtr)(FSteamID, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[47]);
		return func(SteamIDSource, Ifriend);
	}
	// Function /Script/SteamCore.Friends.GetFriendCountFromSource
	int32_t GetFriendCountFromSource(FSteamID SteamIDSource) // [0x8daa50] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[48]);
		return func(SteamIDSource);
	}
	// Function /Script/SteamCore.Friends.GetFriendCount
	// int32_t GetFriendCount(TArray<ESteamFriendFlags> Flags);                                                                 // [0x8da970] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/SteamCore.Friends.GetFriendCoplayTime
	int32_t GetFriendCoplayTime(FSteamID SteamIDFriend) // [0x8da8e0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[50]);
		return func(SteamIDFriend);
	}
	// Function /Script/SteamCore.Friends.GetFriendCoplayGame
	int32_t GetFriendCoplayGame(FSteamID SteamIDFriend) // [0x8da850] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[51]);
		return func(SteamIDFriend);
	}
	// Function /Script/SteamCore.Friends.GetFriendByIndex
	// FSteamID GetFriendByIndex(int32_t Ifriend, TArray<ESteamFriendFlags> Flags);                                             // [0x8da730] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/SteamCore.Friends.GetFollowerCount
	// void GetFollowerCount(FDelegateProperty& Callback, FSteamID SteamID);                                                    // [0x8da630] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Friends.GetCoplayFriendCount
	int32_t GetCoplayFriendCount() // [0x8da020] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[54]);
		return func();
	}
	// Function /Script/SteamCore.Friends.GetCoplayFriend
	FSteamID GetCoplayFriend(int32_t CoplayFriend) // [0x8d9f90] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FSteamID (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[55]);
		return func(CoplayFriend);
	}
	// Function /Script/SteamCore.Friends.GetClanTag
	FString GetClanTag(FSteamID SteamIDClan) // [0x8d9ec0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[56]);
		return func(SteamIDClan);
	}
	// Function /Script/SteamCore.Friends.GetClanOwner
	FSteamID GetClanOwner(FSteamID SteamIDClan) // [0x8d9e30] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FSteamID (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[57]);
		return func(SteamIDClan);
	}
	// Function /Script/SteamCore.Friends.GetClanOfficerCount
	int32_t GetClanOfficerCount(FSteamID SteamIDClan) // [0x8d9da0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[58]);
		return func(SteamIDClan);
	}
	// Function /Script/SteamCore.Friends.GetClanOfficerByIndex
	FSteamID GetClanOfficerByIndex(FSteamID SteamIDClan, int32_t Officer) // [0x8d9cd0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FSteamID (*FuncPtr)(FSteamID, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[59]);
		return func(SteamIDClan, Officer);
	}
	// Function /Script/SteamCore.Friends.GetClanName
	FString GetClanName(FSteamID SteamIDClan) // [0x8d9c00] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[60]);
		return func(SteamIDClan);
	}
	// Function /Script/SteamCore.Friends.GetClanCount
	int32_t GetClanCount() // [0x8d9bd0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[61]);
		return func();
	}
	// Function /Script/SteamCore.Friends.GetClanChatMessage
	int32_t GetClanChatMessage(FSteamID SteamIDClanChat, int32_t MessageID, FString& Text, ESteamChatEntryType& ChatEntryType, FSteamID& SteamIDChatter) // [0x8d99e0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(FSteamID, int32_t, FString&, ESteamChatEntryType&, FSteamID&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[62]);
		return func(SteamIDClanChat, MessageID, Text, ChatEntryType, SteamIDChatter);
	}
	// Function /Script/SteamCore.Friends.GetClanChatMemberCount
	int32_t GetClanChatMemberCount(FSteamID SteamIDClan) // [0x8d9950] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[63]);
		return func(SteamIDClan);
	}
	// Function /Script/SteamCore.Friends.GetClanByIndex
	FSteamID GetClanByIndex(int32_t Clan) // [0x8d98c0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FSteamID (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[64]);
		return func(Clan);
	}
	// Function /Script/SteamCore.Friends.GetClanActivityCounts
	bool GetClanActivityCounts(FSteamID SteamIDClan, int32_t& Online, int32_t& InGame, int32_t& Chatting) // [0x8d9750] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, int32_t&, int32_t&, int32_t&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[65]);
		return func(SteamIDClan, Online, InGame, Chatting);
	}
	// Function /Script/SteamCore.Friends.GetChatMemberByIndex
	FSteamID GetChatMemberByIndex(FSteamID SteamIDClan, int32_t User) // [0x8d9680] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FSteamID (*FuncPtr)(FSteamID, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[66]);
		return func(SteamIDClan, User);
	}
	// Function /Script/SteamCore.Friends.EnumerateFollowingList
	// void EnumerateFollowingList(FDelegateProperty& Callback, int32_t StartIndex);                                            // [0x8d9100] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Friends.DownloadClanActivityCounts
	// void DownloadClanActivityCounts(FDelegateProperty& Callback, TArray<FSteamID> SteamIDClans);                             // [0x8d8fa0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Friends.CloseClanChatWindowInSteam
	bool CloseClanChatWindowInSteam(FSteamID SteamIDClanChat) // [0x8d8f10] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[69]);
		return func(SteamIDClanChat);
	}
	// Function /Script/SteamCore.Friends.ClearRichPresence
	void ClearRichPresence() // [0x8d8ef0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[70]);
		func();
	}
	// Function /Script/SteamCore.Friends.ActivateGameOverlayToWebPage
	void ActivateGameOverlayToWebPage(FString URL, ESteamActivateGameOverlayToWebPageMode Mode) // [0x8d88a0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString, ESteamActivateGameOverlayToWebPageMode);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[71]);
		func(URL, Mode);
	}
	// Function /Script/SteamCore.Friends.ActivateGameOverlayToUser
	void ActivateGameOverlayToUser(FString Dialog, FSteamID SteamID) // [0x8d8780] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString, FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[72]);
		func(Dialog, SteamID);
	}
	// Function /Script/SteamCore.Friends.ActivateGameOverlayToStore
	void ActivateGameOverlayToStore(int32_t AppID, ESteamOverlayToStoreFlag Flag) // [0x8d86c0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(int32_t, ESteamOverlayToStoreFlag);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[73]);
		func(AppID, Flag);
	}
	// Function /Script/SteamCore.Friends.ActivateGameOverlayInviteDialogConnectString
	void ActivateGameOverlayInviteDialogConnectString(FString ConnectString) // [0x8d8560] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[74]);
		func(ConnectString);
	}
	// Function /Script/SteamCore.Friends.ActivateGameOverlayInvitedialog
	void ActivateGameOverlayInvitedialog(FSteamID SteamIDLobby) // [0x8d8640] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[75]);
		func(SteamIDLobby);
	}
	// Function /Script/SteamCore.Friends.ActivateGameOverlay
	void ActivateGameOverlay(FString Dialog) // [0x8d8480] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[76]);
		func(Dialog);
	}
};

/// Class /Script/SteamCore.SteamCoreFriendsAsyncActionSetPersonaName
/// Size: 0x0048 (72 bytes) (0x000038 - 0x000048) align 8 MaxSize: 0x0048
class USteamCoreFriendsAsyncActionSetPersonaName : public USteamCoreAsyncAction
{ 
public:
	SDK_UNDEFINED(16,424) /* FMulticastInlineDelegate */ __um(OnCallback);                                         // 0x0038   (0x0010)  


	/// Functions
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionSetPersonaName.SetPersonaNameAsync
	USteamCoreFriendsAsyncActionSetPersonaName* SetPersonaNameAsync(UObject* WorldContextObject, FString Name, float Timeout) // [0x8e1250] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef class USteamCoreFriendsAsyncActionSetPersonaName* (*FuncPtr)(UObject*, FString, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(WorldContextObject, Name, Timeout);
	}
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionSetPersonaName.HandleCallback
	void HandleCallback(FSetPersonaNameResponse& Data, bool bWasSuccessful) // [0x8e0ce0] Final|Native|Public|HasOutParms 
	{
		typedef void (*FuncPtr)(FSetPersonaNameResponse&, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(Data, bWasSuccessful);
	}
};

/// Class /Script/SteamCore.SteamCoreFriendsAsyncActionDownloadClanActivityCounts
/// Size: 0x0048 (72 bytes) (0x000038 - 0x000048) align 8 MaxSize: 0x0048
class USteamCoreFriendsAsyncActionDownloadClanActivityCounts : public USteamCoreAsyncAction
{ 
public:
	SDK_UNDEFINED(16,425) /* FMulticastInlineDelegate */ __um(OnCallback);                                         // 0x0038   (0x0010)  


	/// Functions
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionDownloadClanActivityCounts.HandleCallback
	void HandleCallback(FDownloadClanActivityCountsResult& Data, bool bWasSuccessful) // [0x8e0720] Final|Native|Public|HasOutParms 
	{
		typedef void (*FuncPtr)(FDownloadClanActivityCountsResult&, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Data, bWasSuccessful);
	}
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionDownloadClanActivityCounts.DownloadClanActivityCountsAsync
	// USteamCoreFriendsAsyncActionDownloadClanActivityCounts* DownloadClanActivityCountsAsync(UObject* WorldContextObject, TArray<FSteamID> SteamIDClans, float Timeout); // [0x8e0390] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/SteamCore.SteamCoreFriendsAsyncActionRequestClanOfficerList
/// Size: 0x0048 (72 bytes) (0x000038 - 0x000048) align 8 MaxSize: 0x0048
class USteamCoreFriendsAsyncActionRequestClanOfficerList : public USteamCoreAsyncAction
{ 
public:
	SDK_UNDEFINED(16,426) /* FMulticastInlineDelegate */ __um(OnCallback);                                         // 0x0038   (0x0010)  


	/// Functions
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionRequestClanOfficerList.RequestClanOfficerListAsync
	USteamCoreFriendsAsyncActionRequestClanOfficerList* RequestClanOfficerListAsync(UObject* WorldContextObject, FSteamID SteamIDClan, float Timeout) // [0x8e0fe0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef class USteamCoreFriendsAsyncActionRequestClanOfficerList* (*FuncPtr)(UObject*, FSteamID, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(WorldContextObject, SteamIDClan, Timeout);
	}
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionRequestClanOfficerList.HandleCallback
	void HandleCallback(FClanOfficerListResponse& Data, bool bWasSuccessful) // [0x8e0bd0] Final|Native|Public|HasOutParms 
	{
		typedef void (*FuncPtr)(FClanOfficerListResponse&, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(Data, bWasSuccessful);
	}
};

/// Class /Script/SteamCore.SteamCoreFriendsAsyncActionJoinClanChatRoom
/// Size: 0x0048 (72 bytes) (0x000038 - 0x000048) align 8 MaxSize: 0x0048
class USteamCoreFriendsAsyncActionJoinClanChatRoom : public USteamCoreAsyncAction
{ 
public:
	SDK_UNDEFINED(16,427) /* FMulticastInlineDelegate */ __um(OnCallback);                                         // 0x0038   (0x0010)  


	/// Functions
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionJoinClanChatRoom.JoinClanChatRoomAsync
	USteamCoreFriendsAsyncActionJoinClanChatRoom* JoinClanChatRoomAsync(UObject* WorldContextObject, FSteamID SteamIDClan, float Timeout) // [0x8e0ed0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef class USteamCoreFriendsAsyncActionJoinClanChatRoom* (*FuncPtr)(UObject*, FSteamID, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(WorldContextObject, SteamIDClan, Timeout);
	}
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionJoinClanChatRoom.HandleCallback
	void HandleCallback(FJoinClanChatRoomCompletionResult& Data, bool bWasSuccessful) // [0x8e0ae0] Final|Native|Public|HasOutParms 
	{
		typedef void (*FuncPtr)(FJoinClanChatRoomCompletionResult&, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(Data, bWasSuccessful);
	}
};

/// Class /Script/SteamCore.SteamCoreFriendsAsyncActionEnumerateFollowingList
/// Size: 0x0048 (72 bytes) (0x000038 - 0x000048) align 8 MaxSize: 0x0048
class USteamCoreFriendsAsyncActionEnumerateFollowingList : public USteamCoreAsyncAction
{ 
public:
	SDK_UNDEFINED(16,428) /* FMulticastInlineDelegate */ __um(OnCallback);                                         // 0x0038   (0x0010)  


	/// Functions
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionEnumerateFollowingList.HandleCallback
	void HandleCallback(FFriendsEnumerateFollowingList& Data, bool bWasSuccessful) // [0x8e0800] Final|Native|Public|HasOutParms 
	{
		typedef void (*FuncPtr)(FFriendsEnumerateFollowingList&, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Data, bWasSuccessful);
	}
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionEnumerateFollowingList.EnumerateFollowingListAsync
	USteamCoreFriendsAsyncActionEnumerateFollowingList* EnumerateFollowingListAsync(UObject* WorldContextObject, int32_t StartIndex, float Timeout) // [0x8e0500] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef class USteamCoreFriendsAsyncActionEnumerateFollowingList* (*FuncPtr)(UObject*, int32_t, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func(WorldContextObject, StartIndex, Timeout);
	}
};

/// Class /Script/SteamCore.SteamCoreFriendsAsyncActionIsFollowing
/// Size: 0x0048 (72 bytes) (0x000038 - 0x000048) align 8 MaxSize: 0x0048
class USteamCoreFriendsAsyncActionIsFollowing : public USteamCoreAsyncAction
{ 
public:
	SDK_UNDEFINED(16,429) /* FMulticastInlineDelegate */ __um(OnCallback);                                         // 0x0038   (0x0010)  


	/// Functions
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionIsFollowing.IsFollowingAsync
	USteamCoreFriendsAsyncActionIsFollowing* IsFollowingAsync(UObject* WorldContextObject, FSteamID SteamID, float Timeout) // [0x8e0dc0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef class USteamCoreFriendsAsyncActionIsFollowing* (*FuncPtr)(UObject*, FSteamID, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(WorldContextObject, SteamID, Timeout);
	}
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionIsFollowing.HandleCallback
	void HandleCallback(FFriendsIsFollowing& Data, bool bWasSuccessful) // [0x8e09f0] Final|Native|Public|HasOutParms 
	{
		typedef void (*FuncPtr)(FFriendsIsFollowing&, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(Data, bWasSuccessful);
	}
};

/// Class /Script/SteamCore.SteamCoreFriendsAsyncActionGetFollowerCount
/// Size: 0x0048 (72 bytes) (0x000038 - 0x000048) align 8 MaxSize: 0x0048
class USteamCoreFriendsAsyncActionGetFollowerCount : public USteamCoreAsyncAction
{ 
public:
	SDK_UNDEFINED(16,430) /* FMulticastInlineDelegate */ __um(OnCallback);                                         // 0x0038   (0x0010)  


	/// Functions
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionGetFollowerCount.HandleCallback
	void HandleCallback(FFriendsGetFollowerCount& Data, bool bWasSuccessful) // [0x8e0900] Final|Native|Public|HasOutParms 
	{
		typedef void (*FuncPtr)(FFriendsGetFollowerCount&, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Data, bWasSuccessful);
	}
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionGetFollowerCount.GetFollowerCountAsync
	USteamCoreFriendsAsyncActionGetFollowerCount* GetFollowerCountAsync(UObject* WorldContextObject, FSteamID SteamID, float Timeout) // [0x8e0610] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef class USteamCoreFriendsAsyncActionGetFollowerCount* (*FuncPtr)(UObject*, FSteamID, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func(WorldContextObject, SteamID, Timeout);
	}
};

/// Class /Script/SteamCore.SteamCoreFriendsAsyncActionRequestUserInformation
/// Size: 0x0078 (120 bytes) (0x000038 - 0x000078) align 8 MaxSize: 0x0078
class USteamCoreFriendsAsyncActionRequestUserInformation : public USteamCoreAsyncAction
{ 
public:
	SDK_UNDEFINED(16,431) /* FMulticastInlineDelegate */ __um(OnCallback);                                         // 0x0038   (0x0010)  
	unsigned char                                      UnknownData00_7[0x30];                                      // 0x0048   (0x0030)  MISSED


	/// Functions
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionRequestUserInformation.RequestUserInformationAsync
	USteamCoreFriendsAsyncActionRequestUserInformation* RequestUserInformationAsync(UObject* WorldContextObject, FSteamID SteamIDUser, bool bRequireNameOnly, float Timeout) // [0x8e10f0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef class USteamCoreFriendsAsyncActionRequestUserInformation* (*FuncPtr)(UObject*, FSteamID, bool, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(WorldContextObject, SteamIDUser, bRequireNameOnly, Timeout);
	}
	// Function /Script/SteamCore.SteamCoreFriendsAsyncActionRequestUserInformation.HandleCallback
	void HandleCallback() // [0x8e0cc0] Final|Native|Public  
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
};

/// Class /Script/SteamCore.SteamGameSearch
/// Size: 0x0198 (408 bytes) (0x000048 - 0x000198) align 8 MaxSize: 0x0198
class USteamGameSearch : public USteamCoreSubsystem
{ 
public:
	SDK_UNDEFINED(16,432) /* FMulticastInlineDelegate */ __um(SearchForGameProgressDelegate);                      // 0x0048   (0x0010)  
	SDK_UNDEFINED(16,433) /* FMulticastInlineDelegate */ __um(SearchForGameResultDelegate);                        // 0x0058   (0x0010)  
	SDK_UNDEFINED(16,434) /* FMulticastInlineDelegate */ __um(RequestPlayersForGameProgressDelegate);              // 0x0068   (0x0010)  
	SDK_UNDEFINED(16,435) /* FMulticastInlineDelegate */ __um(RequestPlayersForGameResultDelegate);                // 0x0078   (0x0010)  
	SDK_UNDEFINED(16,436) /* FMulticastInlineDelegate */ __um(RequestPlayersForGameFinalResultDelegate);           // 0x0088   (0x0010)  
	SDK_UNDEFINED(16,437) /* FMulticastInlineDelegate */ __um(SubmitPlayerResultResultDelegate);                   // 0x0098   (0x0010)  
	SDK_UNDEFINED(16,438) /* FMulticastInlineDelegate */ __um(EndGameResultDelegate);                              // 0x00A8   (0x0010)  
	unsigned char                                      UnknownData00_7[0xE0];                                      // 0x00B8   (0x00E0)  MISSED


	/// Functions
	// Function /Script/SteamCore.SteamGameSearch.SubmitPlayerResult
	ESteamGameSearchErrorCode SubmitPlayerResult(FString UniqueGameID, FSteamID SteamIDPlayer, ESteamPlayerResult PlayerResult) // [0x8e6850] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamGameSearchErrorCode (*FuncPtr)(FString, FSteamID, ESteamPlayerResult);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(UniqueGameID, SteamIDPlayer, PlayerResult);
	}
	// Function /Script/SteamCore.SteamGameSearch.SetGameHostParams
	// ESteamGameSearchErrorCode SetGameHostParams(FString Key, TArray<FString> Values);                                        // [0x8e57d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/SteamCore.SteamGameSearch.SetConnectionDetails
	ESteamGameSearchErrorCode SetConnectionDetails(FString ConnectionDetails) // [0x8e5460] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamGameSearchErrorCode (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func(ConnectionDetails);
	}
	// Function /Script/SteamCore.SteamGameSearch.SearchForGameWithLobby
	ESteamGameSearchErrorCode SearchForGameWithLobby(FSteamID SteamIDLobby, int32_t PlayerMin, int32_t PlayerMax) // [0x8e50c0] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamGameSearchErrorCode (*FuncPtr)(FSteamID, int32_t, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func(SteamIDLobby, PlayerMin, PlayerMax);
	}
	// Function /Script/SteamCore.SteamGameSearch.SearchForGameSolo
	ESteamGameSearchErrorCode SearchForGameSolo(int32_t PlayerMin, int32_t PlayerMax) // [0x8e4ff0] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamGameSearchErrorCode (*FuncPtr)(int32_t, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		return func(PlayerMin, PlayerMax);
	}
	// Function /Script/SteamCore.SteamGameSearch.RetrieveConnectionDetails
	ESteamGameSearchErrorCode RetrieveConnectionDetails(FSteamID SteamIDHost, FString& ConnectionDetails, int32_t NumConnectionDetails) // [0x8e4eb0] Final|Native|Public|HasOutParms|BlueprintCallable 
	{
		typedef ESteamGameSearchErrorCode (*FuncPtr)(FSteamID, FString&, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		return func(SteamIDHost, ConnectionDetails, NumConnectionDetails);
	}
	// Function /Script/SteamCore.SteamGameSearch.RequestPlayersForGame
	ESteamGameSearchErrorCode RequestPlayersForGame(int32_t PlayerMin, int32_t PlayerMax, int32_t MaxTeamSize) // [0x8e4cd0] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamGameSearchErrorCode (*FuncPtr)(int32_t, int32_t, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func(PlayerMin, PlayerMax, MaxTeamSize);
	}
	// Function /Script/SteamCore.SteamGameSearch.HostConfirmGameStart
	ESteamGameSearchErrorCode HostConfirmGameStart(FString UniqueGameID) // [0x8e4aa0] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamGameSearchErrorCode (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		return func(UniqueGameID);
	}
	// Function /Script/SteamCore.SteamGameSearch.EndGameSearch
	ESteamGameSearchErrorCode EndGameSearch() // [0x8e4370] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamGameSearchErrorCode (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		return func();
	}
	// Function /Script/SteamCore.SteamGameSearch.EndGame
	ESteamGameSearchErrorCode EndGame(FString UniqueGameID) // [0x8e4270] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamGameSearchErrorCode (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func(UniqueGameID);
	}
	// Function /Script/SteamCore.SteamGameSearch.DeclineGame
	ESteamGameSearchErrorCode DeclineGame() // [0x8e4120] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamGameSearchErrorCode (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		return func();
	}
	// Function /Script/SteamCore.SteamGameSearch.CancelRequestPlayersForGame
	ESteamGameSearchErrorCode CancelRequestPlayersForGame() // [0x8e3e60] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamGameSearchErrorCode (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		return func();
	}
	// Function /Script/SteamCore.SteamGameSearch.AddGameSearchParams
	// ESteamGameSearchErrorCode AddGameSearchParams(FString KeyToFind, TArray<FString> ValuesToFind);                          // [0x8e37c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/SteamCore.SteamGameSearch.AcceptGame
	ESteamGameSearchErrorCode AcceptGame() // [0x8e3790] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamGameSearchErrorCode (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		return func();
	}
};

/// Class /Script/SteamCore.SteamGameServer
/// Size: 0x0138 (312 bytes) (0x000048 - 0x000138) align 8 MaxSize: 0x0138
class USteamGameServer : public USteamCoreSubsystem
{ 
public:
	SDK_UNDEFINED(16,439) /* FMulticastInlineDelegate */ __um(GSPolicyResponse);                                   // 0x0048   (0x0010)  
	SDK_UNDEFINED(16,440) /* FMulticastInlineDelegate */ __um(GSClientGroupStatus);                                // 0x0058   (0x0010)  
	SDK_UNDEFINED(16,441) /* FMulticastInlineDelegate */ __um(GSValidateAuthTicketResponse);                       // 0x0068   (0x0010)  
	SDK_UNDEFINED(16,442) /* FMulticastInlineDelegate */ __um(GSClientApprove);                                    // 0x0078   (0x0010)  
	SDK_UNDEFINED(16,443) /* FMulticastInlineDelegate */ __um(GSClientDeny);                                       // 0x0088   (0x0010)  
	unsigned char                                      UnknownData00_7[0xA0];                                      // 0x0098   (0x00A0)  MISSED


	/// Functions
	// Function /Script/SteamCore.SteamGameServer.WasRestartRequested
	bool WasRestartRequested() // [0x8e6c40] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func();
	}
	// Function /Script/SteamCore.SteamGameServer.UserHasLicenseForApp
	ESteamUserHasLicenseForAppResult UserHasLicenseForApp(FSteamID SteamID, int32_t AppID) // [0x8e6b70] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamUserHasLicenseForAppResult (*FuncPtr)(FSteamID, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func(SteamID, AppID);
	}
	// Function /Script/SteamCore.SteamGameServer.SetSpectatorServerName
	void SetSpectatorServerName(FString SpectatorServerName) // [0x8e6340] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(SpectatorServerName);
	}
	// Function /Script/SteamCore.SteamGameServer.SetSpectatorPort
	void SetSpectatorPort(int32_t SpectatorPort) // [0x8e62b0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(SpectatorPort);
	}
	// Function /Script/SteamCore.SteamGameServer.SetServerName
	void SetServerName(FString ServerName) // [0x8e61c0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(ServerName);
	}
	// Function /Script/SteamCore.SteamGameServer.SetRegion
	void SetRegion(FString Region) // [0x8e60d0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(Region);
	}
	// Function /Script/SteamCore.SteamGameServer.SetProduct
	void SetProduct(FString Product) // [0x8e5fe0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func(Product);
	}
	// Function /Script/SteamCore.SteamGameServer.SetPasswordProtected
	void SetPasswordProtected(bool bPasswordProtected) // [0x8e5f50] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(bPasswordProtected);
	}
	// Function /Script/SteamCore.SteamGameServer.SetModDir
	void SetModDir(FString ModDir) // [0x8e5e60] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func(ModDir);
	}
	// Function /Script/SteamCore.SteamGameServer.SetMaxPlayerCount
	void SetMaxPlayerCount(int32_t PlayersMax) // [0x8e5dd0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func(PlayersMax);
	}
	// Function /Script/SteamCore.SteamGameServer.SetMapName
	void SetMapName(FString MapName) // [0x8e5ce0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func(MapName);
	}
	// Function /Script/SteamCore.SteamGameServer.SetKeyValue
	void SetKeyValue(FString Key, FString Value) // [0x8e5b60] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString, FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func(Key, Value);
	}
	// Function /Script/SteamCore.SteamGameServer.SetHeartbeatInterval
	void SetHeartbeatInterval(int32_t HeartbeatInterval) // [0x8e5ad0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func(HeartbeatInterval);
	}
	// Function /Script/SteamCore.SteamGameServer.SetGameTags
	void SetGameTags(FString GameTags) // [0x8e59e0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func(GameTags);
	}
	// Function /Script/SteamCore.SteamGameServer.SetGameDescription
	void SetGameDescription(FString GameDescription) // [0x8e56e0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func(GameDescription);
	}
	// Function /Script/SteamCore.SteamGameServer.SetGameData
	void SetGameData(FString GameData) // [0x8e55f0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func(GameData);
	}
	// Function /Script/SteamCore.SteamGameServer.SetDedicatedServer
	void SetDedicatedServer(bool bDedicated) // [0x8e5560] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func(bDedicated);
	}
	// Function /Script/SteamCore.SteamGameServer.SetBotPlayerCount
	void SetBotPlayerCount(int32_t BotPlayers) // [0x8e53d0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		func(BotPlayers);
	}
	// Function /Script/SteamCore.SteamGameServer.RequestUserGroupStatus
	bool RequestUserGroupStatus(FSteamID SteamIDUser, FSteamID SteamIDGroup) // [0x8e4de0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		return func(SteamIDUser, SteamIDGroup);
	}
	// Function /Script/SteamCore.SteamGameServer.LogOnAnonymous
	void LogOnAnonymous() // [0x8e4cb0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		func();
	}
	// Function /Script/SteamCore.SteamGameServer.LogOn
	void LogOn(FString Token) // [0x8e4bc0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		func(Token);
	}
	// Function /Script/SteamCore.SteamGameServer.LogOff
	void LogOff() // [0x8e4ba0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[21]);
		func();
	}
	// Function /Script/SteamCore.SteamGameServer.GetServerSteamID_PureCompact
	FSteamID GetServerSteamID_PureCompact() // [0x8e45b0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	{
		typedef FSteamID (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		return func();
	}
	// Function /Script/SteamCore.SteamGameServer.GetServerSteamID_Pure
	FSteamID GetServerSteamID_Pure() // [0x8e45b0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	{
		typedef FSteamID (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		return func();
	}
	// Function /Script/SteamCore.SteamGameServer.GetServerSteamID
	FSteamID GetServerSteamID() // [0x8e4570] Final|Native|Public|BlueprintCallable 
	{
		typedef FSteamID (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[24]);
		return func();
	}
	// Function /Script/SteamCore.SteamGameServer.GetServerPublicIP_PureCompact
	FString GetServerPublicIP_PureCompact() // [0x8e4500] Final|Native|Public|BlueprintCallable|BlueprintPure 
	{
		typedef FString (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[25]);
		return func();
	}
	// Function /Script/SteamCore.SteamGameServer.GetServerPublicIP_Pure
	FString GetServerPublicIP_Pure() // [0x8e4500] Final|Native|Public|BlueprintCallable|BlueprintPure 
	{
		typedef FString (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[26]);
		return func();
	}
	// Function /Script/SteamCore.SteamGameServer.GetServerPublicIP
	FString GetServerPublicIP() // [0x8e4480] Final|Native|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[27]);
		return func();
	}
	// Function /Script/SteamCore.SteamGameServer.GetAuthSessionTicket
	FSteamTicketHandle GetAuthSessionTicket(TArray<char>& Ticket) // [0x8e43c0] Final|Native|Public|HasOutParms|BlueprintCallable 
	{
		typedef FSteamTicketHandle (*FuncPtr)(TArray<char>&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[28]);
		return func(Ticket);
	}
	// Function /Script/SteamCore.SteamGameServer.ForceHeartbeat
	void ForceHeartbeat() // [0x8e43a0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[29]);
		func();
	}
	// Function /Script/SteamCore.SteamGameServer.EndAuthSession
	void EndAuthSession(FSteamID SteamID) // [0x8e41e0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[30]);
		func(SteamID);
	}
	// Function /Script/SteamCore.SteamGameServer.EnableHeartbeats
	void EnableHeartbeats(bool bActive) // [0x8e4150] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[31]);
		func(bActive);
	}
	// Function /Script/SteamCore.SteamGameServer.CreateUnauthenticatedUserConnection
	FSteamID CreateUnauthenticatedUserConnection() // [0x8e40e0] Final|Native|Public|BlueprintCallable 
	{
		typedef FSteamID (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[32]);
		return func();
	}
	// Function /Script/SteamCore.SteamGameServer.ComputeNewPlayerCompatibility
	// void ComputeNewPlayerCompatibility(FDelegateProperty& Callback, FSteamID SteamIDNewPlayer);                              // [0x8e3fe0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.SteamGameServer.ClearAllKeyValues
	void ClearAllKeyValues() // [0x8e3e90] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[34]);
		func();
	}
	// Function /Script/SteamCore.SteamGameServer.CancelAuthTicket
	void CancelAuthTicket(FSteamTicketHandle TicketHandle) // [0x8e3dd0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FSteamTicketHandle);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[35]);
		func(TicketHandle);
	}
	// Function /Script/SteamCore.SteamGameServer.BUpdateUserData
	bool BUpdateUserData(FSteamID SteamIDUser, FString PlayerName, int32_t Score) // [0x8e3b30] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FString, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[36]);
		return func(SteamIDUser, PlayerName, Score);
	}
	// Function /Script/SteamCore.SteamGameServer.BSecure
	bool BSecure() // [0x8e3b00] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[37]);
		return func();
	}
	// Function /Script/SteamCore.SteamGameServer.BLoggedOn
	bool BLoggedOn() // [0x8e3ad0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[38]);
		return func();
	}
	// Function /Script/SteamCore.SteamGameServer.BeginAuthSession
	ESteamBeginAuthSessionResult BeginAuthSession(TArray<char> Ticket, FSteamID SteamID) // [0x8e3ca0] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamBeginAuthSessionResult (*FuncPtr)(TArray<char>, FSteamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[39]);
		return func(Ticket, SteamID);
	}
	// Function /Script/SteamCore.SteamGameServer.AssociateWithClan
	// void AssociateWithClan(FDelegateProperty& Callback, FSteamID SteamIDClan);                                               // [0x8e39d0] Final|Native|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/SteamCore.GameServerStats
/// Size: 0x0078 (120 bytes) (0x000048 - 0x000078) align 8 MaxSize: 0x0078
class UGameServerStats : public USteamCoreSubsystem
{ 
public:
	SDK_UNDEFINED(16,444) /* FMulticastInlineDelegate */ __um(GSStatsUnloaded);                                    // 0x0048   (0x0010)  
	unsigned char                                      UnknownData00_7[0x20];                                      // 0x0058   (0x0020)  MISSED


	/// Functions
	// Function /Script/SteamCore.GameServerStats.UpdateUserAvgRateStat
	bool UpdateUserAvgRateStat(FSteamID SteamIDUser, FString Name, float CountThisSession, float SessionLength) // [0x8e69c0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FString, float, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(SteamIDUser, Name, CountThisSession, SessionLength);
	}
	// Function /Script/SteamCore.GameServerStats.SetUserStatInt
	bool SetUserStatInt(FSteamID SteamIDUser, FString Name, int32_t Data) // [0x8e66e0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FString, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func(SteamIDUser, Name, Data);
	}
	// Function /Script/SteamCore.GameServerStats.SetUserStatFloat
	bool SetUserStatFloat(FSteamID SteamIDUser, FString Name, float Data) // [0x8e6560] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FString, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func(SteamIDUser, Name, Data);
	}
	// Function /Script/SteamCore.GameServerStats.SetUserAchievement
	bool SetUserAchievement(FSteamID SteamIDUser, FString Name) // [0x8e6430] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func(SteamIDUser, Name);
	}
	// Function /Script/SteamCore.GameServerStats.ServerStoreUserStats
	// void ServerStoreUserStats(FDelegateProperty& Callback, FSteamID SteamIDUser);                                            // [0x8e52d0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.GameServerStats.ServerRequestUserStats
	// void ServerRequestUserStats(FDelegateProperty& Callback, FSteamID SteamIDUser);                                          // [0x8e51d0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.GameServerStats.GetUserStatInt
	bool GetUserStatInt(FSteamID SteamIDUser, FString Name, int32_t& Data) // [0x8e4910] Final|Native|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FString, int32_t&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func(SteamIDUser, Name, Data);
	}
	// Function /Script/SteamCore.GameServerStats.GetUserStatFloat
	bool GetUserStatFloat(FSteamID SteamIDUser, FString Name, float& Data) // [0x8e4780] Final|Native|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FString, float&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		return func(SteamIDUser, Name, Data);
	}
	// Function /Script/SteamCore.GameServerStats.GetUserAchievement
	bool GetUserAchievement(FSteamID SteamIDUser, FString Name, bool& bAchieved) // [0x8e45f0] Final|Native|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FString, bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		return func(SteamIDUser, Name, bAchieved);
	}
	// Function /Script/SteamCore.GameServerStats.ClearUserAchievement
	bool ClearUserAchievement(FSteamID SteamIDUser, FString Name) // [0x8e3eb0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamID, FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func(SteamIDUser, Name);
	}
};

/// Class /Script/SteamCore.Input
/// Size: 0x0048 (72 bytes) (0x000048 - 0x000048) align 8 MaxSize: 0x0048
class UInput : public USteamCoreSubsystem
{ 
public:


	/// Functions
	// Function /Script/SteamCore.Input.TriggerVibration
	void TriggerVibration(FInputHandle Handle, char LeftSpeed, char RightSpeed) // [0x8ea370] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FInputHandle, char, char);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Handle, LeftSpeed, RightSpeed);
	}
	// Function /Script/SteamCore.Input.TriggerRepeatedHapticPulse
	void TriggerRepeatedHapticPulse(FInputHandle Handle, ESteamCoreControllerPad TargetPad, char DurationMicroSec, char OffMicroSec, char Repeat, char Flags) // [0x8ea1a0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FInputHandle, ESteamCoreControllerPad, char, char, char, char);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(Handle, TargetPad, DurationMicroSec, OffMicroSec, Repeat, Flags);
	}
	// Function /Script/SteamCore.Input.TriggerHapticPulse
	void TriggerHapticPulse(FInputHandle Handle, ESteamCoreControllerPad TargetPad, char DurationMicroSec) // [0x8ea090] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FInputHandle, ESteamCoreControllerPad, char);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(Handle, TargetPad, DurationMicroSec);
	}
	// Function /Script/SteamCore.Input.TranslateActionOrigin
	ESteamCoreInputActionOrigin TranslateActionOrigin(ESteamCoreInputType DestinationInputType, ESteamCoreInputActionOrigin SourceOrigin) // [0x8e9fc0] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamCoreInputActionOrigin (*FuncPtr)(ESteamCoreInputType, ESteamCoreInputActionOrigin);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func(DestinationInputType, SourceOrigin);
	}
	// Function /Script/SteamCore.Input.StopAnalogActionMomentum
	void StopAnalogActionMomentum(FInputHandle Handle, FInputAnalogActionHandle EAction) // [0x8e9ef0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FInputHandle, FInputAnalogActionHandle);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(Handle, EAction);
	}
	// Function /Script/SteamCore.Input.Shutdown
	bool Shutdown() // [0x8e9ec0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		return func();
	}
	// Function /Script/SteamCore.Input.ShowBindingPanel
	bool ShowBindingPanel(FInputHandle Handle) // [0x8e9e20] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FInputHandle);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func(Handle);
	}
	// Function /Script/SteamCore.Input.SetLEDColor
	void SetLEDColor(FInputHandle Handle, char ColorR, char ColorG, char ColorB, ESteamCoreInputLEDFlag Flags) // [0x8e9c80] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FInputHandle, char, char, char, ESteamCoreInputLEDFlag);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(Handle, ColorR, ColorG, ColorB, Flags);
	}
	// Function /Script/SteamCore.Input.Init
	bool Init() // [0x8e9c50] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		return func();
	}
	// Function /Script/SteamCore.Input.GetStringForXboxOrigin
	FString GetStringForXboxOrigin(ESteamCoreXboxOrigin Origin) // [0x8e9b70] Final|Native|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)(ESteamCoreXboxOrigin);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func(Origin);
	}
	// Function /Script/SteamCore.Input.GetStringForActionOrigin
	FString GetStringForActionOrigin(ESteamCoreInputActionOrigin Origin) // [0x8e9a90] Final|Native|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)(ESteamCoreInputActionOrigin);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		return func(Origin);
	}
	// Function /Script/SteamCore.Input.GetRemotePlaySessionID
	int32_t GetRemotePlaySessionID(FInputHandle Handle) // [0x8e99f0] Final|Native|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(FInputHandle);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		return func(Handle);
	}
	// Function /Script/SteamCore.Input.GetMotionData
	FInputMotionData GetMotionData(FInputHandle Handle) // [0x8e9940] Final|Native|Public|BlueprintCallable 
	{
		typedef FInputMotionData (*FuncPtr)(FInputHandle);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		return func(Handle);
	}
	// Function /Script/SteamCore.Input.GetInputTypeForHandle
	ESteamCoreInputType GetInputTypeForHandle(FInputHandle Handle) // [0x8e98a0] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamCoreInputType (*FuncPtr)(FInputHandle);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		return func(Handle);
	}
	// Function /Script/SteamCore.Input.GetGlyphForXboxOrigin
	FString GetGlyphForXboxOrigin(ESteamCoreXboxOrigin Origin) // [0x8e97c0] Final|Native|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)(ESteamCoreXboxOrigin);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		return func(Origin);
	}
	// Function /Script/SteamCore.Input.GetGlyphForActionOrigin
	FString GetGlyphForActionOrigin(ESteamCoreInputActionOrigin Origin) // [0x8e96e0] Final|Native|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)(ESteamCoreInputActionOrigin);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		return func(Origin);
	}
	// Function /Script/SteamCore.Input.GetGamepadIndexForController
	int32_t GetGamepadIndexForController(FInputHandle Handle) // [0x8e9640] Final|Native|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(FInputHandle);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		return func(Handle);
	}
	// Function /Script/SteamCore.Input.GetDigitalActionOrigins
	// int32_t GetDigitalActionOrigins(FInputHandle Handle, FInputActionSetHandle ActionSetHandle, FInputDigitalActionHandle DigitalActionHandle, TArray<ESteamCoreInputActionOrigin>& OriginsOut); // [0x8e94c0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Input.GetDigitalActionHandle
	FInputDigitalActionHandle GetDigitalActionHandle(FString PszActionName) // [0x8e93d0] Final|Native|Public|BlueprintCallable 
	{
		typedef FInputDigitalActionHandle (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		return func(PszActionName);
	}
	// Function /Script/SteamCore.Input.GetDigitalActionData
	FInputDigitalActionData GetDigitalActionData(FInputHandle Handle, FInputDigitalActionHandle DigitalActionHandle) // [0x8e92f0] Final|Native|Public|BlueprintCallable 
	{
		typedef FInputDigitalActionData (*FuncPtr)(FInputHandle, FInputDigitalActionHandle);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		return func(Handle, DigitalActionHandle);
	}
	// Function /Script/SteamCore.Input.GetDeviceBindingRevision
	bool GetDeviceBindingRevision(FInputHandle Handle, int32_t& Major, int32_t& Minor) // [0x8e91d0] Final|Native|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FInputHandle, int32_t&, int32_t&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		return func(Handle, Major, Minor);
	}
	// Function /Script/SteamCore.Input.GetCurrentActionSet
	FInputActionSetHandle GetCurrentActionSet(FInputHandle Handle) // [0x8e9140] Final|Native|Public|BlueprintCallable 
	{
		typedef FInputActionSetHandle (*FuncPtr)(FInputHandle);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[21]);
		return func(Handle);
	}
	// Function /Script/SteamCore.Input.GetControllerForGamepadIndex
	FInputHandle GetControllerForGamepadIndex(int32_t Index) // [0x8e90b0] Final|Native|Public|BlueprintCallable 
	{
		typedef FInputHandle (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		return func(Index);
	}
	// Function /Script/SteamCore.Input.GetConnectedControllers
	// int32_t GetConnectedControllers(TArray<FInputHandle>& OutHandles);                                                       // [0x8e8ff0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Input.GetAnalogActionOrigins
	// int32_t GetAnalogActionOrigins(FInputHandle Handle, FInputActionSetHandle ActionSetHandle, FInputAnalogActionHandle AnalogActionHandle, TArray<ESteamCoreInputActionOrigin>& OriginsOut); // [0x8e8e70] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Input.GetAnalogActionHandle
	FInputAnalogActionHandle GetAnalogActionHandle(FString PszActionName) // [0x8e8d80] Final|Native|Public|BlueprintCallable 
	{
		typedef FInputAnalogActionHandle (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[25]);
		return func(PszActionName);
	}
	// Function /Script/SteamCore.Input.GetAnalogActionData
	FInputAnalogActionData GetAnalogActionData(FInputHandle Handle, FInputAnalogActionHandle AnalogActionHandle) // [0x8e8ca0] Final|Native|Public|BlueprintCallable 
	{
		typedef FInputAnalogActionData (*FuncPtr)(FInputHandle, FInputAnalogActionHandle);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[26]);
		return func(Handle, AnalogActionHandle);
	}
	// Function /Script/SteamCore.Input.GetActiveActionSetLayers
	// int32_t GetActiveActionSetLayers(FInputHandle Handle, TArray<FInputActionSetHandle>& Data);                              // [0x8e8ba0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Input.GetActionSetHandle
	FInputActionSetHandle GetActionSetHandle(FString ActionSetName) // [0x8e8ab0] Final|Native|Public|BlueprintCallable 
	{
		typedef FInputActionSetHandle (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[28]);
		return func(ActionSetName);
	}
	// Function /Script/SteamCore.Input.GetActionOriginFromXboxOrigin
	ESteamCoreInputActionOrigin GetActionOriginFromXboxOrigin(FInputHandle Handle, ESteamCoreXboxOrigin Origin) // [0x8e89e0] Final|Native|Public|BlueprintCallable 
	{
		typedef ESteamCoreInputActionOrigin (*FuncPtr)(FInputHandle, ESteamCoreXboxOrigin);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[29]);
		return func(Handle, Origin);
	}
	// Function /Script/SteamCore.Input.DeactivateAllActionSetLayers
	void DeactivateAllActionSetLayers(FInputHandle Handle) // [0x8e8950] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FInputHandle);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[30]);
		func(Handle);
	}
	// Function /Script/SteamCore.Input.DeactivateActionSetLayer
	void DeactivateActionSetLayer(FInputHandle Handle, FInputActionSetHandle ActionSetLayerHandle) // [0x8e8880] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FInputHandle, FInputActionSetHandle);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[31]);
		func(Handle, ActionSetLayerHandle);
	}
	// Function /Script/SteamCore.Input.ActivateActionSetLayer
	void ActivateActionSetLayer(FInputHandle Handle, FInputActionSetHandle ActionSetLayerHandle) // [0x8e87b0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FInputHandle, FInputActionSetHandle);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[32]);
		func(Handle, ActionSetLayerHandle);
	}
	// Function /Script/SteamCore.Input.ActivateActionSet
	void ActivateActionSet(FInputHandle Handle, FInputActionSetHandle ActionSetHandle) // [0x8e86e0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FInputHandle, FInputActionSetHandle);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[33]);
		func(Handle, ActionSetHandle);
	}
};

/// Class /Script/SteamCore.Inventory
/// Size: 0x0168 (360 bytes) (0x000048 - 0x000168) align 8 MaxSize: 0x0168
class UInventory : public USteamCoreSubsystem
{ 
public:
	SDK_UNDEFINED(16,445) /* FMulticastInlineDelegate */ __um(SteamInventoryResultReady);                          // 0x0048   (0x0010)  
	SDK_UNDEFINED(16,446) /* FMulticastInlineDelegate */ __um(SteamInventoryDefinitionUpdate);                     // 0x0058   (0x0010)  
	SDK_UNDEFINED(16,447) /* FMulticastInlineDelegate */ __um(SteamInventoryFullUpdate);                           // 0x0068   (0x0010)  
	SDK_UNDEFINED(16,448) /* FMulticastInlineDelegate */ __um(SteamInventoryStartPurchaseResult);                  // 0x0078   (0x0010)  
	SDK_UNDEFINED(16,449) /* FMulticastInlineDelegate */ __um(SteamInventoryRequestPricesResultDelegate);          // 0x0088   (0x0010)  
	SDK_UNDEFINED(16,450) /* FMulticastInlineDelegate */ __um(SteamInventoryEligiblePromoItemDefIDs);              // 0x0098   (0x0010)  
	unsigned char                                      UnknownData00_7[0xC0];                                      // 0x00A8   (0x00C0)  MISSED


	/// Functions
	// Function /Script/SteamCore.Inventory.TriggerItemDrop
	bool TriggerItemDrop(FSteamInventoryResult& Result, FSteamItemDef ListDefinition) // [0x8eec00] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamInventoryResult&, FSteamItemDef);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Result, ListDefinition);
	}
	// Function /Script/SteamCore.Inventory.TransferItemQuantity
	bool TransferItemQuantity(FSteamInventoryResult& Result, FSteamItemInstanceID ItemIDSource, int32_t Quantity, FSteamItemInstanceID ItemIDDest) // [0x8eeaa0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamInventoryResult&, FSteamItemInstanceID, int32_t, FSteamItemInstanceID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func(Result, ItemIDSource, Quantity, ItemIDDest);
	}
	// Function /Script/SteamCore.Inventory.SubmitUpdateProperties
	bool SubmitUpdateProperties(FSteamInventoryUpdateHandle Handle, FSteamInventoryResult& ResultHandle) // [0x8ee9c0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamInventoryUpdateHandle, FSteamInventoryResult&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func(Handle, ResultHandle);
	}
	// Function /Script/SteamCore.Inventory.StartUpdateProperties
	FSteamInventoryUpdateHandle StartUpdateProperties() // [0x8ee980] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef FSteamInventoryUpdateHandle (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func();
	}
	// Function /Script/SteamCore.Inventory.StartPurchase
	// void StartPurchase(FDelegateProperty& Callback, TArray<FSteamItemDef> ItemDefs, TArray<int32_t> Quantity);               // [0x8ee5b0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Inventory.SetPropertyString
	bool SetPropertyString(FSteamInventoryUpdateHandle Handle, FSteamItemInstanceID ItemId, FString PropertyName, FString Value) // [0x8ee3c0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamInventoryUpdateHandle, FSteamItemInstanceID, FString, FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		return func(Handle, ItemId, PropertyName, Value);
	}
	// Function /Script/SteamCore.Inventory.SetPropertyInt
	bool SetPropertyInt(FSteamInventoryUpdateHandle Handle, FSteamItemInstanceID ItemId, FString PropertyName, int32_t Value) // [0x8ee220] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamInventoryUpdateHandle, FSteamItemInstanceID, FString, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func(Handle, ItemId, PropertyName, Value);
	}
	// Function /Script/SteamCore.Inventory.SetPropertyFloat
	bool SetPropertyFloat(FSteamInventoryUpdateHandle Handle, FSteamItemInstanceID ItemId, FString PropertyName, float Value) // [0x8ee080] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamInventoryUpdateHandle, FSteamItemInstanceID, FString, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		return func(Handle, ItemId, PropertyName, Value);
	}
	// Function /Script/SteamCore.Inventory.SetPropertyBool
	bool SetPropertyBool(FSteamInventoryUpdateHandle Handle, FSteamItemInstanceID ItemId, FString PropertyName, bool bValue) // [0x8eded0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamInventoryUpdateHandle, FSteamItemInstanceID, FString, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		return func(Handle, ItemId, PropertyName, bValue);
	}
	// Function /Script/SteamCore.Inventory.SerializeResult
	bool SerializeResult(FSteamInventoryResult Handle, TArray<char>& Buffer) // [0x8edde0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamInventoryResult, TArray<char>&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func(Handle, Buffer);
	}
	// Function /Script/SteamCore.Inventory.RequestPrices
	// void RequestPrices(FDelegateProperty& Callback);                                                                         // [0x8edc60] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Inventory.RequestEligiblePromoItemDefinitionsIDs
	// void RequestEligiblePromoItemDefinitionsIDs(FDelegateProperty& Callback, FSteamID SteamID);                              // [0x8eda50] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Inventory.RemoveProperty
	bool RemoveProperty(FSteamInventoryUpdateHandle Handle, FSteamItemInstanceID ItemId, FString PropertyName) // [0x8ed8e0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamInventoryUpdateHandle, FSteamItemInstanceID, FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		return func(Handle, ItemId, PropertyName);
	}
	// Function /Script/SteamCore.Inventory.LoadItemDefinitions
	bool LoadItemDefinitions() // [0x8ed8b0] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		return func();
	}
	// Function /Script/SteamCore.Inventory.GrantPromoItems
	bool GrantPromoItems(FSteamInventoryResult& Result) // [0x8ed520] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamInventoryResult&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		return func(Result);
	}
	// Function /Script/SteamCore.Inventory.GetResultTimestamp
	int32_t GetResultTimestamp(FSteamInventoryResult Handle) // [0x8ed490] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)(FSteamInventoryResult);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		return func(Handle);
	}
	// Function /Script/SteamCore.Inventory.GetResultStatus
	ESteamResult GetResultStatus(FSteamInventoryResult Handle) // [0x8ed400] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef ESteamResult (*FuncPtr)(FSteamInventoryResult);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		return func(Handle);
	}
	// Function /Script/SteamCore.Inventory.GetResultItems
	// bool GetResultItems(FSteamInventoryResult Handle, TArray<FSteamItemDetails>& Items);                                     // [0x8ed2f0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Inventory.GetResultItemProperty
	bool GetResultItemProperty(FSteamInventoryResult Handle, int32_t ItemIndex, FString PropertyName, FString& Value) // [0x8ed130] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamInventoryResult, int32_t, FString, FString&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		return func(Handle, ItemIndex, PropertyName, Value);
	}
	// Function /Script/SteamCore.Inventory.GetNumItemsWithPrices
	int32_t GetNumItemsWithPrices() // [0x8ed100] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef int32_t (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		return func();
	}
	// Function /Script/SteamCore.Inventory.GetItemsWithPrices
	// bool GetItemsWithPrices(TArray<FSteamItemDef>& ItemDefs, TArray<int32_t>& Prices, TArray<int32_t>& BasePrices);          // [0x8ecf80] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Inventory.GetItemsByID
	// bool GetItemsByID(FSteamInventoryResult& InventoryResult, TArray<FSteamItemInstanceID> InstanceIDs);                     // [0x8ece40] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Inventory.GetItemPrice
	bool GetItemPrice(FSteamItemDef ItemDef, int32_t& Price, int32_t& BasePrice) // [0x8ecd20] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamItemDef, int32_t&, int32_t&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		return func(ItemDef, Price, BasePrice);
	}
	// Function /Script/SteamCore.Inventory.GetItemDefinitionProperty
	bool GetItemDefinitionProperty(FSteamItemDef ItemDef, FString PropertyName, FString& Value) // [0x8ecb90] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamItemDef, FString, FString&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		return func(ItemDef, PropertyName, Value);
	}
	// Function /Script/SteamCore.Inventory.GetItemDefinitionIDs
	// bool GetItemDefinitionIDs(TArray<FSteamItemDef>& ItemDefs);                                                              // [0x8ecae0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Inventory.GetEligiblePromoItemDefinitionIDs
	// bool GetEligiblePromoItemDefinitionIDs(FSteamID SteamID, TArray<FSteamItemDef>& ItemDefs);                               // [0x8ec9f0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Inventory.GetAllItems
	bool GetAllItems(FSteamInventoryResult& Handle) // [0x8ec960] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamInventoryResult&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[26]);
		return func(Handle);
	}
	// Function /Script/SteamCore.Inventory.GenerateItems
	// bool GenerateItems(FSteamInventoryResult& Result, TArray<FSteamItemDef> ItemDefs, TArray<int32_t> Quantity);             // [0x8ec7a0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Inventory.ExchangeItems
	// bool ExchangeItems(FSteamInventoryResult& Result, TArray<FSteamItemDef> ArrayGenerate, TArray<int32_t> ArrayGenerateQuantity, TArray<FSteamItemInstanceID> ArrayDestroy, TArray<int32_t> ArrayDestroyQuantity); // [0x8ec4b0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCore.Inventory.DestroyResult
	void DestroyResult(FSteamInventoryResult Handle) // [0x8ec430] Final|Native|Static|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FSteamInventoryResult);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[29]);
		func(Handle);
	}
	// Function /Script/SteamCore.Inventory.DeserializeResult
	bool DeserializeResult(FSteamInventoryResult& Result, TArray<char> Buffer, bool bReservedMustBeFalse) // [0x8ec2a0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FSteamInventoryResult&, TArray<char>, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[30]);
		return func(Result, Buffer, bReservedMustBeFalse);
	}
	// Function /Script/SteamCore.Inventory.ConsumeItem
