
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
#include "BasicType.h"
#include "CoreUObject.h"
#include "DeveloperSettings.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"

#pragma pack(push, 0x1)

class USteamCoreAppsAsyncActionGetAppBetas;
class USteamCoreAppsAsyncActionGetAppBuilds;
class USteamCoreAppsAsyncActionGetAppDepotVersions;
class USteamCoreAppsAsyncActionGetAppList;
class USteamCoreAppsAsyncActionGetCheatingReports;
class USteamCoreAppsAsyncActionGetPlayersBanned;
class USteamCoreAppsAsyncActionGetServerList;
class USteamCoreAppsAsyncActionGetServersAtAddress;
class USteamCoreAppsAsyncActionSetAppBuildLive;
class USteamCoreAppsAsyncActionUpToDateCheck;
class USteamCoreWeb;
class USteamCoreWebAsyncAction;
class USteamCoreWebAsyncActionAddItem;
class USteamCoreWebAsyncActionAddPromoItem;
class USteamCoreWebAsyncActionAdjustAgreement;
class USteamCoreWebAsyncActionAuthenticateUser;
class USteamCoreWebAsyncActionAuthenticateUserTicket;
class USteamCoreWebAsyncActionCanTrade;
class USteamCoreWebAsyncActionCancelAgreement;
class USteamCoreWebAsyncActionCancelAppListingsForUser;
class USteamCoreWebAsyncActionCancelTradeOffer;
class USteamCoreWebAsyncActionCheckAppOwnership;

class USteamCoreWebAsyncActionGetSessionDetailsForApp;
class USteamCoreWebAsyncActionGetSteamLevel;
class USteamCoreWebAsyncActionGetTradeHistory;
class USteamCoreWebAsyncActionGetTradeOffer;
class USteamCoreWebAsyncActionGetTradeOffers;
class USteamCoreWebAsyncActionGetTradeOffersSummary;
class USteamCoreWebAsyncActionGetUGCFileDetails;
class USteamCoreWebAsyncActionGetUserAgreementInfo;
class USteamCoreWebAsyncActionGetUserGroupList;
class USteamCoreWebAsyncActionGetUserHistory;
class USteamCoreWebAsyncActionGetUserInfo;
class USteamCoreWebAsyncActionGetUserStatsForGame;
class USteamCoreWebAsyncActionGrantPackage;
class USteamCoreWebAsyncActionHistoryExecuteCommand;
class USteamCoreWebAsyncActionInitTxn;
class USteamCoreWebAsyncActionIsPlayingSharedGame;
class USteamCoreWebAsyncActionItemVoteSummary;
class USteamCoreWebAsyncActionModifyItems;
class USteamCoreWebAsyncActionPostGameDataFrame;
class USteamCoreWebAsyncActionProcessAgreement;
class USteamCoreWebAsyncActionQueryTxn;
class USteamCoreWebAsyncActionRankedByPublicationOrder;
class USteamCoreWebAsyncActionRankedByTrend;
class USteamCoreWebAsyncActionRankedByVote;
class USteamCoreWebAsyncActionRefundTxn;
class USteamCoreWebAsyncActionRemovePlayerGameBan;
class USteamCoreWebAsyncActionReportAbuse;
class USteamCoreWebAsyncActionReportCheatData;
class USteamCoreWebAsyncActionReportPlayerCheating;
class USteamCoreWebAsyncActionRequestNotifications;
class USteamCoreWebAsyncActionRequestPlayerGameBan;
class USteamCoreWebAsyncActionRequestVacStatusForUser;
class USteamCoreWebAsyncActionResetLeaderboard;
class USteamCoreWebAsyncActionResolveVanityURL;
class USteamCoreWebAsyncActionResultSetSummary;
class USteamCoreWebAsyncActionSetLeaderboardScore;
class USteamCoreWebAsyncActionSetUGCUsedByGC;
class USteamCoreWebAsyncActionSetUserStatsForGame;
class USteamCoreWebAsyncActionStartAssetTransaction;
class USteamCoreWebAsyncActionStartSecureMultiplayerSession;
class USteamCoreWebAsyncActionStartTrade;
class USteamCoreWebAsyncActionSubscribePublishedFile;
class USteamCoreWebAsyncActionSupportGetAssetHistory;
class USteamCoreWebAsyncActionUnsubscribePublishedFile;
class USteamCoreWebAsyncActionUpdateSession;
class USteamCoreWebAsyncActionUserVoteSummary;
class USteamCoreWebSettings;
class USteamCoreWebSubsystem;
class USteamWebUtilities;
class UWebApps;
class UWebBroadcastService;
class UWebCheatReporting;
class UWebEconMarketService;
class UWebEconService;
class UWebGameInventory;
class UWebGameNotificationsService;
class UWebGameServersService;
class UWebInventoryService;
class UWebLeaderboards;
class UWebLobbyMatchmakingService;
class UWebMicroTxn;
class UWebPlayerService;
class UWebPublishedFileService;
class UWebPublishedItemVoting;
class UWebRemoteStorage;
class UWebSteamCommunity;
class UWebSteamEconomy;
class UWebSteamGameServerStats;
class UWebSteamNews;
class UWebSteamPublishedItemSearch;
class UWebSteamUser;
class UWebUserAuth;
class UWebUserStats;

/// Enum /Script/SteamCoreWeb.ESteamJsonResult
/// Size: 0x01 (1 bytes)
enum class ESteamJsonResult : uint8_t
{
	ESteamJsonResult__Found                                                          = 0,
	ESteamJsonResult__NotFound                                                       = 1
};

/// Enum /Script/SteamCoreWeb.ESteamValueType
/// Size: 0x01 (1 bytes)
enum class ESteamValueType : uint8_t
{
	ESteamValueType__STRING                                                          = 0,
	ESteamValueType__NUMBER                                                          = 1,
	ESteamValueType__BOOL                                                            = 2
};

/// Enum /Script/SteamCoreWeb.ESubsystemWeb
/// Size: 0x01 (1 bytes)
enum class ESubsystemWeb : uint8_t
{
	ESubsystemWeb__SteamCoreWeb                                                      = 0,
	ESubsystemWeb__Apps                                                              = 1,
	ESubsystemWeb__Broadcast                                                         = 2,
	ESubsystemWeb__CheatReporting                                                    = 3,
	ESubsystemWeb__Community                                                         = 4,
	ESubsystemWeb__Econ                                                              = 5,
	ESubsystemWeb__EconMarket                                                        = 6,
	ESubsystemWeb__Economy                                                           = 7,
	ESubsystemWeb__GameInventory                                                     = 8,
	ESubsystemWeb__GameNotifications                                                 = 9,
	ESubsystemWeb__GameServers                                                       = 10,
	ESubsystemWeb__GameServerStats                                                   = 11,
	ESubsystemWeb__Inventory                                                         = 12,
	ESubsystemWeb__LobbyMatchmaking                                                  = 13,
	ESubsystemWeb__Leaderboards                                                      = 14,
	ESubsystemWeb__MicroTxn                                                          = 15,
	ESubsystemWeb__News                                                              = 16,
	ESubsystemWeb__PlayerService                                                     = 17,
	ESubsystemWeb__PublishedFile                                                     = 18,
	ESubsystemWeb__PublishedItemSearch                                               = 19,
	ESubsystemWeb__PublishedItemVoting                                               = 20,
	ESubsystemWeb__RemoteStorage                                                     = 21,
	ESubsystemWeb__User                                                              = 22,
	ESubsystemWeb__UserAuth                                                          = 23,
	ESubsystemWeb__UserStats                                                         = 24,
	ESubsystemWeb__Workshop                                                          = 25
};

/// Enum /Script/SteamCoreWeb.ESteamCoreWebLobbyType
/// Size: 0x01 (1 bytes)
enum class ESteamCoreWebLobbyType : uint8_t
{
	ESteamCoreWebLobbyType__Private                                                  = 0,
	ESteamCoreWebLobbyType__FriendsOnly                                              = 1,
	ESteamCoreWebLobbyType__TypePublic                                               = 2,
	ESteamCoreWebLobbyType__TypeInvisible                                            = 3
};

/// Enum /Script/SteamCoreWeb.EVanityUrlType
/// Size: 0x01 (1 bytes)
enum class EVanityUrlType : uint8_t
{
	EVanityUrlType__Individual                                                       = 0,
	EVanityUrlType__Group                                                            = 1,
	EVanityUrlType__OfficialGameGroup                                                = 2
};

/// Struct /Script/SteamCoreWeb.SteamCoreJson
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FSteamCoreJson
{ 
	FString                                            Key;                                                        // 0x0000   (0x0010)  
	FString                                            String;                                                     // 0x0010   (0x0010)  
	int32_t                                            Number;                                                     // 0x0020   (0x0004)  
	bool                                               Bool;                                                       // 0x0024   (0x0001)  
	ESteamValueType                                    Type;                                                       // 0x0025   (0x0001)  
	unsigned char                                      UnknownData00_7[0x2];                                       // 0x0026   (0x0002)  MISSED
};

/// Class /Script/SteamCoreWeb.SteamCoreWeb
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class USteamCoreWeb : public UObject
{ 
public:
};

/// Class /Script/SteamCoreWeb.SteamCoreWebSubsystem
/// Size: 0x0048 (72 bytes) (0x000030 - 0x000048) align 8 MaxSize: 0x0048
class USteamCoreWebSubsystem : public UGameInstanceSubsystem
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0030   (0x0018)  MISSED
};

/// Class /Script/SteamCoreWeb.SteamCoreWebAsyncAction
/// Size: 0x0058 (88 bytes) (0x000030 - 0x000058) align 8 MaxSize: 0x0058
class USteamCoreWebAsyncAction : public UBlueprintAsyncActionBase
{ 
public:
	SDK_UNDEFINED(16,644) /* FMulticastInlineDelegate */ __um(OnCallback);                                         // 0x0030   (0x0010)  
	unsigned char                                      UnknownData00_7[0x18];                                      // 0x0040   (0x0018)  MISSED


	/// Functions
	// Function /Script/SteamCoreWeb.SteamCoreWebAsyncAction.HandleCallback
	void HandleCallback(FString Data, bool bWasSuccessful) // [0x96d620] Native|Public        
	{
		typedef void (*FuncPtr)(FString, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Data, bWasSuccessful);
	}
};

/// Class /Script/SteamCoreWeb.SteamCoreWebSettings
/// Size: 0x0078 (120 bytes) (0x000038 - 0x000078) align 8 MaxSize: 0x0078
class USteamCoreWebSettings : public UDeveloperSettings
{ 
public:
	float                                              AsyncTaskTimeout;                                           // 0x0038   (0x0004)  
	int32_t                                            DisabledSubsystems;                                         // 0x003C   (0x0004)  
	bool                                               bDebugging;                                                 // 0x0040   (0x0001)  
	bool                                               bDevMode;                                                   // 0x0041   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0042   (0x0006)  MISSED
	FString                                            Key;                                                        // 0x0048   (0x0010)  
	int32_t                                            AppID;                                                      // 0x0058   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x005C   (0x0004)  MISSED
	FString                                            DevSteamID;                                                 // 0x0060   (0x0010)  
	bool                                               bSandboxMode;                                               // 0x0070   (0x0001)  
	unsigned char                                      UnknownData02_7[0x7];                                       // 0x0071   (0x0007)  MISSED
};

/// Class /Script/SteamCoreWeb.SteamWebUtilities
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class USteamWebUtilities : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/SteamCoreWeb.SteamWebUtilities.ParseJson
	// bool ParseJson(FString JsonString, TArray<FSteamCoreJson>& Data);                                                        // [0x96d710] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/SteamCoreWeb.SteamWebUtilities.GetProjectKey
	FString GetProjectKey() // [0x96cf00] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	{
		typedef FString (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func();
	}
